Repository: leanprover-community/NNG4
Catalog: .i18n/*/Game.po
Languages: fr, it, uk, zh

source: ## Summary If the goal is `P → Q`, then `intro h` will introduce `h : P` as a hypothesis, and change the goal to `Q`. Mathematically, it says that to prove $P \implies Q$, we can assume $P$ and then prove $Q$. ### Example: If your goal is `x + 1 = y + 1 → x = y` (the way Lean writes $x+1=y+1 \implies x=y$) then `intro h` will give you a hypothesis $x+1=y+1$ named `h`, and the goal will change to $x=y$.
fr: ## Résumé Si le but est `P → Q`, alors `intro h` introduira `h : P` comme hypothèse, et changera le but en `Q`. Mathématiquement, cela signifie que pour prouver $P \implies Q$, nous pouvons supposer $P$ et ensuite prouver $Q$. ### Exemple : Si votre but est `x + 1 = y + 1 → x = y` (la façon dont Lean écrit $x+1=y+1 \implies x=y$) alors `intro h` vous donnera une hypothèse $x+1=y+1$ nommée `h`, et le but changera en $x=y$.
it: ## Descrizione Se il goal è `P → Q`, allora `intro h` introdurrà `h : P` come ipotesi, e lascerà nel goal solo `Q`. Nella matematica, per dimostrare l'implicazione $P \implies Q$, possiamo dare per vero $P$ e dimostrare $Q$. ### Ad esempio: Se il goal è `x + 1 = y + 1 → x = y` (codice Lean per $x+1=y+1 \implies x=y$) allora `intro h` creerà un'ipotesi $x+1=y+1$ con nome `h`, e il goal diventerà $x=y$.
uk: ## Резюме Якщо мета `P → Q`, тоді `intro h` введе `h : P` як гіпотезу, і змініть ціль на `Q`. Математично це говорить, що для доведення $P \implies Q$, ми можемо припустити $P$ і потім довести $Q$. ### Приклад: Якщо ваша мета це `x + 1 = y + 1 → x = y` (як пишеться у Lean $x+1=y+1 \implies x=y$) тоді `intro h` дасть вам гіпотезу $x+1=y+1$ під назвою `h`, а мета зміниться на $x=y$.
zh: ## 概述 如果目标是 `P → Q`，那么 `intro h` 将引入 `h : P` 作为假设， 并将目标更改为 `Q`。从数学上讲，要证明 $P\implies Q$， 我们可以假设 $P$ ，然后证明 $Q$ 。 ### 例子： 如果您的目标是 `x + 1 = y + 1 → x = y` （在Lean中这表示 $x+1=y+1\implies x=y$ ） 那么 `intro h` 会给你一个名为 `h` 的假设 $x+1=y+1$ ，目标 也同时更改为 $x=y$。

source: We have seen how to `apply` theorems and assumptions of the form `P → Q`. But what if our *goal* is of the form `P → Q`? To prove this goal, we need to know how to say "let's assume `P` and deduce `Q`" in Lean. We do this with the `intro` tactic.
fr: Nous avons vu comment utilsier `apply` sur des théorèmes et des hypothèses de la forme `P → Q`. Mais que faire si notre *but* est de la forme `P → Q` ? Pour prouver ce but, nous devons savoir dire "supposons `P` et déduisons `Q`" dans Lean. Nous faisons cela avec la tactique `intro`.
it: Abbiamo visto come fare `apply` di teoremi e ipotesi della forma `P → Q`. Ma come ci comportiamo se è il *goal* ad avere la forma `P → Q`? Per dimostrare questo tipo di goal, ci serve un modo per dire a Lean "supponiamo `P` e deduciamo `Q`". Lo possiamo fare con la tattica `intro`.
uk: Ми побачили, як `apply`-іти теореми та припущення виду `P → Q`. Але що, якщо наша *мета* має форму `P → Q`? Щоб підтвердити цю мету, нам потрібно знати, як сказати "давайте припустимо `P` і виведемо `Q`" в Lean. Ми робимо це за допомогою тактики `intro`.
zh: 我们已经看到了如何 `apply` 形式为 `P → Q` 的定理和假设。 但如果我们的 *目标* 是形式为 `P → Q` 的呢？ 要证明这个目标，我们需要知道如何在 Lean 中表示 “假设 `P` 并推导出 `Q`”。我们用 `intro` 策略来做这件事。

source: Start with `intro h` to assume the hypothesis and call its proof `h`.
fr: Commencez par `intro h` pour supposer l'hypothèse et appeler sa preuve `h`.
it: Comincia eseguendo `intro h` per introdurre l'ipotesi nel contesto e darle il nome `h`.
uk: Почніть із `intro h`, щоб припустити гіпотезу та назвати її доказ `h`.
zh: 使用 `intro h` 来设假设为 `h`。

source: Now `exact h` finishes the job.
fr: Maintenant `exact h` termine le travail.
it: Ora concludi con `exact h`.
uk: Тепер `exact h` завершить роботу.
zh: 现在，用 `exact h ` 完成证明。

source: intro practice
fr: pratique de intro
it: esercizi su intro
uk: Практика intro
zh: 练习 `intro` 策略

source: Let's see if you can use the tactics we've learnt to prove $x+1=y+1\implies x=y$. Try this one by yourself; if you need help then click on "Show more help!".
fr: Voyons si vous pouvez utiliser les tactiques que nous avons apprises pour prouver $x+1=y+1\implies x=y$. Essayez par vous-même ; si vous avez besoin d'aide, cliquez sur "Afficher plus d'aide !".
it: Mettiti alla prova applicando le tattiche che abbiamo appena visto per dimostrare $x+1=y+1\implies x=y$. Cerca di dimostrarlo da solo; se ti perdi e hai bisogno di una mano clicca su "Aiutami!".
uk: Давайте подивимося, чи зможете ви застосувати тактики, яких ми навчилися, щоб довести, що $x+1=y+1\implies x=y$. Спробуйте це самостійно; якщо вам потрібна допомога, натисніть «Показати більше допомоги!».
zh: 让我们看看您能否利用我们学到的策略来证明 $x+1=y+1\implies x=y$。 如果您需要帮助，请点击 "显示更多帮助！"。

source: Start with `intro h` to assume the hypothesis.
fr: Commencez par `intro h` pour supposer l'hypothèse.
it: Inizia con `intro h` per supporre l'ipotesi.
uk: Почніть із `intro h`, щоб припустити гіпотезу.
zh: 用 `intro h` 开始设假设。

source: Now `repeat rw [← succ_eq_add_one] at h` is the quickest way to change `h` to `succ x = succ y`.
fr: Maintenant `repeat rw [← succ_eq_add_one] at h` est le moyen le plus rapide de changer `h` en `succ x = succ y`.
uk: Тепер виконайте `repeat rw [← succ_eq_add_one] at h` — це найшвидший спосіб змініти `h` на `succ x = succ y`.

source: Now `apply succ_inj at h` to cancel the `succ`s.
fr: Maintenant `apply succ_inj at h` pour annuler les `succ`.
it: Ora esegui `apply succ_inj at h` per togliere i `succ`.
uk: Тепер `apply succ_inj at h`, щоб скасувати `succ`-и.
zh: 现在使用 `apply succ_inj at h` 来消去 `succ`。

source: Now `rw [h]` then `rfl` works, but `exact h` is quicker.
fr: Maintenant `rw [h]` puis `rfl` fonctionne, mais `exact h` est plus rapide.
it: Ora potresti usare `rw [h]` e `rfl` in successione, ma `exact h` è più elegante.
uk: Тепер `rw [h]`, тоді запрацює `rfl`, але `exact h` швидше.
zh: 现在 `rw [h]` 和 `rfl` 可以完成证明，但 `exact h` 更快。

source: Here's a completely backwards proof: ``` intro h apply succ_inj repeat rw [succ_eq_add_one] exact h ```
fr: Voici une preuve complètement à l'envers : ``` intro h apply succ_inj repeat rw [succ_eq_add_one] exact h ```
it: Ecco una dimostrazione che procede all'indietro: ``` intro h apply succ_inj repeat rw [succ_eq_add_one] exact h ```
uk: Ось повний доказ у зворотньому напрямку: ``` intro h apply succ_inj repeat rw [succ_eq_add_one] exact h ```
zh: 这是一个完全逆向的证明过程： ``` intro h apply succ_inj repeat rw [succ_eq_add_one] exact h ```

source: We still can't prove `2 + 2 ≠ 5` because we have not talked about the definition of `≠`. In Lean, `a ≠ b` is *notation* for `a = b → False`. Here `False` is a generic false proposition, and `→` is Lean's notation for "implies". In logic we learn that `True → False` is false, but `False → False` is true. Hence `X → False` is the logical opposite of `X`. Even though `a ≠ b` does not look like an implication, you should treat it as an implication. The next two levels will show you how. `False` is a goal which you cannot deduce from a consistent set of assumptions! So if your goal is `False` then you had better hope that your hypotheses are contradictory, which they are in this level.
fr: Nous ne pouvons toujours pas prouver `2 + 2 ≠ 5` car nous n'avons pas parlé de la définition de `≠`. Dans Lean, `a ≠ b` est une *notation* pour `a = b → False`. Ici `False` est une proposition fausse générique, et `→` est la notation de Lean pour "implique". En logique, nous apprenons que `True → False` est faux, mais `False → False` est vrai. Par conséquent, `X → False` est l'opposé logique de `X`. Même si `a ≠ b` ne ressemble pas à une implication, vous devez la traiter comme telle. Les deux prochains niveaux vous montreront comment. `False` est un but que vous ne pouvez pas déduire d'un ensemble cohérent d'hypothèses ! Donc si votre but est `False`, vous feriez mieux d'espérer que vos hypothèses soient contradictoires, ce qu'elles sont dans ce niveau.
it: Non possiamo ancora dimostrare `2 + 2 ≠ 5` perché non abbiamo ancora dato la definizione dell'operatore `≠`. In Lean, `a ≠ b` è *notazione* per `a = b → False`. `False` è la proposizione falsa più banale, e `→` è la notazione di Lean per l'operatore "implica". Dalla tabella della verità dell'implicazione sappiamo che `True → False` è falso, mentre `False → False` è vero. Quindi `X → False` equivale alla negazione logica di `X`. Non si è abituati a vedere `a ≠ b` come un'implicazione, ma in Lean è comodo trattarla come tale. I prossimi due livelli ti faranno vedere come. `False` è un goal insoddisfacibile, impossibile da dedurre da un insieme consistente di ipotesi! Quindi se ti capita `False` come goal, puoi solo sperare di avere una contraddizione tra le tue ipotesi, come accade in questo livello.
uk: Ми все ще не можемо довести, що `2 + 2 ≠ 5`, тому що ми не говорили про визначення `≠`. У Lean `a ≠ b` є *нотацією* для `a = b → False`. Тут `False` є загальним хибним твердженням, а `→` є позначенням Lean для "припускає". На логіці ми дізналися що що `True → False` є хибним, але `False → False` є істинним. Отже `X → False` є логічною протилежністю `X`. Незважаючи на те, що `a ≠ b` не виглядає імплікацією, ви повинні розглядати її саме так Наступні два рівні покажуть вам, як на це дивитися. `False` - це мета, яку ви не можете вивести із послідовного набору припущень! Отже, якщо ваша мета `False`, то вам краще сподіватися, що ваші гіпотези є протиречивими, і вони саме такі на цьому рівні.
zh: 我们仍然不能证明 `2 + 2 ≠ 5`，因为我们还没有讨论 `≠` 的定义。在 Lean 中，`a ≠ b` 是 `a = b → False` 的*符号表示*。这里的 `False` 是一个通用的假命题，`→` 是 Lean 中表示“蕴含”的符号 。 在逻辑学中我们学到，`True → False` 是假的，但 `False → False` 是真的。因此，`X → false` 是 `X` 的逻辑取反。 尽管 `a ≠ b` 看起来不像蕴含，你应该将其视为蕴含。接下来的两关将向你展示怎样使用它。 `False` 是一个无法从一致的假设集中推导出的目标！所以如果你的目标是 `False`，那么你最好希望你的假设是矛盾的，就像在本关中一样。

source: If $x=y$ and $x \neq y$ then we can deduce a contradiction.
fr: Si $x=y$ et $x \neq y$ alors nous pouvons déduire une contradiction.
it: Se $x=y$ e $x \neq y$ allora possiamo dedurre una contraddizione.
uk: Якщо $x=y$ і $x \neq y$, то ми можемо вивести протиріччя.
zh: 如果 $x=y$ 且 $x \neq y$ 那么我们可以推出矛盾。

source: Remember that `h2` is a proof of `x = y → False`. Try `apply`ing `h2` either `at h1` or directly to the goal.
fr: Rappelez-vous que `h2` est une preuve de `x = y → False`. Essayez avec `apply` `h2` avec en plus `at h1` ou bien directement au but.
it: Ricorda che `h2` è la dimostrazione di `x = y → False`. Fai l'`apply` di `h2` con `at h1` o direttamente sul goal.
uk: Пам’ятайте, що `h2` є доказом `x = y → False`. Спробуй `apply`-їти `h2` або `at h1` або безпосередньо до мети.
zh: 记住，`h2` 是 `x = y → False` 的证明。尝试将 `h2` 应用（`apply`）于 `h1` 或直接应用于目标。

source: `a ≠ b` is *notation* for `(a = b) → False`. The reason this is mathematically valid is that if `P` is a true-false statement then `P → False` is the logical opposite of `P`. Indeed `True → False` is false, and `False → False` is true! The upshot of this is that you can treat `a ≠ b` in exactly the same way as you treat any implication `P → Q`. For example, if your *goal* is of the form `a ≠ b` then you can make progress with `intro h`, and if you have a hypothesis `h` of the form `a ≠ b` then you can `apply h at h1` if `h1` is a proof of `a = b`.
fr: `a ≠ b` est une *notation* pour `(a = b) → False`. La raison pour laquelle c'est mathématiquement valide est que si `P` est un énoncé vrai-faux alors `P → False` est l'opposé logique de `P`. En effet `True → False` est faux, et `False → False` est vrai ! La conséquence est que vous pouvez traiter `a ≠ b` exactement de la même manière que toute implication `P → Q`. Par exemple, si votre *but* est de la forme `a ≠ b` alors vous pouvez avancer avec `intro h`, et si vous avez une hypothèse `h` de la forme `a ≠ b` alors vous pouvez utiliser `apply h at h1` si `h1` est une preuve de `a = b`.
uk: `a ≠ b` — це *нотація* для `(a = b) → False`. Причина що це математично коректно є те, що якщо `P` є булевим твердженням правда-хибно, тоді `P → False` є логічною протилежністю `P`. Дійсно, `True → False` є хибним, а `False → False` є правдою! Результатом цього є те, що ви можете обробити `a ≠ b` точно так само, як ви обробляєте будь-яку імплікацію `P → Q`. Наприклад, якщо ваша *мета* має форму `a ≠ b`, то ви можете досягти прогресу з `intro h`, і якщо у вас є гіпотеза `h` у формі `a ≠ b`, тоді ви можете `apply h at h1`, якщо `h1` є доказом що `a = b`.

source: Remember, `x ≠ y` is *notation* for `x = y → False`.
fr: Rappelez-vous, `x ≠ y` est une *notation* pour `x = y → False`.
it: Ricorda, `x ≠ y` è *zucchero sintattico* per `x = y → False`.
uk: Пам’ятайте, що `x ≠ y` є *нотацією* для `x = y → False`.
zh: 记住，`x ≠ y` 是 `x = y → False` 的 *符号表示* 。

source: `zero_ne_succ n` is the proof that `0 ≠ succ n`. In Lean, `a ≠ b` is *defined to mean* `a = b → False`. Hence `zero_ne_succ n` is really a proof of `0 = succ n → False`. Here `False` is a generic false statement. This means that you can `apply zero_ne_succ at h` if `h` is a proof of `0 = succ n`.
fr: `zero_ne_succ n` est la preuve que `0 ≠ succ n`. Dans Lean, `a ≠ b` est *défini comme signifiant* `a = b → False`. Par conséquent `zero_ne_succ n` est en réalité une preuve de `0 = succ n → False`. Ici `False` est un énoncé faux générique. Cela signifie que vous pouvez `apply zero_ne_succ at h` si `h` est une preuve de `0 = succ n`.
it: `zero_ne_succ n` è la dimostrazione che `0 ≠ succ n`. In Lean, `a ≠ b` è *definito come* `a = b → False`. Dunque `zero_ne_succ n` è in realtà la dimostrazione di `0 = succ n → False`. Qui `False` è la proposizione false più banale. Essendo un'implicazione puoi applicarla ad una `h` che dimostra `0 = succ n` con `apply zero_ne_succ at h`.
uk: `zero_ne_succ n` є доказом того, що `0 ≠ succ n`. У Lean `a ≠ b` *визначено означати* `a = b → False`. Отже `zero_ne_succ n` насправді є доказом `0 = succ n → False`. Тут `False` — це загальне хибне твердження. Це означає, що ви можете `apply zero_ne_succ at h`, якщо `h` є доказом `0 = succ n`.
zh: `zero_ne_succ n` 是 `0 ≠ succ n` 的证明。 在 Lean 中，`a ≠ b` *被定义为* `a = b → False`。 因此，`zero_ne_succ n` 实际上是 `0 = succ n → False` 的证明。 这里的 `False` 是一个通用的假命题。这意味着如果 `h` 是 `0 = succ n` 的证明，你可以 `apply zero_ne_succ at h`。

source: As warm-up for `2 + 2 ≠ 5` let's prove `0 ≠ 1`. To do this we need to introduce Peano's last axiom `zero_ne_succ n`, a proof that `0 ≠ succ n`. To learn about this result, click on it in the list of lemmas on the right.
fr: Comme échauffement pour `2 + 2 ≠ 5`, prouvons `0 ≠ 1`. Pour cela, nous devons introduire le dernier axiome de Peano `zero_ne_succ n`, une preuve que `0 ≠ succ n`. Pour en savoir plus sur ce résultat, cliquez dessus dans la liste des lemmes à droite.
it: Come riscaldamento per il boss `2 + 2 ≠ 5` dimostriamo `0 ≠ 1`. A tal fine dobbiamo introdurre l'ultimo assioma di Peano, `zero_ne_succ n`, che dimostra che `0 ≠ succ n`. Per capire meglio questo risultato, puoi consultare la sua voce nella lista di lemmi a destra.
uk: Для розминки перед `2 + 2 ≠ 5` давайте доведемо `0 ≠ 1`. Для цього нам потрібно представити останню аксіому Пеано `zero_ne_succ n`, доказ того, що `0 ≠ succ n`. Щоб дізнатися про цей результат, натисніть на нього в списку лем праворуч.
zh: 作为 `2 + 2 ≠ 5` 的热身，我们来证明 `0 ≠ 1`。为此，我们需要 介绍一下Peano的最后一个公理`zero_ne_succ n`，证明`0 ≠ succ n`。 要了解此结论，请在右侧的引理列表中单击它。

source: `zero_ne_one` is a proof of `0 ≠ 1`.
fr: `zero_ne_one` est une preuve de `0 ≠ 1`.
it: `zero_ne_one` è la dimostrazione di `0 ≠ 1`.
uk: `zero_ne_one` є доказом `0 ≠ 1`.
zh: `zero_ne_one` 是 `0 ≠ 1` 的证明。

source: Start with `intro h`.
fr: Commencez par `intro h`.
it: Inizia con `intro h`.
uk: Почніть із `intro h`.
zh: 从 `intro h` 开始。

source: Now change `1` to `succ 0` in `h`.
fr: Maintenant, changez `1` en `succ 0` dans `h`.
it: Ora riscrivi `1` in `succ 0` in `h`.
uk: Тепер змініть `1` на `succ 0` у `h`.
zh: 现在将 `h` 中的 `1` 改写为 `succ 0`。

source: Now you can `apply zero_ne_succ at h`.
fr: Maintenant, vous pouvez utiliser `apply zero_ne_succ at h`.
it: Ora puoi fare `apply zero_ne_succ at h`.
uk: Тепер ви можете `apply zero_ne_succ at h`.
zh: 现在可以使用 `apply zero_ne_succ at h`。

source: Nice!
fr: Bien !
it: Ottimo!
uk: Гарно!
zh: 好的！

source: We know `zero_ne_succ n` is a proof of `0 = succ n → False` -- but what if we have a hypothesis `succ n = 0`? It's the wrong way around! The `symm` tactic changes a goal `x = y` to `y = x`, and a goal `x ≠ y` to `y ≠ x`. And `symm at h` does the same for a hypothesis `h`. We've proved $0 \neq 1$ and called the proof `zero_ne_one`; now try proving $1 \neq 0$.
fr: Nous savons que `zero_ne_succ n` est une preuve de `0 = succ n → False` -- mais que faire si nous avons une hypothèse `succ n = 0` ? C'est dans le mauvais sens ! La tactique `symm` change un but `x = y` en `y = x`, et un but `x ≠ y` en `y ≠ x`. Et `symm at h` fait la même chose pour une hypothèse `h`. Nous avons prouvé $0 \neq 1$ et nous avions appelé la preuve `zero_ne_one` ; maintenant essayez de prouver $1 \neq 0$.
it: Abbiamo visto che `zero_ne_succ n` è la dimostrazione di `0 = succ n → False` -- ma come possiamo applicarla all'ipotesi `succ n = 0`? È la stessa uguaglianza, solo con i due lati scambiati! La tattica `symm` ci viene in soccorso: riscrive un goal `x = y` in `y = x`, e un goal `x ≠ y` in `y ≠ x`. `symm at h` è la versione che opera sull'ipotesi `h`. Abbiamo dimostrato poco fa $0 \neq 1$ e chiamato la sua dimostrazione `zero_ne_one`; ora prova a dimostrare $1 \neq 0$.
uk: Ми знаємо, що `zero_ne_succ n` є доказом `0 = succ n → False` -- але що якщо ми маємо гіпотезу `succ n = 0`? Це неправильний шлях! Тактика `symm` змінює ціль `x = y` на `y = x`, а ціль `x ≠ y` на `y ≠ x`. І `symm у h` робить те саме для гіпотези `h`. Ми довели $0 \neq 1$ і назвали доказ `zero_ne_one`; тепер спробуйте довести $1 \neq 0$.
zh: 我们知道 `zero_ne_succ n` 是证明 `0 = succ n → False` 的证明。但是如果我们有一个假设 `succ n = 0` 呢？这恰好是反过来的！ `symm` 策略可以将目标 `x = y` 改为 `y = x`，并将目标 `x ≠ y` 改为 `y ≠ x`。而 `symm at h` 对假设 `h` 也做同样的操作。 我们已经证明了 $0 \neq 1$，并将证明命名为 `zero_ne_one`；现在请尝试证明 $1 \neq 0$。

source: ## Summary The `symm` tactic will change a goal or hypothesis of the form `X = Y` to `Y = X`. It will also work on `X ≠ Y` and on `X ↔ Y`. ### Example If the goal is `2 + 2 = 4` then `symm` will change it to `4 = 2 + 2`. ### Example If `h : 2 + 2 ≠ 5` then `symm at h` will change `h` to `5 ≠ 2 + 2`.
fr: ## Résumé La tactique `symm` changera un but ou une hypothèse de la forme `X = Y` en `Y = X`. Elle fonctionnera aussi sur `X ≠ Y` et sur `X ↔ Y`. ### Exemple Si le but est `2 + 2 = 4` alors `symm` le changera en `4 = 2 + 2`. ### Exemple Si `h : 2 + 2 ≠ 5` alors `symm at h` changera `h` en `5 ≠ 2 + 2`.
it: ## Descrizione La tattica `symm` trasformerà un goal o un'ipotesi della forma di un'uguaglianza `X = Y` in `Y = X`. Funziona anche sulla disuguaglianza `X ≠ Y` e sull'equivalenza `X ↔ Y`. ### Esempio Se il goal è `2 + 2 = 4`, `symm` lo trasformerà in `4 = 2 + 2`. ### Esempio Se hai `h : 2 + 2 ≠ 5` allora `symm at h` trasformerà `h` in `5 ≠ 2 + 2`.
uk: ## Резюме Тактика `symm` змінить мету або гіпотезу форми `X = Y` на `Y = X`. Вона також працюватиме на `X ≠ Y` і на `X ↔ Y`. ### Приклад Якщо мета `2 + 2 = 4`, тоді `symm` змінить її на `4 = 2 + 2`. ### Приклад Якщо `h : 2 + 2 ≠ 5`, то `symm at h` змінить `h` на `5 ≠ 2 + 2`.
zh: ## 小结 `symm` 策略会将形如 `X = Y` 的目标或假设转换为 `Y = X`。它也适用于 `X ≠ Y` 和 `X ↔ Y`。 ### 例子 如果目标是 `2 + 2 = 4`，那么 `symm` 会将其转换为 `4 = 2 + 2`。 ### 例子 如果 `h : 2 + 2 ≠ 5`，那么 `symm at h` 会将 `h` 转换为 `5 ≠ 2 + 2`。

source: `one_ne_zero` is a proof that `1 ≠ 0`.
fr: `one_ne_zero` est une preuve que `1 ≠ 0`.
it: `one_ne_zero` è la dimostrazione di `1 ≠ 0`.
uk: `one_ne_zero` є доказом того, що `1 ≠ 0`.
zh: `one_ne_zero` 是 `1 ≠ 0` 的证明。

source: What do you think of this two-liner: ``` symm exact zero_ne_one ``` `exact` doesn't just take hypotheses, it will eat any proof which exists in the system.
fr: Que pensez-vous de cette solution en deux lignes : ``` symm exact zero_ne_one ``` `exact` ne prend pas seulement des hypothèses, il acceptera toute preuve existante dans le système.
it: Guarda il mio two-liner: ``` symm exact zero_ne_one ``` `exact` non prende soltanto ipotesi, puoi passargli qualsiasi dimostrazione definita nel gioco.
uk: Що ви думаєте про цей дворядковий доказ: ``` symm exact zero_ne_one ``` `exact` не просто приймає гіпотези, він з'їдає будь-які наявні докази в системі.
zh: 你对这两行代码有什么看法？ ``` symm exact zero_ne_one ``` 请注意，`exact` 不仅限于使用假设，它可以接受系统中存在的任何证明。

source: 2 + 2 ≠ 5 is boring to prove in full, given only the tools we have currently. To make it a bit less painful, I have unfolded all of the numerals for you. See if you can use `zero_ne_succ` and `succ_inj` to prove this.
fr: 2 + 2 ≠ 5 est ennuyeux à prouver entièrement, avec les seuls outils dont nous disposons actuellement. Pour le rendre un peu moins pénible, j'ai développé tous les entiers pour vous. Voyez si vous pouvez utiliser `zero_ne_succ` et `succ_inj` pour le prouver.
it: 2 + 2 ≠ 5 è noioso da dimostrare per intero con le tattiche che abbiamo a disposizione al momento. Per salvarti un po' di lavoro, ho espanso in anticipo tutti i numeri per te. Completa la dimostrazione utilizzando `zero_ne_succ` e `succ_inj`.
uk: 2 + 2 ≠ 5 нудно доводити повністю, використовуючи лише ті інструменти, які ми маємо на даний момент. Щоб було трохи менше болісно, я розгорнув для вас усі цифри. Подивіться, чи можете ви довести це використовуючи `zero_ne_succ` і `succ_inj`.
zh: 仅凭我们目前拥有的工具，完整证明 2 + 2 ≠ 5 是很无聊的。 为了减轻您的痛苦，我为您展开了所有数字。 看看是否可以使用 `zero_ne_succ` 和 `succ_inj` 来证明它。
