Repository: leanprover-community/NNG4
Catalog: .i18n/*/Game.po
Languages: fr, it, uk, zh

source: You can use `rw [zero_add] at «{h}»` to rewrite at `«{h}»` instead of at the goal.
fr: Vous pouvez utiliser `rw [zero_add] at «{h}»` pour réécrire dans `«{h}»` au lieu du but.
it: Puoi eseguire `rw [zero_add] at «{h}»` per sostituire all'interno dell'ipotesi `«{h}»` invece che nel goal.
uk: Ви можете використовувати `rw [zero_add] at «{h}»`, щоб переписати в `«{h}»` замість перезапису в меті.
zh: 你可以使用 `rw [zero_add] at «{h}»` 来在 `«{h}»` 处进行重写，而不是在目标处进行。

source: Do that again! `rw [zero_add] at «{h}»` tries to fill in the arguments to `zero_add` (finding `«{x}»`) then it replaces all occurences of `0 + «{x}»` it finds. Therefor, it did not rewrite `0 + «{y}»`, yet.
fr: Faites-le encore ! `rw [zero_add] at «{h}»` essaie de remplir les arguments de `zero_add` (trouvant `«{x}»`) puis remplace toutes les occurrences de `0 + «{x}»` qu'il trouve. Par conséquent, il n'a pas réécrit `0 + «{y}»` pour l'instant.
it: Ripeti lo stesso comando! `rw [zero_add] at «{h}»` ha completato automaticamente la chiamata a `zero_add` (trovando l'argomento `«{x}»`) e poi ha sostituito tutte le occorrenze di `0 + «{x}»` in un solo colpo. Dunque non ha toccato `0 + «{y}»` ancora, perciò dovresti ripetere il comando.
uk: Зробіть це ще раз! `rw [zero_add] в «{h}»` намагається заповнити аргументи `zero_add` (знаходження `«{x}»`), потім вона замінює всі знайдені входження `0 + «{x}»`. Таким чином тактика не переписує `0 + «{y}»`.
zh: 再做一次！ `rw [zero_add] at «{h}»` 试图填充 `zero_add` 的参数（找到 `«{x}»`），然后替换它找到的所有 `0 + «{x}»` 出现的地方。因此，`0 + «{y}»`还没有被重写 。

source: Now you could finish with `rw [«{h}»]` then `rfl`, but `exact «{h}»` does it in one line.
fr: Maintenant, vous pourriez terminer avec `rw [«{h}»]` puis `rfl`, mais `exact «{h}»` le fait en une ligne.
it: Adesso potresti chiudere con `rw [«{h}»]` e `rfl`, ma `exact «{h}»` fa lo stesso lavoro in una sola riga.
uk: Тепер ви можете закінчити доказ `rw [«{h}»]`, потім `rfl`, але `exact «{h}»` робить це у один рядок.
zh: 现在你可以用 `rw [«{h}»]` 然后 `rfl` 来完成证明，但 `exact «{h}»` 可以在一行中做到同样的事。

source: Here's a two-line proof: ``` repeat rw [zero_add] at h exact h ```
fr: Voici une preuve en deux lignes : ``` repeat rw [zero_add] at h exact h ```
it: Ecco una dimostrazione di due righe: ``` repeat rw [zero_add] at h exact h ```
uk: Ось дворядковий доказ: ``` repeat rw [zero_add] at h exact h ```
zh: 这是一个两行证明： ``` repeat rw [zero_add] at h exact h ```

source: The `apply` tactic.
fr: La tactique `apply`.
it: La tattica `apply`.
uk: Тактика `apply`.
zh: `apply` 策略。

source: ## Summary If `t : P → Q` is a proof that $P \implies Q$, and `h : P` is a proof of `P`, then `apply t at h` will change `h` to a proof of `Q`. The idea is that if you know `P` is true, then you can deduce from `t` that `Q` is true. If the *goal* is `Q`, then `apply t` will \"argue backwards\" and change the goal to `P`. The idea here is that if you want to prove `Q`, then by `t` it suffices to prove `P`, so you can reduce the goal to proving `P`. ### Example: `succ_inj x y` is a proof that `succ x = succ y → x = y`. So if you have a hypothesis `h : succ (a + 37) = succ (b + 42)` then `apply succ_inj at h` will change `h` to `a + 37 = b + 42`. You could write `apply succ_inj (a + 37) (b + 42) at h` but Lean is smart enough to figure out the inputs to `succ_inj`. ### Example If the goal is `a * b = 7`, then `apply succ_inj` will turn the goal into `succ (a * b) = succ 7`.
fr: ## Résumé Si `t : P → Q` est une preuve que $P \implies Q$, et `h : P` est une preuve de `P`, alors `apply t at h` changera `h` en une preuve de `Q`. L'idée est que si vous savez que `P` est vrai, alors vous pouvez déduire de `t` que `Q` est vrai. Si le *but* est `Q`, alors `apply t` "argumentera à l'envers" et changera le but en `P`. L'idée ici est que si vous voulez prouver `Q`, alors par `t` il suffit de prouver `P`, donc vous pouvez réduire le but à prouver `P`. ### Exemple : `succ_inj x y` est une preuve que `succ x = succ y → x = y`. Ainsi, si vous avez une hypothèse `h : succ (a + 37) = succ (b + 42)` alors `apply succ_inj at h` changera `h` en `a + 37 = b + 42`. Vous pourriez écrire `apply succ_inj (a + 37) (b + 42) at h` mais Lean est assez intelligent pour trouver les entrées de `succ_inj`. ### Exemple Si le but est `a * b = 7`, alors `apply succ_inj` transformera le but en `succ (a * b) = succ 7`.
it: ## Descrizione Se `t : P → Q` è una dimostrazione di $P \implies Q$, e `h : P` è una dimostrazione di `P`, allora `apply t at h` trasformerà `h` in una dimostrazione di `Q`. L'idea alla base di questo è che se sai che `P` è vera, allora l'implicazione `t` ti permette di dedurre che `Q` è vera. Al contrario, se il *goal* è `Q`, allora `apply t` \"ragionerà all'indietro\" e trasformerà il goal in `P`. È sempre l'implicazione che ci permette di farlo: `Q` è garantito da `t` se riesci a dimostrare `P`, quindi il goal si riduce a una dimostrazione di `P`. ### Esempio: `succ_inj x y` è una dimostrazione di `succ x = succ y → x = y` (un'implicazione). Quindi, se hai l'ipotesi `h : succ (a + 37) = succ (b + 42)` allora con `apply succ_inj at h` trasformerai `h` in `a + 37 = b + 42`. Puoi anche fornire gli argomenti direttamente `apply succ_inj (a + 37) (b + 42) at h` ma Lean fa questo lavoro per noi e capisce da solo cosa deve passare a `succ_inj`. ### Esempio Se hai il goal `a * b = 7`, con `apply succ_inj` trasformerai il goal in `succ (a * b) = succ 7`.
uk: ## Резюме Якщо `t : P → Q` є доказом того, що $P \implies Q$, а `h : P` є доказом `P`, тоді `apply t at h` змінить `h` на доказ `Q`. Ідея полягає в тому, що якщо якщо ви знаєте, що `P` істинне, тоді ви можете зробити висновок із `t`, що `Q` істинне. Якщо *мета* це `Q`, тоді `apply t` \"аргументуватиме у звороньому порядку\" і змінить мету на `P`. Ідея полягає в тому, що якщо ви хочете довести `Q`, то за допомогою `t` достатньо довести `P`, тому ви можете звести ціль до доведення `P`. ### Приклад: `succ_inj x y` є доказом того, що `succ x = succ y → x = y`. Отже, якщо у вас є гіпотеза `h : succ (a + 37) = succ (b + 42)` тоді `apply succ_inj at h` змінить `h` на `a + 37 = b + 42`. Ви можете написати `apply succ_inj (a + 37) (b + 42) at h` але Lean достатньо розумний, щоб визначити вхідні дані для `succ_inj`. ### Приклад Якщо ціль `a * b = 7`, тоді `apply succ_inj` змінить мету на `succ (a * b) = succ 7`.
zh: ## 概述 如果 `t : P → Q` 是一个 $P\implies Q$ 的证明，而 `h : P` 是一个 `P` 的证明，那么 `apply t at h` 会将 `h` 转换为证明 `Q`。其原理是，如果您知道 `P` 为真，那么您可以从 `t` 推断出 `Q` 为真。 如果*目标*是 `Q`，那么 `apply t` 会“逆向推理”并将目标转换为 `P`。在这里，如果您想证明 `Q`，那么根据 `t`，只需证明 `P` 即可，因此您可以将目标简化为证明 `P`。 ### 示例： `succ_inj x y` 是一个 `succ x = succ y → x = y` 的证明。 因此，如果您有一个假设 `h : succ (a + 37) = succ (b + 42)`，那么 `apply succ_inj at h` 会将 `h` 转换为 `a + 37 = b + 42`。您可以写 `apply succ_inj (a + 37) (b + 42) at h`，但 Lean 足够聪明，可以自行推断出 `succ_inj` 的输入。 ### 示例： 如果目标是 `a * b = 7`，那么 `apply succ_inj` 会将目标转换为 `succ (a * b) = succ 7`。

source: In this level, the hypotheses `h2` is an *implication*. It says that *if* `x = 37` *then* `y = 42`. We can use this hypothesis with the `apply` tactic. Remember you can click on `apply` or any other tactic on the right to see a detailed explanation of what it does, with examples.
fr: Dans ce niveau, l'hypothèse `h2` est une *implication*. Elle dit que *si* `x = 37` *alors* `y = 42`. Nous pouvons utiliser cette hypothèse avec la tactique `apply`. Rappelez-vous que vous pouvez cliquer sur `apply` ou toute autre tactique à droite pour voir une explication détaillée de ce qu'elle fait, avec des exemples.
uk: В цьому рівні гіпотеза `h2` є *імплікацією*. Вона каже що *якщо* `x = 37` *тоді* `y = 42`. Ми можемо скористатися цією гіпотезою за допомогою тактики `apply`. Пам’ятайте, що ви можете натиснути `apply` або будь-яку іншу тактику праворуч, щоб переглянути детальне пояснення того, що вона робить, ще із прикладами.

source: If $x=37$ and we know that $x=37\implies y=42$ then we can deduce $y=42$.
fr: Si $x=37$ et que nous savons que $x=37\implies y=42$ alors nous pouvons déduire $y=42$.
it: Se $x=37$ e abbiamo che $x=37\implies y=42$ allora possiamo dedurre $y=42$.
uk: Якщо $x=37$ і ми знаємо, що $x=37\implies y=42$, тоді ми можемо вивести $y=42$.
zh: 如果 $x=37$ 并且我们知道 $x=37 \implies y=42$，那么我们可以推导出 $y=42$。

source: Start with `apply h2 at h1`. This will change `h1` to `y = 42`.
fr: Commencez par `apply h2 at h1`. Cela changera `h1` en `y = 42`.
it: Inizia con `apply h2 at h1`. Questo trasformerà `h1` in `y = 42`.
uk: Почніть із `apply h2 at h1`. Це змінить `h1` на `y = 42`.
zh: 从 `apply h2 at h1` 开始。这将会把 `h1` 改为 `y = 42`。

source: Now finish using the `exact` tactic.
fr: Terminez maintenant en utilisant la tactique `exact`.
it: Adesso chiudi la dimostrazione usando `exact`.
uk: Тепер закінчіть доведення використовуючи тактику `exact`.
zh: 现在使用 `exact` 策略完成证明。

source: succ_inj : the successor function is injective
fr: succ_inj : la fonction successeur est injective
it: succ_inj : la funzione successore è iniettiva
uk: succ_inj : функція наступника ін’єктивна
zh: succ_inj ：后继数是单射的

source: If `a` and `b` are numbers, then `succ_inj a b` is a proof that `succ a = succ b` implies `a = b`. Click on this theorem in the *Peano* tab for more information. Peano had this theorem as an axiom, but in Algorithm World we will show how to prove it in Lean. Right now let's just assume it, and let's prove $x+1=4 \implies x=3$ using it. Again, we will proceed by manipulating our hypothesis until it becomes the goal. I will walk you through this level.
fr: Si `a` et `b` sont des nombres, alors `succ_inj a b` est une preuve que `succ a = succ b` implique `a = b`. Cliquez sur ce théorème dans l'onglet *Peano* pour plus d'informations. Peano avait ce théorème comme axiome, mais dans le monde Algorithmique nous montrerons comment le prouver dans Lean. Pour l'instant, supposons-le simplement, et prouvons $x+1=4 \implies x=3$ en l'utilisant. Encore une fois, nous procéderons en manipulant notre hypothèse jusqu'à ce qu'elle devienne le but. Je vais vous guider à travers ce niveau.
it: Se `a` e `b` sono due numeri, allora `succ_inj a b` è una dimostrazione che `succ a = succ b` implica `a = b`. Clicca su questo teorema nel tab *Peano* per maggiori dettagli. Peano formulò questo teorema come assioma, ma nel Mondo Algoritmi vedremo come dimostrarlo su Lean. Per ora lo diamo per scontato, e lo usiamo per dimostrare $x+1=4 \implies x=3$. Procederemo nuovamente manipolando un'ipotesi ipotesi per farla coincidere con il goal. Ti seguirò passo per passo in questo livello.
uk: Якщо `a` і `b` є числами, то `succ_inj a b` є доказом що із `succ a = succ b` виходить `a = b`. Натисніть на цю теорему в *Peano* вкладинці для отримання додаткової інформації. Пеано мав цю теорему як аксіому, але в Світі Алгорітмів ми покажемо, як це довести в Lean. Прямо зараз давайте просто припустимо, і давайте доведемо $x+1=4 \implies x=3$ за допомогою неї. Знову, продовжимо маніпулюючи нашою гіпотезою, поки вона не стане метою. я проведу вас через цей рівень.
zh: 如果 `a` 和 `b` 是数字，那么 `succ_inj a b` 是一个证明，表明 `succ a = succ b` 意味着 `a = b`。点击 *Peano* 标签中的这个定理以获取更多信息。 皮亚诺将这个定理作为一个公理，但在算法世界中我们将展示如何在 Lean 中证明它。 现在让我们先假设它，然后让我们使用它证明 $x+1=4 \implies x=3$。再一次，我们将通过操纵我们的假设直到它变成目标来进行。我将引导你通过这个关卡。

source: # Statement If $a$ and $b$ are numbers, then `succ_inj a b` is the proof that $ (\operatorname{succ}(a) = \operatorname{succ}(b)) \implies a=b$. ## More technical details There are other ways to think about `succ_inj`. You can think about `succ_inj` itself as a function which takes two numbers $$a$$ and $$b$$ as input, and outputs a proof of $ ( \operatorname{succ}(a) = \operatorname{succ}(b)) \implies a=b$. You can think of `succ_inj` itself as a proof; it is the proof that `succ` is an injective function. In other words, `succ_inj` is a proof of $\forall a, b \in \mathbb{N}, ( \operatorname{succ}(a) = \operatorname{succ}(b)) \implies a=b$. `succ_inj` was postulated as an axiom by Peano, but in Lean it can be proved using `pred`, a mathematically pathological function.
fr: # Énoncé Si $a$ et $b$ sont des nombres, alors `succ_inj a b` est la preuve que $ (\operatorname{succ}(a) = \operatorname{succ}(b)) \implies a=b$. ## Plus de détails techniques Il y a d'autres façons de penser à `succ_inj`. Vous pouvez considérer `succ_inj` comme une fonction qui prend deux nombres $$a$$ et $$b$$ en entrée, et produit une preuve de $ ( \operatorname{succ}(a) = \operatorname{succ}(b)) \implies a=b$. Vous pouvez aussi considérer `succ_inj` comme une preuve ; c'est la preuve que `succ` est une fonction injective. Autrement dit, `succ_inj` est une preuve de $\forall a, b \in \mathbb{N}, ( \operatorname{succ}(a) = \operatorname{succ}(b)) \implies a=b$. `succ_inj` a été postulé comme axiome par Peano, mais dans Lean, il peut être prouvé en utilisant `pred`, une fonction mathématiquement pathologique.
it: # Enunciato Se $a$ e $b$ sono numeri, allora `succ_inj a b` è la dimostrazione che $ (\operatorname{succ}(a) = \operatorname{succ}(b)) \implies a=b$. ## Dettagli tecnici Ci sono diversi modi di interpretare `succ_inj`. Si può pensare a `succ_inj` come una funzione che prende in input due numeri $$a$$ e $$b$$, e restituisce una dimostrazione di $ ( \operatorname{succ}(a) = \operatorname{succ}(b)) \implies a=b$. Ma `succ_inj` in sé e anche una dimostrazione; ovvero la dimostrazione che `succ` è una funzione iniettiva. In termini matematici, `succ_inj` è una dimostrazione di $\forall a, b \in \mathbb{N}, ( \operatorname{succ}(a) = \operatorname{succ}(b)) \implies a=b$. `succ_inj` fu postulato da Peano come un'assioma, ma in Lean può essere dimostrato usando `pred`, una funzione che non va molto d'accordo con i numeri naturali.
uk: # Твердження Якщо $a$ і $b$ це числа, то `succ_inj a b` є доказом що $ (\operatorname{succ}(a) = \operatorname{succ}(b)) \implies a=b$. ## Більше технічних деталей Є інші способи думати про `succ_inj`. Ви можете розглядати `succ_inj` як функцію, яка приймає два числа $$a$$ і $$b$$ як вхідні дані та виводить підтвердження $ ( \operatorname{succ}(a) = \operatorname{succ}(b)) \implies a=b$. Ви можете розглядати саму `succ_inj` як доказ; це доказ що `succ` є ін'єктивною функцією. Іншими словами, `succ_inj` є доказом $\forall a, b \in \mathbb{N}, ( \operatorname{succ}(a) = \operatorname{succ}(b)) \implies a=b$. `succ_inj` було постульовано як аксіому Пеано, але в Lean це можна довести за допомогою `pred`, математично патологічнії функції.
zh: # 陈述 如果 \( a \) 和 \( b \) 是数字，那么 `succ_inj a b` 是 $ (\operatorname{succ}(a) = \operatorname{succ}(b))\implies a=b $ 的证明。 ## 更多技术细节 你可以用其他方式思考 `succ_inj`。 你可以把 `succ_inj` 本身想象成一个函数，它接受两个数字 $$a$$ 和 $$b$$ 作为输入，并输出 $ (\operatorname{succ}(a) = \operatorname{succ}(b))\implies a=b $ 的证明。 你可以把 `succ_inj` 本身看作是一个证明；它是 `succ` 是一个单射函数的证明。换句话说， `succ_inj` 是 $ \forall a, b \in \mathbb{N}, (\operatorname{succ}(a) = \operatorname{succ}(b))\implies a=b $ 的证明。 `succ_inj` 被皮亚诺假设为一个公理，但在 Lean 中可以使用 `pred` 来证明，这是一个在数学上有病态的函数。

source: If $x+1=4$ then $x=3$.
fr: Si $x+1=4$ alors $x=3$.
it: Se $x+1=4$ allora $x=3$.
uk: Якщо $x+1=4$, то $x=3$.
zh: 如果 $x+1=4$ 则 $x=3$。

source: Let's first get `h` into the form `succ x = succ 3` so we can apply `succ_inj`. First execute `rw [four_eq_succ_three] at h` to change the 4 on the right hand side.
fr: Commençons par mettre `h` sous la forme `succ x = succ 3` pour que nous puissions appliquer `succ_inj`. Exécutez d'abord `rw [four_eq_succ_three] at h` pour changer le 4 du côté droit.
it: Prima di tutto portiamo `h` alla forma `succ x = succ 3` in modo da poter applicare `succ_inj`. Esegui `rw [four_eq_succ_three] at h` per sostituire il 4 nel membro destro.
uk: Давайте спочатку переведемо `h` у форму `succ x = succ 3`, щоб ми могли застосувати `succ_inj`. Спочатку виконайте `rw [four_eq_succ_three] at h` щоб змінити 4 з правого боку.
zh: 首先让 `h` 变为 `succ x = succ 3` 的形式，这样我们就可以应用 `succ_inj`。首先执行 `rw [four_eq_succ_three] at h` 来改变右手边的4。

source: Now rewrite `succ_eq_add_one` backwards at `h` to get the right hand side.
fr: Maintenant, réécrivez `succ_eq_add_one` à l'envers dans `h` pour obtenir le côté droit.
it: Adesso riscrivi `succ_eq_add_one` all'indietro all'interno di `h` per avere il suo membro destro.
uk: Тепер перепишіть `succ_eq_add_one` у зворотньому напрямку в `h` щоб отримати праву сторону.
zh: 现在在 `h` 处反向重写 `succ_eq_add_one` 来得到右边式子。

source: You can put a `←` in front of any theorem provided to `rw` to rewrite the other way around. Look at the docs for `rw` for an explanation. Type `←` with `\l`.
fr: Vous pouvez mettre un `←` devant n'importe quel théorème fourni à `rw` pour réécrire dans l'autre sens. Consultez la documentation de `rw` pour une explication. Tapez `←` avec `\l`.
it: Ricorda che mettendo `←` davanti a un teorema che passi a `rw` puoi sostituire nel senso opposto. Guarda la documentazione di `rw` per capire meglio il suo funzionamento. `←` si ottiene digitando `\l`.
uk: Ви можете поставити `←` перед будь-якою теоремою, переданою до `rw`, щоб переписати її у зворотньому напрямку. Перегляньте документацію для `rw` для пояснення. Введіть `←` за допомогою `\l`.
zh: 你可以在提供给 `rw` 的任何定理前面放一个 `←` 来进行反向重写。查看 `rw` 的文档以获得解释。使用 `\l` 输入 `←`。

source: Concretely: `rw [← succ_eq_add_one] at h`.
fr: Concrètement : `rw [← succ_eq_add_one] at h`.
it: Sintassi concreta: `rw [← succ_eq_add_one] at h`.
uk: Конкретно: `rw [← succ_eq_add_one] at h`.
zh: 具体来说，就是：`rw [← succ_eq_add_one] at h`。

source: Now let's `apply` our new theorem. Execute `apply succ_inj at h` to change `h` to a proof of `x = 3`.
fr: Maintenant, appliquons notre nouveau théorème. Exécutez `apply succ_inj at h` pour changer `h` en une preuve de `x = 3`.
it: Ora facciamo l'`apply` del nuovo teorema. Esegui `apply succ_inj at h` per trasformare `h` in una dimostrazione di `x = 3`.
uk: Тепер давайте `apply` нашу нову теорему. Виконайте `apply succ_inj at h` щоб змінити `h` на доказ `x = 3`.
zh: 现在让我们应用（ `apply` ）我们的新定理。执行 `apply succ_inj at h` 来将 `h` 变为证明 `x = 3` 的证据。

source: Now finish in one line.
fr: Terminez maintenant en une ligne.
it: Ora concludi in una linea.
uk: Тепер закінчіть в один рядок.
zh: 现在再用一行完成证明。

source: And now we've deduced what we wanted to prove: the goal is one of our assumptions. Finish the level with `exact h`.
fr: Et maintenant nous avons déduit ce que nous voulions prouver : le but est une de nos hypothèses. Terminez le niveau avec `exact h`.
it: Abbiamo dedotto esattamente ciò che volevamo dimostrare: il goal coincide con una delle ipotesi. Completa il livello con `exact h`.
uk: І тепер ми дійшли висновку, який ми хотіли довести: мета є одним із наших припущень. Завершіть рівень через `exact h`.
zh: 现在我们已经推导出了我们想要证明的了：目标是我们的假设之一。 用 `exact h` 完成本关。

source: In the next level, we'll do the same proof but backwards.
fr: Dans le niveau suivant, nous ferons la même preuve mais à l'envers.
it: Nel livello successivo, dimostreremo lo stesso enunciato, al contrario.
uk: На наступному рівні ми виконаємо той самий доказ, але в зворотному напрямку.
zh: 在下一级别中，我们将进行相同的证明，但要从后往前证。

source: Arguing backwards
fr: Argumenter à l'envers
it: Ragionare all'indietro
uk: Аргументування у зворотньому напрямку
zh: 从后向前证明

source: In the last level, we manipulated the hypothesis `x + 1 = 4` until it became the goal `x = 3`. In this level we'll manipulate the goal until it becomes our hypothesis! In other words, we will "argue backwards". The `apply` tactic can do this too. Again I will walk you through this one (assuming you're in command line mode).
fr: Dans le dernier niveau, nous avons manipulé l'hypothèse `x + 1 = 4` jusqu'à ce qu'elle devienne le but `x = 3`. Dans ce niveau, nous manipulerons le but jusqu'à ce qu'il devienne notre hypothèse ! Autrement dit, nous "argumenterons à l'envers". La tactique `apply` peut aussi faire cela. Je vais encore vous guider à travers celui-ci (en supposant que vous êtes en mode ligne de commande).
it: Nell'ultimo livello abbiamo manipolato l'ipotesi `x + 1 = 4` per farla coincidere con il goal `x = 3`. In questo livello manipoleremo il goal per farlo combaciare con una delle ipotesi! Si puo dire che "ragioneremo all'indietro". È ancora la tattica `apply` che ce lo consente. Ti guiderò io anche in questa dimostrazione (assicurati di essere in modalità interattiva).
uk: На останньому рівні ми маніпулювали гіпотезою `x + 1 = 4` поки вона не стало метою `x = 3`. На цьому рівні ми будемо маніпулювати мету, поки вона не стане нашою гіпотезою! Іншими словами, ми буде «аргументувати у зворотньому напрямку». Тактика `apply` також може це зробити. Я знову проведу вас через цей шлях (якщо ви в режимі командного рядка).
zh: 在最后一关，我们操纵了假设 `x + 1 = 4` 直到成为目标 `x = 3` 。在这一关我们将改写 目标，直到它成为我们的假设！换句话说，我们 会“从后向前”证明。 `apply` 策略也可以做到这一点。 我将再次引导您完成这一过程（假设您在 命令行模式）。

source: Start with `apply succ_inj` to apply `succ_inj` to the *goal*.
fr: Commencez par `apply succ_inj` pour appliquer `succ_inj` au *but*.
it: Parti con `apply succ_inj` per applicare `succ_inj` *sul goal*.
uk: Почніть із `apply succ_inj`, щоб застосувати `succ_inj` до *мети*.
zh: 从 `apply succ_inj` 开始，将 `succ_inj` 应用于 *goal* （目标）。

source: Applying a proof of $P\implies Q$ to the *goal* changes $Q$ to $P$. Now try `rw [succ_eq_add_one]` to make the goal more like the hypothesis.
fr: Appliquer une preuve de $P\implies Q$ au *but* change $Q$ en $P$. Essayez maintenant `rw [succ_eq_add_one]` pour rendre le but plus semblable à l'hypothèse.
it: Applicando $P\implies Q$ al *goal* ci siamo mossi da $Q$ a $P$. Ora esegui `rw [succ_eq_add_one]` per iniziare a portare il goal a una delle ipotesi.
uk: Застосування доказу $P\implies Q$ до *мети* змінює $Q$ на $P$. Тепер спробуйте `rw [succ_eq_add_one]`, щоб зробити мету більш схожою на гіпотезу.
zh: 应用一个 $P\implies Q$ 的证明到*目标*上，会将 $Q$ 变为 $P$。 现在尝试使用 `rw [succ_eq_add_one]` 来使目标更像假设。

source: Now rewrite `four_eq_succ_three` backwards to make the goal equal to the hypothesis.
fr: Maintenant, réécrivez `four_eq_succ_three` à l'envers pour rendre le but égal à l'hypothèse.
it: Ora sostituisci `four_eq_succ_three` all'indietro per eguagliare il goal all'ipotesi.
uk: Тепер перепишіть `four_eq_succ_three` задом наперед, щоб мати мету дорівнюючою гіпотезі.
zh: 现在反方向重写 `four_eq_succ_three` 使目标等于假设。

source: You can now finish with `exact h`.
fr: Vous pouvez maintenant terminer avec `exact h`.
it: Concludi la dimostrazione con `exact h`.
uk: Тепер ви можете закінчити із `exact h`.
zh: 现在您可以使用 `exact h` 来完成证明。

source: Many people find `apply t at h` easy, but some find `apply t` confusing. If you find it confusing, then just argue forwards. You can read more about the `apply` tactic in its documentation, which you can view by clicking on the tactic in the list on the right.
fr: Beaucoup de gens trouvent `apply t at h` facile, mais certains trouvent `apply t` confus. Si vous le trouvez confus, argumentez simplement en avant. Vous pouvez en savoir plus sur la tactique `apply` dans sa documentation, que vous pouvez voir en cliquant sur la tactique dans la liste à droite.
it: Molte persone trovano più facile ragionare in avanti con `apply t at h`, mentre ad alcuni ragionare all'indietro con `apply t` confonde le idee. Se confonde le idee anche a te, puoi sempre ragionare in avanti, i due metodi sono equivalenti. Trovi più informazioni sulla tattica `apply` nella sua documentazione, a cui puoi accedere cliccando sul suo nome nell'elenco di tattiche a destra.
uk: Багато людей вважають `apply t at h` зрозумілим, хтось вважає `apply t` незрозумілим. Якщо вас вони плутають, тоді просто рухайтесь вперед. Ви можете прочитати більше про тактику `apply` в її документації, яку ви можете переглянути натиснувши на тактику в списку праворуч.
zh: 许多人觉得 `apply t at h` 很容易，但有些人觉得 `apply t` 令人困惑。 如果你觉得很困惑，那就用前一种吧。 您可以在其文档中阅读有关 `apply` 策略的更多信息，您可以通过 单击右侧列表中的策略的方式查看。
