Repository: leanprover-community/NNG4
Catalog: .i18n/*/Game.po
Languages: fr, it, uk, zh

source: `pow_add a m n` is a proof that $a^{m+n}=a^ma^n.$
fr: `pow_add a m n` est une preuve que $a^{m+n}=a^ma^n.$
it: `pow_add a m n` è la dimostrazione che $a^{m+n}=a^ma^n.$
uk: `pow_add a m n` є доказом того, що $a^{m+n}=a^ma^n.$
zh: `pow_add a m n` 是 $a^{m+n}=a^ma^n$ 的证明。

source: For all naturals $a$, $m$, $n$, we have $a^{m + n} = a ^ m a ^ n$.
fr: Pour tous les naturels $a$, $m$, $n$, nous avons $a^{m + n} = a ^ m a ^ n$.
it: Per tutti i numeri naturali $a$, $m$, $n$, si ha che $a^{m + n} = a ^ m a ^ n$.
uk: Для всіх натуральних чисел $a$, $m$, $n$ маємо $a^{m + n} = a ^ m a ^ n$.
zh: 对于所有自然数 $a$、$m$、$n$，我们有 $a^{m + n} = a ^ m a ^ n$ 。

source: The music gets ever more dramatic, as we explore the interplay between exponentiation and multiplication. If you're having trouble exchanging the right `a * b` because `rw [mul_comm]` swaps the wrong multiplication, then read the documentation of `rw` for tips on how to fix this.
fr: La musique devient de plus en plus dramatique alors que nous explorons l'interaction entre exponentiation et multiplication. Si vous avez du mal à échanger le bon `a * b` parce que `rw [mul_comm]` échange la mauvaise multiplication, lisez la documentation de `rw` pour des conseils sur la façon de résoudre ce problème.
uk: Музика стає все більш драматичною, оскільки ми досліджуємо взаємодію між піднесенням до ступеня та множенням. Якщо у вас виникли проблеми з заміною правильного `a * b` тому що `rw [mul_comm]` замінює неправильне множення, тоді прочитайте документацію `rw`, щоб дізнатися, як це виправити.

source: `mul_pow a b n` is a proof that $(ab)^n=a^nb^n.$
fr: `mul_pow a b n` est une preuve que $(ab)^n=a^nb^n.$
it: `mul_pow a b n` è la dimostrazione che $(ab)^n=a^nb^n.$
uk: `mul_pow a b n` є доказом того, що $(ab)^n=a^nb^n.$
zh: `mul_pow a b n` 是 $(ab)^n=a^nb^n.$ 的证明

source: For all naturals $a$, $b$, $n$, we have $(ab) ^ n = a ^ nb ^ n$.
fr: Pour tous les naturels $a$, $b$, $n$, nous avons $(ab) ^ n = a ^ nb ^ n$.
it: Per tutti i numeri naturali $a$, $b$, $n$, si ha che $(ab) ^ n = a ^ nb ^ n$.
uk: Для всіх натуральних чисел $a$, $b$, $n$ маємо $(ab) ^ n = a ^ nb ^ n$.
zh: 对于所有的自然数 $a$、$b$、$n$，我们有 $(ab) ^ n = a ^ nb ^ n$。

source: One of the best named levels in the game, a savage `pow_pow` sub-boss appears as the music reaches a frenzy. What else could there be to prove about powers after this?
fr: L'un des niveaux les mieux nommés du jeu, un sous-boss féroce `pow_pow` apparaît alors que la musique atteint son paroxysme. Que pourrait-il y avoir d'autre à prouver sur les puissances après cela ?
uk: Один із найкращих іменованих рівнів у грі, дикий `pow_pow` підбос з'являється у той час коли музика досягає піку. Що ще можна було б довести про ступені після цього?
zh: 游戏中最名副其实的关卡之一。 随着音乐达到狂热，一个凶猛的 `pow_pow` 小boss出现了。 在这之后，还有什么关于幂的性质需要证明呢？

source: `pow_pow a m n` is a proof that $(a^m)^n=a^{mn}.$
fr: `pow_pow a m n` est une preuve que $(a^m)^n=a^{mn}.$
it: `pow_pow a m n` è la dimostrazione di $(a^m)^n=a^{mn}.$
uk: `pow_pow a m n` є доказом того, що $(a^m)^n=a^{mn}.$
zh: `pow_pow a m n` 是 $(a^m)^n=a^{mn}$ 的证明。

source: For all naturals $a$, $m$, $n$, we have $(a ^ m) ^ n = a ^ {mn}$.
fr: Pour tous les naturels $a$, $m$, $n$, nous avons $(a ^ m) ^ n = a ^ {mn}$.
it: Per tutti i numeri naturali $a$, $m$, $n$, si ha che $(a ^ m) ^ n = a ^ {mn}$.
uk: Для всіх натуральних чисел $a$, $m$, $n$ маємо $(a ^ m) ^ n = a ^ {mn}$.
zh: 对于所有天然 $a$、$m$、$n$，我们有 $(a ^ m) ^ n = a ^ {mn}$。

source: The music dies down. Is that it? Course it isn't, you can clearly see that there are two levels left. A passing mathematician says that mathematicians don't have a name for the structure you just constructed. You feel cheated. Suddenly the music starts up again. This really is the final boss.
fr: La musique s'apaise. Est-ce tout ? Bien sûr que non, vous pouvez clairement voir qu'il reste deux niveaux. Un mathématicien de passage dit que les mathématiciens n'ont pas de nom pour la structure que vous venez de construire. Vous vous sentez trompé. Soudain, la musique repart. C'est vraiment le boss final.
uk: Музика стихає. Це все? Звичайно ні, ви можете чітко бачити, що залишилося ще два рівні. Математик, який проходив повз, каже, що у математиків немає імені для структури, яку ви щойно побудували. Ви відчуваєте себе обдуреним. Раптом знову починає звучати музика. Це дійсно фінальний бос.

source: [final boss music]
fr: [musique de boss final]
uk: [музика фінального боса]
zh: 【最终Boss背景音乐】

source: `add_sq a b` is the statement that $(a+b)^2=a^2+b^2+2ab.$
fr: `add_sq a b` est l'énoncé que $(a+b)^2=a^2+b^2+2ab.$
it: `add_sq a b` è l'enunciato $(a+b)^2=a^2+b^2+2ab.$
uk: `add_sq a b` це твердження, що $(a+b)^2=a^2+b^2+2ab.$
zh: `add_sq a b` 是 $(a+b)^2=a^2+b^2+2ab$ 的证明。

source: For all numbers $a$ and $b$, we have $$(a+b)^2=a^2+b^2+2ab.$$
fr: Pour tous les nombres $a$ et $b$, nous avons $$(a+b)^2=a^2+b^2+2ab.$$
it: Per tutti i numeri naturali $a$ e $b$, si ha che $$(a+b)^2=a^2+b^2+2ab.$$
uk: Для всіх чисел $a$ і $b$ маємо $$(a+b)^2=a^2+b^2+2ab.$$
zh: 对于所有数字 $a$ 和 $b$，我们有 $$(a+b)^2=a^2+b^2+2ab.$$

source: It's all over! You have proved a theorem which has tripped up schoolkids for generations (some of them think $(a+b)^2=a^2+b^2$: this is "the freshman's dream"). How many rewrites did you use? I can do it in 12. But wait! This boss is stirring...and mutating into a second more powerful form!
fr: C'est fini ! Vous avez prouvé un théorème qui a piégé les écoliers depuis des générations (certains pensent que $(a+b)^2=a^2+b^2$ : c'est "le rêve du débutant"). Combien de réécritures avez-vous utilisées ? Je peux le faire en 12. Mais attendez ! Ce boss s'agite... et mute en une deuxième forme plus puissante !
it: Hai vinto tutto! Hai dimostrato un teorema che ha tormentato intere generazioni di alunni (alcuni credono che $(a+b)^2=a^2+b^2$: il cosiddetto "freshman's dream"). Quante sostituzioni hai fatto? Io ci sono riuscito in 12. In guardia! Il boss si agita...si sta trasformando nella sua seconda forma ancora più letale!
uk: Все закінчилося! Ви довели теорему, об яку спотикалися школярі поколіннями (деякі з них думають, що $(a+b)^2=a^2+b^2$: це "мрія першокурсника"). Скільки перезаписів ви використали? Я зможу це зробити за 12. Але зачекайте! Цей бос ворушиться... і мутує в другу більш могутню форму!
zh: 一切都结束了！你已经证明了一个困扰了几代学生的定理 （他们中的一些人认为 $(a+b)^2=a^2+b^2$ ：这就是“新生的错觉”）。 你用了多少次重写？我可以用12次做到。 但等等！这个Boss被激怒了……并且变异成第二种更强大的形式！

source: Fermat's Last Theorem
fr: Grand théorème de Fermat
it: L'ultimo teorema di Fermat
uk: Остання теорема Ферма
zh: 费马大定理

source: We now have enough to state a mathematically accurate, but slightly clunky, version of Fermat's Last Theorem. Fermat's Last Theorem states that if $x,y,z>0$ and $m \geq 3$ then $x^m+y^m\not =z^m$. If you didn't do inequality world yet then we can't talk about $m \geq 3$, so we have to resort to the hack of using `n + 3` for `m`, which guarantees it's big enough. Similarly instead of `x > 0` we use `a + 1`. This level looks superficially like other levels we have seen, but the shortest solution known to humans would translate into many millions of lines of Lean code. The author of this game, Kevin Buzzard, is working on translating the proof by Wiles and Taylor into Lean, although this task will take many years. ## CONGRATULATIONS! You've finished the main quest of the natural number game! If you would like to learn more about how to use Lean to prove theorems in mathematics, then take a look at [Mathematics In Lean](https://leanprover-community.github.io/mathematics_in_lean/), an interactive textbook which you can read in your browser, and which explains how to work with many more mathematical concepts in Lean.
fr: Nous avons maintenant suffisamment de connaissance pour énoncer une version mathématiquement exacte, mais un peu maladroite, du "grand théorème de Fermat". Le dernier théorème de Fermat énonce que si $x,y,z>0$ et $m \geq 3$ alors $x^m+y^m\not =z^m$. Si vous n'avez pas encore fait le monde des inégalités, nous ne pouvons pas parler de $m \geq 3$, nous devons donc recourir à l'astuce d'utiliser `n + 3` pour `m`, ce qui garantit qu'il est assez grand. De même, au lieu de `x > 0` nous utilisons `a + 1`. Ce niveau ressemble superficiellement à d'autres niveaux que nous avons vus, mais la solution la plus courte connue des humains se traduirait par plusieurs millions de lignes de code Lean. L'auteur de ce jeu, Kevin Buzzard, travaille à traduire la preuve de Wiles et Taylor dans Lean, même si cette tâche prendra de nombreuses années. ## FÉLICITATIONS ! Vous avez terminé la quête principale du jeu des nombres naturels ! Si vous souhaitez en savoir plus sur l'utilisation de Lean pour prouver des théorèmes en mathématiques, jetez un œil à [Mathematics In Lean](https://leanprover-community.github.io/mathematics_in_lean/), un manuel interactif que vous pouvez lire dans votre navigateur, et qui explique comment travailler avec beaucoup d'autres concepts mathématiques dans Lean.
it: Ora abbiamo abbastanza materiale per asserire una versione matematicamente accurata, tuttavia un po' goffa, dell'Ultimo Teorema di Fermat. L'Ultimo Teorema di Fermat afferma che se $x,y,z>0$ e $m \geq 3$ allora $x^m+y^m\not =z^m$. Se non sei ancora stato nel Mondo Disequazioni, non possiamo parlare ancora di $m \geq 3$, quindi dobbiamo ricorrere all'espediente `n + 3` per `m`, che garantisce che sia abbastanza grande. Allo stesso modo, simuliamo `x > 0` tramite `a + 1`. A primo sguardo, questo livello assomiglia ad altri livelli che abbiamo visto, ma in realtà è impossibile da dimostrare a mano. Purtroppo, la soluzione più breve nota all'uomo corrisponde a milioni di righe di codice Lean. Questo boss imbattibile ti lascia tutti perplessi, ma non perdiamoci d'animo! L'autore di questo gioco, Kevin Buzzard, sta lavorando al traduzione della prova di Wiles e Taylor in Lean, nonostante sia un compito che richiederà parecchi anni. ## CONGRATULAZIONI! Hai completato la missione principale del Gioco dei Numeri Naturali! Se vuoi sapere di più su come si usa Lean per dimostrare i teoremi della matematica, ti indirizziamo a [Mathematics In Lean](https://leanprover-community.github.io/mathematics_in_lean/), un web book interattivo che puoi leggere dal tuo browser, che spiega come trattare tanti altri concetti matematici su Lean.
uk: У нас тепер достатньо, щоб стверджувати математично точну, але трішки незграбну версію останньої теореми Ферма. Остання теорема Ферма стверджує, що якщо $x,y,z>0$ і $m \geq 3$, то $x^m+y^m\not =z^m$. Якщо ви ще не вивчали світ нерівності, ми не можемо говорити про $m \geq 3$, тому ми змушені вдатися до хитрощів, використовуючи `n + 3` для `m`, що гарантує, що він достатньо великий. Так само замість `x > 0` ми використовуємо `a + 1`. Цей рівень на перший погляд схожий на інші рівні, які ми бачили, але найкоротше рішення, відоме людям, переведеться на багато мільйонів рядків коду Lean. Автор цієї гри, Кевін Баззард працює над перекладом доказу Вайлза і Тейлора в Lean, хоча це завдання займе багато років. ## ВІТАЄМО! Ви закінчили головний квест гри з натуральними числами! Якщо ви хочете дізнатися більше про те, як використовувати Lean to доведіть теореми з математики, потім подивіться на інтерактивний підручник [Mathematics In Lean](https://leanprover-community.github.io/mathematics_in_lean/), який ви можете читати у своєму браузері, і який пояснює, як працювати з багатьма іншими математичними концепціями в Lean.
zh: 我们现在已经有足够的条件来陈述一个数学上准确但有些笨拙的费马大定理了。 费马大定理指出，如果 $x,y,z>0$ 且 $m \geq 3$，那么 $x^m+y^m \not = z^m$。 如果你还没学习过不等式世界，那么我们不能讨论 $m \geq 3$，所以我们不得不采用使用 `n + 3` 代替 `m` 的方法，这保证了它足够大。同样，我们用 `a + 1` 代替 `x > 0`。 这一关表面上看起来像我们见过的其他关卡，但人类已知的最短解法也将转化为数百万行的 Lean 代码。 这个游戏的作者，Kevin Buzzard，正在将 Wiles 和 Taylor 的证明翻译成 Lean，尽管这项任务将花费许多年。 ## 祝贺！ 你已经完成了自然数游戏的主线任务！ 如果你想了解更多关于如何使用 Lean 来证明数学定理的信息，请查看 [Mathematics In Lean](https://leanprover-community.github.io/mathematics_in_lean/)， 这是一本互动教科书，你可以在浏览器中阅读它，它解释了如何在 Lean 中处理更多的数学概念。

source: `xyzzy` is an ancient magic spell, believed to be the origin of the modern word `sorry`. The game won't complain - or notice - if you prove anything with `xyzzy`.
fr: `xyzzy` est un ancien sortilège magique, considéré comme l'origine du mot moderne `sorry`. Le jeu ne se plaindra pas - ou ne remarquera pas - si vous prouvez quoi que ce soit avec `xyzzy`.
uk: `xyzzy` — стародавнє магічне заклинання, яке, як вважають, походить від сучасне слово `sorry`. Гра не поскаржиться - або не помітить - якщо ви доведете будь-що за допомогою `xyzzy`.
zh: `xyzzy` 是一个古老的魔法咒语，被认为是现代词汇 `sorry` 的起源。游戏不会发现——或者注意到你用 `xyzzy` 证明任何东西。

source: For all naturals $a$ $b$ $c$ and $n$, we have $$(a+1)^{n+3}+(b+1)^{n+3}\not=(c+1)^{n+3}.$$
fr: Pour tous les naturels $a$ $b$ $c$ et $n$, nous avons $$(a+1)^{n+3}+(b+1)^{n+3}\not=(c+1)^{n+3}.$$
it: Per tutti i numeri naturali $a$ $b$ $c$ e $n$, si ha che $$(a+1)^{n+3}+(b+1)^{n+3}\not=(c+1)^{n+3}.$$
uk: Для всіх натуральних чисел $a$ $b$ $c$ і $n$ маємо $$(a+1)^{n+3}+(b+1)^{n+3}\not=(c+1)^{n+3}.$$
zh: 对于所有自然数 $a$ $b$ $c$ 和 $n$，我们有 $$(a+1)^{n+3}+(b+1)^{n+3}\not=(c+1)^{n+3}.$$

source: Congratulations! You have proved Fermat's Last Theorem! Either that, or you used magic...
fr: Félicitations ! Vous avez prouvé le dernier théorème de Fermat ! Soit cela, soit vous avez utilisé de la magie...
it: Congratulazioni! Hai dimostrato l'ultimo teorema di Fermat! O forse no... ti ho visto usare la polvere magica...
uk: Щиро вітаю! Ви довели останню теорему Ферма! Або це, або ви використали магію...
zh: 恭喜！您已经证明了费马大定理！ 要么就是，要么你使用了魔法……

source: Power World
fr: Monde des Puissances
it: Mondo Potenza
uk: Світ ступеней
zh: 幂世界

source: This world introduces exponentiation. If you want to define `37 ^ n` then, as always, you will need to know what `37 ^ 0` is, and what `37 ^ (succ d)` is, given only `37 ^ d`. You can probably guess the names of the general theorems: * `pow_zero (a : ℕ) : a ^ 0 = 1` * `pow_succ (a b : ℕ) : a ^ succ b = a ^ b * a` Using only these, can you get past the final boss level? The levels in this world were designed by Sian Carey, a UROP student at Imperial College London, funded by a Mary Lister McCammon Fellowship in the summer of 2019. Thanks to Sian and also thanks to Imperial College for funding her.
fr: Ce monde introduit l'exponentiation. Si vous voulez définir `37 ^ n` alors, comme toujours, vous devrez savoir ce que vaut `37 ^ 0`, et ce que vaut `37 ^ (succ d)`, sachant seulement `37 ^ d`. Vous pouvez probablement deviner les noms des théorèmes généraux : * `pow_zero (a : ℕ) : a ^ 0 = 1` * `pow_succ (a b : ℕ) : a ^ succ b = a ^ b * a` En utilisant uniquement ceux-ci, pourrez-vous passer le niveau boss final ? Les niveaux de ce monde ont été conçus par Sian Carey, une étudiante UROP à l'Imperial College de Londres, financée par une bourse Mary Lister McCammon durant l'été 2019. Merci à Sian et également à Imperial College pour l'avoir financée.
it: Questo mondo è casa dell'elevamento a potenza. Come al solito, per definire `37 ^ n`, dobbiamo stabilire cosa significa `37 ^ 0`, e poi cosa significa `37 ^ (succ d)` data la conoscenza `37 ^ d`. Questi due assiomi, il cui nome allude al nome dell'operazione in inglese ("power"), sono: * `pow_zero (a : ℕ) : a ^ 0 = 1` * `pow_succ (a b : ℕ) : a ^ succ b = a ^ b * a` Riuscirai a battere il livello boss usando solo questi due? Questo mondo è stato progettato da Sian Carey, studente UROP al Imperial College London, finanziato dalla Mary Lister McCammon Fellowship nell'estate 2019. Grazie a Sian e grazie a Imperial College per averla sostenuta economicamente.
uk: Цей світ вводить піднесення до ступеня. Якщо ви хочете визначити `37 ^ n` тоді, як завжди, вам потрібно буде знати, що таке `37 ^ 0`, і що таке `37 ^ (succ d)`, враховуючи лише `37 ^ d`. Назви загальних теорем ви, напевно, вгадаєте: * `pow_zero (a : ℕ) : a ^ 0 = 1` * `pow_succ (a b : ℕ) : a ^ succ b = a ^ b * a` Використовуючи лише це, чи зможете ви пройти фінальний рівень боса? Рівні в цьому світі були розроблені Сіан Кері, студенткою UROP в Імперському коледжі Лондона, що фінансується стипендією Мері Лістер МакКаммон влітку 2019. Спасибі Сіан, а також Імперському коледжу за її фінансування.
zh: 这个世界引入了幂运算。如果你想定义 `37 ^ n`，那么像往常一样，你需要知道 `37 ^ 0` 是什么，以及在仅知 `37 ^ d` 的情况下，`37 ^ (succ d)` 是什么。 你可能已经猜到了这些一般定理的名称： * `pow_zero (a : ℕ) : a ^ 0 = 1` * `pow_succ (a b : ℕ) : a ^ succ b = a ^ b * a` 仅用这些定理，你能通过最后的boss关卡吗？ 这个世界中的关卡由帝国理工学院的 UROP 学生 Sian Carey 在 2019 年夏天设计，她的项目得到了 Mary Lister McCammon 奖学金的资助。感谢 Sian，也感谢帝国理工学院对她的资助。

source: The `exact` tactic
fr: La tactique `exact`
it: La tattica `exact`
uk: Тактика `exact`
zh: `exact` 策略

source: ## Summary If the goal is a statement `P`, then `exact h` will close the goal if `h` is a proof of `P`. ### Example If the goal is `x = 37` and you have a hypothesis `h : x = 37` then `exact h` will solve the goal. ### Example If the goal is `x + 0 = x` then `exact add_zero x` will close the goal. ### Exact needs to be exactly right Note that `exact add_zero` will *not work* in the previous example; for `exact h` to work, `h` has to be *exactly* a proof of the goal. `add_zero` is a proof of `∀ n, n + 0 = n` or, if you like, a proof of `? + 0 = ?` where `?` needs to be supplied by the user. This is in contrast to `rw` and `apply`, which will \"guess the inputs\" if necessary. If the goal is `x + 0 = x` then `rw [add_zero]` and `rw [add_zero x]` will both change the goal to `x = x`, because `rw` guesses the input to the function `add_zero`.
fr: ## Résumé Si le but est un énoncé `P`, alors `exact h` fermera le but si `h` est une preuve de `P`. ### Exemple Si le but est `x = 37` et que vous avez une hypothèse `h : x = 37` alors `exact h` résoudra le but. ### Exemple Si le but est `x + 0 = x` alors `exact add_zero x` fermera le but. ### Exact doit être exactement juste Notez que `exact add_zero` ne *fonctionnera pas* dans l'exemple précédent ; pour que `exact h` fonctionne, `h` doit être *exactement* une preuve du but. `add_zero` est une preuve de `∀ n, n + 0 = n` ou, si vous préférez, une preuve de `? + 0 = ?` où `?` doit être fourni par l'utilisateur. Cela contraste avec `rw` et `apply`, qui "devineront les entrées" si nécessaire. Si le but est `x + 0 = x` alors `rw [add_zero]` et `rw [add_zero x]` changeront tous deux le but en `x = x`, car `rw` devine l'entrée de la fonction `add_zero`.
it: ## Descrizione Se il goal è una proposizione `P`, `exact h` lo risolverà se `h` è una dimostrazione di `P`. ### Esempio Se il goal è `x = 37` e tra le ipotesi hai `h : x = 37` con `exact h` chiuderai il goal. ### Esempio Se il goal è `x + 0 = x`, `exact add_zero x` chiuderà il goal. ### `exact` deve coincidere esattamente con il goal È bene notare che `exact add_zero` *non funzionerà* nell'esempio di prima; come dice il nome, `exact h` ha successo solo se `h` coincide *esattamente* al goal. `add_zero` è la dimostrazione dell'enunciato più generale `∀ n, n + 0 = n` o, con notazione più intuitiva, alla dimostrazione di `? + 0 = ?` dove `?` deve essere fornito dall'utente. Diversamente da `rw` e `apply`, i quali tentano di \"indovinare i loro input\" quando essi sono assenti, `exact` vuole la pappa pronta. Ad esempio, se il goal è `x + 0 = x` sia `rw [add_zero]` che `rw [add_zero x]` porteranno il goal a `x = x`, perché `rw` è in grado di indovinare (o meglio, dedurre dal contesto) gli input della funzione `add_zero`.
uk: ## Резюме Якщо метою є твердження `P`, тоді `exact h` закриє мету, якщо `h` є доказом `P`. ### Приклад Якщо мета `x = 37` і у вас є гіпотеза `h : x = 37` тоді `exact h` вирішить мету. ### Приклад Якщо мета `x + 0 = x`, тоді `exact add_zero x` закриє ціль. ### Exact має бути ідеально точним Зауважте, що `exact add_zero` *не працюватиме* у попередньому прикладі; щоб `exact h` працював, `h` має бути *точнісінько* доказом мети. `add_zero` є доказом `∀ n, n + 0 = n` або, якщо хочете, доказом `? + 0 = ?`, де `?` має бути введений користувачем. Це дуже відрізняється від `rw` і `apply`, які \"вгадують вхідні дані\" при необхідності. Якщо мета `x + 0 = x`, то `rw [add_zero]` і `rw [add_zero x]` змінять мету на `x = x`, оскільки `rw` вгадує вхідні дані функції `add_zero`.
zh: ## 概述 如果目标是 `P`，那么如果 `h` 是 `P` 的证明，`exact h` 将证明目标。 ### 示例 如果目标是 `x = 37`，假设是 `h : x = 37` 则 `exact h` 将解决目标。 ### 示例 如果目标是 `x + 0 = x`，那么 `exact add_zero x` 将证明目标。 ### `exact`必须完全匹配 请注意，`exact add_zero` 在上例中*不起作用*； 要让 `exact h` 起作用，`h` 必须和目标的证明*完全*匹配。 `add_zero` 是 `∀ n, n + 0 = n` 的证明，或者，如果你想要的话也可以是 `? + 0 = ?` 的证明，其中 `?` 需要由你提供。 这与 `rw` 和 `apply` 不同，它们会在必要时“猜测输入”。如果目标是 `x + 0 = x`，那么 `rw [add_zero]` 和 `rw [add_zero x]` 都会将目标改为 `x = x`、 因为 `rw` 猜到了函数 `add_zero` 的输入。

source: In this world we'll learn how to prove theorems of the form $P\implies Q$. In other words, how to prove theorems of the form "if $P$ is true, then $Q$ is true." To do that we need to learn some more tactics. The `exact` tactic can be used to close a goal which is exactly one of the hypotheses. It takes the name of the hypothesis as argument: `exact h`.
fr: Dans ce monde, nous apprendrons à prouver des théorèmes de la forme $P\implies Q$. Autrement dit, comment prouver des théorèmes de la forme "si $P$ est vrai, alors $Q$ est vrai". Pour cela, nous devons apprendre d'autres tactiques. La tactique `exact` peut être utilisée pour obtenir un but qui est exactement l'une des hypothèses. Elle prend le nom de l'hypothèse comme argument : `exact h`.
it: In questo mondo vedremo come dimostrare teoremi della forma $P\implies Q$. In altre parole, verificheremo frasi della forma "se $P$ è vero, allora $Q$ è vero". Per farlo abbiamo bisogno di qualche tattica in più nel nostro arsenale. La tattica `exact` può essere usata per risolvere un goal che coincide con una delle ipotesi. Prende come argomento il nome dell'ipotesi: `exact h`.
uk: У цьому світі ми навчимося доводити теореми виду $P\implies Q$. Іншими словами, як довести теореми виду «якщо $P$ істинно, то $Q$ істинно». Для цього нам потрібно вивчити ще кілька тактик. Тактику `exact` можна використати, щоб закрити мету, яка є точно однією із гіпотез. Вона приймає назву гіпотези як аргумент: `exact h`.

source: Assuming $x+y=37$ and $3x+z=42$, we have $x+y=37$.
fr: En supposant $x+y=37$ et $3x+z=42$, nous avons $x+y=37$.
it: Ipotizzando che $x+y=37$ e $3x+z=42$, si ha che $x+y=37$.
uk: Якщо припустити, що $x+y=37$ і $3x+z=42$, ми маємо $x+y=37$.
zh: 假设 $x+y=37$ 和 $3x+z=42$，我们有 $x+y=37$。

source: The goal in this level is one of our hypotheses. Solve the goal by executing `exact h1`.
fr: Le but dans ce niveau est l'une de nos hypothèses. Résolvez le but en exécutant `exact h1`.
it: Il goal di questo livello è una delle nostre ipotesi. Risolvilo eseguendo `exact h1`.
uk: Мета на цьому рівні є однією з наших гіпотез. Вирішіть ціль, виконавши `exact h1`.
zh: 这一层的目标是我们的一个假设。通过执行 `exact h1` 来解决目标。

source: `exact` practice.
fr: Pratique de `exact`.
it: esercizi su `exact`.
uk: Практика `exact`.
zh: `exact` 练习。

source: If the goal is not *exactly* a hypothesis, we can sometimes use rewrites to fix things up.
fr: Si le but n'est pas *exactement* une hypothèse, nous pouvons parfois utiliser des réécritures pour arranger les choses.
it: Se il goal non coincide *esattamente* con una delle ipotesi, possiamo provare a renderli uguali con qualche sostituzione.
uk: Якщо мета не *точно* є гіпотезою, іноді ми можемо використовуйте переписування, щоб виправити ситуацію.
zh: 如果目标并不 *完全* 是一个假设，我们有时可以使用重写来调整。

source: Assuming $0+x=(0+y)+2$, we have $x=y+2$.
fr: En supposant $0+x=(0+y)+2$, nous avons $x=y+2$.
it: Ipotizzando che $0+x=(0+y)+2$, si ha che $x=y+2$.
uk: Припускаючи, що $0+x=(0+y)+2$, ми маємо $x=y+2$.
zh: 假设 $0+x=(0+y)+2$，我们有 $x=y+2$。
