Repository: leanprover-community/NNG4
Catalog: .i18n/*/Game.po
Languages: fr, it, uk, zh

source: level completed! 🎉
fr: niveau terminé ! 🎉
it: livello completato! 🎉
uk: рівень завершено! 🎉
zh: 完成关卡！🎉

source: level completed with warnings… 🎭
fr: niveau terminé avec des avertissements… 🎭
it: livello completato, ma ci sono dei warning... 🎭
uk: рівень завершено з попередженнями... 🎭
zh: 完成关卡！🎉（有警告）

source: intermediate goal solved! 🎉
fr: objectif intermédiaire résolu ! 🎉
it: goal intermedio risolto! 🎉
uk: проміжну мету вирішено! 🎉
zh: 中间目标证明！🎉

source: The rfl tactic
fr: La tactique rfl
it: La tattica rfl
uk: Тактика rfl
zh: rfl策略

source: ## Summary `rfl` proves goals of the form `X = X`. In other words, the `rfl` tactic will close any goal of the form `A = B` if `A` and `B` are *identical*. `rfl` is short for \"reflexivity (of equality)\". ## Example: If the goal looks like this: ``` x + 37 = x + 37 ``` then `rfl` will close it. But if it looks like `0 + x = x` then `rfl` won't work, because even though $0+x$ and $x$ are always equal as *numbers*, they are not equal as *terms*. The only term which is identical to `0 + x` is `0 + x`. ## Details `rfl` is short for \"reflexivity of equality\". ## Game Implementation *Note that our `rfl` is weaker than the version used in core Lean and `mathlib`, for pedagogical purposes; mathematicians do not distinguish between propositional and definitional equality because they think about definitions in a different way to type theorists (`zero_add` and `add_zero` are both \"facts\" as far as mathematicians are concerned, and who cares what the definition of addition is).*
fr: ## Résumé `rfl` prouve les buts de la forme `X = X`. Autrement dit, la tactique `rfl` fermera tout but de la forme `A = B` si `A` et `B` sont *identiques*. `rfl` est l'abréviation de "réflexivité (de l'égalité)". ## Exemple : Si le but ressemble à ceci : ``` x + 37 = x + 37 ``` alors `rfl` le fermera. Mais s'il ressemble à `0 + x = x`, alors `rfl` ne fonctionnera pas, car même si $0+x$ et $x$ sont toujours égaux en tant que *nombres*, ils ne sont pas égaux en tant que *termes*. Le seul terme identique à `0 + x` est `0 + x`. ## Détails `rfl` est l'abréviation de "réflexivité de l'égalité". ## Implémentation dans le jeu *Notez que, pour des raisons pédagogiques, notre `rfl` est plus faible que la version utilisée dans Lean et `mathlib`, ; les mathématiciens ne distinguent pas l'égalité propositionnelle et l'égalité définitionnelle car ils pensent aux définitions d'une manière différente des théoriciens des types (`zero_add` et `add_zero` sont tous deux des "faits" pour les mathématiciens, et qui se soucie de la définition de l'addition ?).*
uk: ## Резюме `rfl` доводить мету у вигляді `X = X`. Іншими словами, тактика `rfl` закриє будь-яку мету у формі `A = B`, якщо `A` і `B` *ідентичні*. `rfl` є скороченням від \"reflexivity (of equality)\". ## Приклад: Якщо мета виглядає так: ``` х + 37 = х + 37 ``` тоді `rfl` закриє її. Але якщо мета виглядає як `0 + x = x`, тоді `rfl` не cпрацює, тому що навіть Хоча $0+x$ і $x$ завжди рівні як *числа*, вони не рівні як *терми*. Єдиний терм, який ідентичний `0 + x`, це `0 + x`. ## Подробиці `rfl` є скороченням від \"reflexivity of equality\". ## Реалізація гри *Зверніть увагу, що наш `rfl` слабший, ніж версія, яка використовується в базовому Lean і `mathlib`, задля педагогічних цілей; математики не розрізняють між пропозиційною рівністю і рівністю визначень, оскільки вони думають про визначення відмінно від теоретиків типів (`zero_add` і `add_zero` є \"фактами\" із точки зору математиків, і кого хвилює, яке визначення додавання).*
zh: ## 概述 `rfl` 证明形如 `X = X` 的目标。 换句话说，如果 `A` 和 `B` *完全相同*，`rfl` 策略将证明形如 `A = B` 的目标。 `rfl` 是 “reflexivity（等价关系的反身性）”的缩写。 ## 示例： 如果目标如下： ``` x + 37 = x + 37 ``` 那么 `rfl` 将证明它。但如果它看起来像 `0 + x = x`，那么 `rfl` 将无法工作，因为即使 $0+x$ 和 $x$ 作为*数字*总是相等，但它们作为*项*并不相等。唯一与 `0 + x` 相同的项是 `0 + x`。 ## 详细信息 `rfl` 是 “reflexivity of equality（等价关系的反身性）”的缩写。 ## 游戏实现 *请注意，出于教学目的，我们的 `rfl` 比核心 Lean 和 `mathlib` 中使用的版本弱一些；数学家不区分命题等价和定义等价，因为他们以不同于类型理论家的方式思考定义（就数学家而言，`zero_add` 和 `add_zero` 都是 “事实”，谁会在乎加法的定义是什么呢）。* （译注：因为 `add_zero` 是加法定义的一部分，而定义等价是可以直接用 `rfl` 证明的。也就是说 `x + 0 = x` 可以用 `rfl` 证明。所以作者多了一嘴，但实际上因为很少有人知道类型理论家怎么思考，所以这个注解看起来会有些奇怪。）

source: # Read this first Each level in this game involves proving a mathematical theorem (the "Goal"). The goal will be a statement about *numbers*. Some numbers in this game have known values. Those numbers have names like $37$. Other numbers will be secret. They're called things like $x$ and $q$. We know $x$ is a number, we just don't know which one. In this first level we're going to prove the theorem that $37x + q = 37x + q$. You can see `x q : ℕ` in the *Objects* below, which means that `x` and `q` are numbers. We solve goals in Lean using *Tactics*, and the first tactic we're going to learn is called `rfl`, which proves all theorems of the form $X = X$. Prove that $37x+q=37x+q$ by executing the `rfl` tactic.
fr: # Lisez ceci d'abord Chaque niveau de ce jeu consiste à prouver un théorème mathématique (le "But"). Le but sera un énoncé sur des *nombres*. Certains nombres dans ce jeu ont des valeurs connues. Ces nombres ont des noms comme $37$. D'autres nombres seront secrets. Ils sont appelés $x$ et $q$. Nous savons que $x$ est un nombre, nous ne savons juste pas lequel. Dans ce premier niveau, nous allons prouver le théorème que $37x + q = 37x + q$. Vous pouvez voir `x q : ℕ` dans les *Objets* ci-dessous, ce qui signifie que `x` et `q` sont des nombres. Nous résolvons les buts dans Lean en utilisant des *Tactiques*, et la première tactique que nous allons apprendre s'appelle `rfl`, qui prouve tous les théorèmes de la forme $X = X$. Prouvez que $37x+q=37x+q$ en exécutant la tactique `rfl`.
it: # Leggi questo prima Ciascun livello di questo gioco consiste nel dimostrare un teorema matematico (il cosiddetto "goal"). Il goal è tipicamente un'affermazione che riguarda dei numeri. Certi numeri avranno dei valori ben precisi, come $37$. Altri numeri saranno invece dati come incognite, e queste verranno denotate con delle lettere quali $x$ o $q$. Possiamo dire con certezza che $x$ è un numero, ma non sappiamo quale! In questo primo livello dimostreremo il teorema $37x + q = 37x + q$. Nella sezione *Oggetti* in basso puoi vedere `x q : ℕ`, che significa che `x` e `q` sono numeri naturali. Per risolvere i goal in Lean usiamo le *tattiche*. La prima tattica che vedremo si chiama `rfl`, che dimostra tutti i goal della forma $X = X$. Adesso tocca a te! Dimostra $37x+q=37x+q$ eseguendo la tattica `rfl`.
uk: # Спочатку прочитайте це Кожен рівень цієї гри передбачає доведення математичної теореми («Мети»). Метою буде твердження про *числа*. Деякі числа в цій грі мають відомі значення. Ці числа мають такі назви, як $37$. Інші цифри будуть секретними. Їх називають такими штуками як $x$ і $q$. Ми знаємо, що $x$ — це число, але ми не знаємо, яке саме. На першому рівні ми доведемо теорему, що $37x + q = 37x + q$. Ви можете побачити `x q : ℕ` в *Об'єктах* нижче, що означає, що `x` і `q` це числа. Ми досягаємо мети в Lean, використовуючи *Тактики*, і це перша тактика яку ми вивчимо називається `rfl`, який доводить усі теореми виду $X = X$. Доведіть, що $37x+q=37x+q$, виконавши тактику `rfl`.
zh: # 游戏指南 在这个游戏的每个关卡中，你都将挑战证明一个数学定理，这里称之为“目标”。这些目标主要与*自然数*相关。游戏中，一些数具有明确的值，例如 $37$ 这类具体的数。然而，还有一些数是未知数，它们被称为 $x$、$q$ 等。虽然我们不知道 $x$ 的具体值，但我们知道它代表一个自然数。 在游戏的第一关，我们的任务是证明定理 $37x + q = 37x + q$。你将在下方的*对象*中看到 `x q : ℕ`，这表示 `x` 和 `q` 都是自然数。 为了在 Lean 中证明这些目标，我们将学习和使用各种*策略*。首先介绍的策略是 `rfl`，它用于证明所有形式为 $X = X$ 的定理。 要证明 $37x+q=37x+q$，请使用 `rfl` 策略。

source: If $x$ and $q$ are arbitrary natural numbers, then $37x+q=37x+q.$
fr: Si $x$ et $q$ sont des nombres naturels arbitraires, alors $37x+q=37x+q.$
it: Se $x$ e $q$ sono numeri naturali qualsiasi, allora $37x+q=37x+q.$
uk: Якщо $x$ і $q$ довільні натуральні числа, то $37x+q=37x+q.$
zh: 如果 $x$ 和 $q$ 是任意自然数，那么 $37x+q=37x+q$ 。

source: In order to use the tactic `rfl` you can enter it in the text box under the goal and hit "Execute".
fr: Pour utiliser la tactique `rfl`, vous pouvez l'entrer dans la zone de texte sous le but et appuyer sur "Exécuter".
it: Per utilizzare la tattica `rfl` digitala nella casella di testo sotto il goal e premi "Esegui".
uk: Щоб використати тактику `rfl`, ви можете ввести її в текстове поле під метою та натисніть «Виконати».
zh: 要使用策略 "rfl"，您可以在目标下的文本框中输入它，然后点击 "执行"。

source: Congratulations! You completed your first verified proof! Remember that `rfl` is a *tactic*. If you ever want information about the `rfl` tactic, you can click on `rfl` in the list of tactics on the right. Now click on "Next" to learn about the `rw` tactic.
fr: Félicitations ! Vous avez complété votre première preuve vérifiée ! Rappelez-vous que `rfl` est une *tactique*. Si vous voulez des informations sur la tactique `rfl`, vous pouvez cliquer sur `rfl` dans la liste des tactiques à droite. Cliquez maintenant sur "Suivant" pour apprendre la tactique `rw`.
it: Congratulazioni! Hai completato la tua prima dimostrazione formale! Ricorda che `rfl` è una *tattica*. Se vuoi sapere di più sulla tattica `rfl`, clicca su `rfl` nella lista di tattiche a destra. Adesso vedremo la tattica `rw`. Premi "Avanti".
uk: Вітаю! Ви завершили свій перший перевірений доказ! Пам’ятайте, що `rfl` - це *тактика*. Якщо вам колись знадобиться інформація про тактику `rfl`, ви можете натиснути `rfl` у списку тактик праворуч. Тепер натисніть «Далі», щоб дізнатися про тактику `rw`.
zh: 恭喜你！你已经完成了第一个证明！ 请记得，`rfl` 是一种*策略*。如果你对 `rfl` 策略有更多的兴趣想要深入了解，可以尝试点击右侧策略列表中的 `rfl` 查看详情。 现在，请点击“下一关”，继续学习 `rw`（重写）策略。

source: the rw tactic
fr: la tactique rw
it: la tattica rw
uk: тактика rw
zh: rw 策略

source: ## Summary If `h` is a proof of an equality `X = Y`, then `rw [h]` will change all `X`s in the goal to `Y`s. It's the way to \"substitute in\". ## Variants * `rw [← h]` (changes `Y`s to `X`s; get the back arrow by typing `\left ` or `\l`.) * `rw [h1, h2]` (a sequence of rewrites) * `rw [h] at h2` (changes `X`s to `Y`s in hypothesis `h2`) * `rw [h] at h1 h2 ⊢` (changes `X`s to `Y`s in two hypotheses and the goal; get the `⊢` symbol with `\|-`.) * `repeat rw [add_zero]` will keep changing `? + 0` to `?` until there are no more matches for `? + 0`. * `nth_rewrite 2 [h]` will change only the second `X` in the goal to `Y`. ### Example: If you have the assumption `h : x = y + y` and your goal is ``` succ (x + 0) = succ (y + y) ``` then `rw [add_zero]` will change the goal into `succ x = succ (y + y)`, and then `rw [h]` will change the goal into `succ (y + y) = succ (y + y)`, which can be solved with `rfl`. ### Example: You can use `rw` to change a hypothesis as well. For example, if you have two hypotheses ``` h1 : x = y + 3 h2 : 2 * y = x ``` then `rw [h1] at h2` will turn `h2` into `h2 : 2 * y = y + 3`. ## Common errors * You need the square brackets. `rw h` is never correct. * If `h` is not a *proof* of an *equality* (a statement of the form `A = B`), for example if `h` is a function or an implication, then `rw` is not the tactic you want to use. For example, `rw [P = Q]` is never correct: `P = Q` is the theorem *statement*, not the proof. If `h : P = Q` is the proof, then `rw [h]` will work. ## Details The `rw` tactic is a way to do \"substituting in\". There are two distinct situations where you can use this tactic. 1) Basic usage: if `h : A = B` is an assumption or the proof of a theorem, and if the goal contains one or more `A`s, then `rw [h]` will change them all to `B`s. The tactic will error if there are no `A`s in the goal. 2) Advanced usage: Assumptions coming from theorem proofs often have missing pieces. For example `add_zero` is a proof that `? + 0 = ?` because `add_zero` really is a function, and `?` is the input. In this situation `rw` will look through the goal for any subterm of the form `x + 0`, and the moment it finds one it fixes `?` to be `x` then changes all `x + 0`s to `x`s. Exercise: think about why `rw [add_zero]` changes the term `(0 + 0) + (x + 0) + (0 + 0) + (x + 0)` to `0 + (x + 0) + 0 + (x + 0)` If you can't remember the name of the proof of an equality, look it up in the list of lemmas on the right. ## Targetted usage If your goal is `b + c + a = b + (a + c)` and you want to rewrite `a + c` to `c + a`, then `rw [add_comm]` will not work because Lean finds another addition first and swaps those inputs instead. Use `rw [add_comm a c]` to guarantee that Lean rewrites `a + c` to `c + a`. This works because `add_comm` is a proof that `?1 + ?2 = ?2 + ?1`, `add_comm a` is a proof that `a + ? = ? + a`, and `add_comm a c` is a proof that `a + c = c + a`. If `h : X = Y` then `rw [h]` will turn all `X`s into `Y`s. If you only want to change the 37th occurrence of `X` to `Y` then do `nth_rewrite 37 [h]`.
fr: ## Résumé Si `h` est une preuve d'une égalité `X = Y`, alors `rw [h]` changera tous les `X` du but en `Y`. `rw` est l’abréviation de "rewrite". C'est la manière de "substituer". ## Variantes * `rw [← h]` (change les `Y` en `X` ; obtenez la flèche gauche en tapant `\left ` ou `\l`.) * `rw [h1, h2]` (une séquence de réécritures) * `rw [h] at h2` (change les `X` en `Y` dans l'hypothèse `h2`) * `rw [h] at h1 h2 ⊢` (change les `X` en `Y` dans deux hypothèses et le but ; obtenez le symbole `⊢` avec `\|-`.) * `repeat rw [add_zero]` continuera à changer `? + 0` en `?` jusqu'à ce qu'il n'y ait plus de correspondances pour `? + 0`. * `nth_rewrite 2 [h]` ne changera que le deuxième `X` du but en `Y`. ### Exemple : Si vous avez l'hypothèse `h : x = y + y` et que votre but est ``` succ (x + 0) = succ (y + y) ``` alors `rw [add_zero]` changera le but en `succ x = succ (y + y)`, puis `rw [h]` changera le but en `succ (y + y) = succ (y + y)`, ce qui peut être résolu avec `rfl`. ### Exemple : Vous pouvez également utiliser `rw` pour changer une hypothèse. Par exemple, si vous avez deux hypothèses ``` h1 : x = y + 3 h2 : 2 * y = x ``` alors `rw [h1] at h2` transformera `h2` en `h2 : 2 * y = y + 3`. ## Erreurs courantes * Vous avez besoin des crochets. `rw h` n'est jamais valide. * Si `h` n'est pas une *preuve* d'une *égalité* (un énoncé de la forme `A = B`), par exemple si `h` est une fonction ou une implication, alors `rw` n'est pas la tactique que vous voulez utiliser. Par exemple, `rw [P = Q]` n'est jamais correct : `P = Q` est l'*énoncé* du théorème, pas la preuve. Si `h : P = Q` est la preuve, alors `rw [h]` fonctionnera. ## Détails La tactique `rw` est un moyen de faire une "substitution". Il y a deux situations distinctes où vous pouvez utiliser cette tactique. 1) Utilisation basique : si `h : A = B` est une hypothèse ou la preuve d'un théorème, et si le but contient un ou plusieurs `A`, alors `rw [h]` les changera tous en `B`. La tactique échouera s'il n'y a pas de `A` dans le but. 2) Utilisation avancée : Les hypothèses provenant de preuves de théorèmes ont souvent des parties manquantes. Par exemple, `add_zero` est une preuve que `? + 0 = ?` car `add_zero` est en fait une fonction, et `?` est l'entrée. Dans cette situation, `rw` parcourra le but à la recherche de tout sous-terme de la forme `x + 0`, et dès qu'il en trouve un, il fixe `?` à `x` puis change tous les `x + 0` en `x`. Exercice : réfléchissez à pourquoi `rw [add_zero]` change le terme `(0 + 0) + (x + 0) + (0 + 0) + (x + 0)` en `0 + (x + 0) + 0 + (x + 0)` Si vous ne vous souvenez pas du nom de la preuve d'une égalité, cherchez-la dans la liste des lemmes à droite. ## Utilisation ciblée Si votre but est `b + c + a = b + (a + c)` et que vous voulez réécrire `a + c` en `c + a`, alors `rw [add_comm]` ne fonctionnera pas car Lean trouve d'abord une autre addition et échange ces entrées à la place. Utilisez `rw [add_comm a c]` pour garantir que Lean réécrit `a + c` en `c + a`. Cela fonctionne car `add_comm` est une preuve que `?1 + ?2 = ?2 + ?1`, `add_comm a` est une preuve que `a + ? = ? + a`, et `add_comm a c` est une preuve que `a + c = c + a`. Si `h : X = Y` alors `rw [h]` transformera tous les `X` en `Y`. Si vous voulez seulement changer la 37ème occurrence de `X` en `Y`, alors faites `nth_rewrite 37 [h]`.
uk: ## Резюме Якщо `h` є доказом рівності `X = Y`, то `rw [h]` зміниться всі `X` у меті на `Y`. Це спосіб \"заміни всередині\". ## Варіанти * `rw [← h]` (змінює `Y` на `X`; щоб отримати стрілку назад, ввівши `\left ` або `\l`.) * `rw [h1, h2]` (послідовність перезаписів) * `rw [h] at h2` (змінює `X` на `Y` в гіпотезі `h2`) * `rw [h] at h1 h2 ⊢` (змінює `X` на `Y` у двох гіпотезах і меті; отримайте символ `⊢` за допомогою `\|-`.) * `repeat rw [add_zero]` постійно змінюватиметься `? + 0` до `?` поки не буде більше співпадінь для `? + 0`. * `nth_rewrite 2 [h]` змінить лише другий `X` у меті на `Y`. ### Приклад: Якщо у вас є припущення `h : x = y + y` і ваша мета ``` succ (x + 0) = succ (y + y) ``` тоді `rw [add_zero]` змінить мету на `succ x = succ (y + y)`, а потім `rw [h]` змінить мету на `succ (y + y) = succ (y + y)`, що можна вирішити за допомогою `rfl`. ### Приклад: Ви також можете використовувати `rw`, щоб змінити і гіпотезу також. Наприклад, якщо у вас є дві гіпотези ``` h1 : x = y + 3 h2 : 2 * y = x ``` тоді `rw [h1] at h2` перетворить `h2` на `h2 : 2 * y = y + 3`. ## Типові помилки * Вам потрібні квадратні дужки. `rw h` ніколи не буде правильним записом. * Якщо `h` не є *доказом* *рівності* (твердження у формі `A = B`), наприклад, якщо `h` є функцією або імплікацією, тоді `rw` - це не та тактика, яку вам потрібно використовувати. Наприклад, `rw [P = Q]` ніколи не буде правильним записом: `P = Q` - *твердження* теореми, не доказ. Якщо `h : P = Q` є доказом, то `rw [h]` буде працювати. ## Подробиці Тактика `rw` - це спосіб зробити \"заміну всередині\". там є дві різні ситуації, коли ви можете використовувати цю тактику. 1) Базове використання: якщо `h : A = B` є припущенням або доказом теореми, а якщо ціль містить одну або більше літер `A`, тоді rw [h] змінить їх усіх на `B`. Тактика дасть помилку якщо в меті відсутнє`A`. 2) Розширене використання: припущення, що випливають із доказів теорем часто мають відсутні частини. Наприклад `add_zero` є доказом того, що `? + 0 = ?`, оскільки `add_zero` насправді є функцією, і `?` є вхідним параметром. У цій ситуації `rw` буде дивитися скрізь мету у пошуках будь-якого підтерму виду `x + 0`, і у момент коли знаходить один, вона виправляє `?` на `x`, а потім змінює всі `x + 0` на `x`. Вправа: подумайте, чому `rw [add_zero]` змінює терм `(0 + 0) + (x + 0) + (0 + 0) + (x + 0)` на `0 + (x + 0) + 0 + (x + 0)` Якщо ви не пам’ятаєте назву доказу рівності, знайдіть його в списку лем праворуч. ## Цільове використання Якщо вашою метою є `b + c + a = b + (a + c)`, і ви хочете переписати `a + c` на `c + a`, тоді `rw [add_comm]` не працюватиме, оскільки Lean знаходить спочатку інше додавання та замінює ці вхідні дані замість бажаного. Використовуйте `rw [add_comm a c]` для гарантій, що Lean переписує `a + c` на `c + a`. Це працює, тому що `add_comm` є доказом того, що `?1 + ?2 = ?2 + ?1`, `add_comm a` є доказом що `a + ? = ? + a`, а `add_comm a c` є доказом того, що `a + c = c + a`. Якщо `h : X = Y`, то `rw [h]` перетворить усі `X` на `Y`. Якщо ви хочете змінити лише 37-е входження `X` на `Y`, тоді виконайте `nth_rewrite 37 [h]`.

source: ## Summary `repeat t` repeatedly applies the tactic `t` to the goal. You don't need to use this tactic, it just speeds things up sometimes. ## Example `repeat rw [add_zero]` will turn the goal `a + 0 + (0 + (0 + 0)) = b + 0 + 0` into the goal `a = b`. " TacticDoc nth_rewrite " ## Summary If `h : X = Y` and there are several `X`s in the goal, then `nth_rewrite 3 [h]` will just change the third `X` to a `Y`. ## Example If the goal is `2 + 2 = 4` then `nth_rewrite 2 [two_eq_succ_one]` will change the goal to `2 + succ 1 = 4`. In contrast, `rw [two_eq_succ_one]` will change the goal to `succ 1 + succ 1 = 4`.
fr: ## Résumé `repeat t` applique répétitivement la tactique `t` au but. Vous n'avez pas besoin d'utiliser cette tactique, elle accélère simplement les choses parfois. ## Exemple `repeat rw [add_zero]` transformera le but `a + 0 + (0 + (0 + 0)) = b + 0 + 0` en le but `a = b`. " TacticDoc nth_rewrite " ## Résumé Si `h : X = Y` et qu'il y a plusieurs `X` dans le but, alors `nth_rewrite 3 [h]` ne changera que le troisième `X` en `Y`. ## Exemple Si le but est `2 + 2 = 4` alors `nth_rewrite 2 [two_eq_succ_one]` changera le but en `2 + succ 1 = 4`. En revanche, `rw [two_eq_succ_one]` changera le but en `succ 1 + succ 1 = 4`.
it: ## Descrizione `repeat t` applica la tattica `t` nel goal ripetitivamente. Non è necessario usare questa tattica per completare il gioco, ma a volte è utile nel rendere le dimostrazioni più succinte. ## Esempio `repeat rw [add_zero]` trasformerà il goal `a + 0 + (0 + (0 + 0)) = b + 0 + 0` nel nuovo goal `a = b`. " TacticDoc nth_rewrite " ## Descrizione Se hai `h : X = Y` e ci sono diverse `X` nel goal, allora `nth_rewrite 3 [h]` sostituirà solo la terza `X` in `Y`. ## Esempio Se nel goal hai `2 + 2 = 4` allora con `nth_rewrite 2 [two_eq_succ_one]` sostituisce la seconda occorrenza del lato sinistro di `two_eq_succ_one`, e il goal diventa `2 + succ 1 = 4`. Invece il normale `rw [two_eq_succ_one]` sostituira la prima occorrenza di `2` nel goal, che diventa `succ 1 + succ 1 = 4`.
uk: ## Резюме `repeat t` повторно застосовує тактику `t` до мети. Вам не потрібно користуватися цією тактикою, іноді вона просто прискорює події. ## Приклад `repeat rw [add_zero]` перетворить мету `a + 0 + (0 + (0 + 0)) = b + 0 + 0` в мету `a = b`. " TacticDoc nth_rewrite " ## Резюме Якщо `h : X = Y` і є кілька `X` у меті, тоді `nth_rewrite 3 [h]` просто змінить трете `X` на `Y`. ## Приклад Якщо ціль `2 + 2 = 4`, то `nth_rewrite 2 [two_eq_succ_one]` змінить ціль на `2 + succ 1 = 4`. На відміну від цього, `rw [two_eq_succ_one]` змінить ціль на `succ 1 + succ 1 = 4`.
zh: ## 小结 `repeat t` 反复应用策略 `t` 到目标上。这个是个可选策略，它只是有时可以节省步骤。 ## 示例 `repeat rw [add_zero]` 会将目标 `a + 0 + (0 + (0 + 0)) = b + 0 + 0` 变为 `a = b`。

source: ## Summary If `h : X = Y` and there are several `X`s in the goal, then `nth_rewrite 3 [h]` will just change the third `X` to a `Y`. ## Example If the goal is `2 + 2 = 4` then `nth_rewrite 2 [two_eq_succ_one]` will change the goal to `2 + succ 1 = 4`. In contrast, `rw [two_eq_succ_one]` will change the goal to `succ 1 + succ 1 = 4`.
fr: ## Résumé Si `h : X = Y` et qu'il y a plusieurs `X` dans le but, alors `nth_rewrite 3 [h]` ne changera que le troisième `X` en `Y`. ## Exemple Si le but est `2 + 2 = 4` alors `nth_rewrite 2 [two_eq_succ_one]` changera le but en `2 + succ 1 = 4`. En revanche, `rw [two_eq_succ_one]` changera le but en `succ 1 + succ 1 = 4`.
it: ## Descrizione Se hai `h : X = Y` e nel goal ci sono diverse `X`, con `nth_rewrite 3 [h]` puoi cambiare solo la terza `X` in `Y`. ## Esempio Se il goal è `2 + 2 = 4` allora `nth_rewrite 2 [two_eq_succ_one]` sostituirà la seconda occorrenza di `2`, e il goal diventerà `2 + succ 1 = 4`. Invece, il semplice `rw [two_eq_succ_one]` sostituirà tutte le occorrenze di `2` e il goal diventerà `succ 1 + succ 1 = 4`.
uk: ## Резюме Якщо `h : X = Y` і є кілька `X` у меті, тоді `nth_rewrite 3 [h]` просто змінить третій `X` на `Y`. ## Приклад Якщо ціль `2 + 2 = 4`, тоді `nth_rewrite 2 [two_eq_succ_one]` змінить мету на `2 + succ 1 = 4`. На відміну від цього, `rw [two_eq_succ_one]` змінить мету на `succ 1 + succ 1 = 4`.
zh: ## 小结 如果 `h : X = Y` 并且在目标中有多个 `X`，那么 `nth_rewrite 3 [h]` 将仅更改第三个 `X` 为 `Y`。 ## 示例 如果目标是 `2 + 2 = 4`，那么 `nth_rewrite 2 [two_eq_succ_one]` 将目标更改为 `2 + succ 1 = 4`。相比之下，`rw [two_eq_succ_one]` 将目标更改为 `succ 1 + succ 1 = 4`。
