Repository: leanprover-community/NNG4
Catalog: .i18n/*/Game.po
Languages: fr, it, uk, zh

source: Here's my proof: ``` intro h rw [add_succ, add_succ, add_zero] at h repeat apply succ_inj at h apply zero_ne_succ at h exact h ``` Even though Lean is a theorem prover, right now it's pretty clear that we have not developed enough material to make it an adequate calculator. In Algorithm World, a more computer-sciency world, we will develop machinery which makes questions like this much easier, and goals like $20 + 20 ≠ 41$ feasible. Alternatively you can do more mathematics in Advanced Addition World, where we prove the lemmas needed to get a working theory of inequalities. Click "Leave World" and decide your route.
fr: Voici ma preuve : ``` intro h rw [add_succ, add_succ, add_zero] at h repeat apply succ_inj at h apply zero_ne_succ at h exact h ``` Bien que Lean soit un prouveur de théorèmes, il est clair que nous n'avons pas développé suffisamment de matériel pour en faire une calculatrice adéquate. Dans le monde Algorithmique, un monde plus informatique, nous développerons des mécanismes qui rendent des questions comme celle-ci beaucoup plus faciles, et des buts comme $20 + 20 ≠ 41$ réalisables. Alternativement, vous pouvez faire plus de mathématiques dans le monde de l'Addition Avancée, où nous prouvons les lemmes nécessaires pour obtenir une théorie opérationnelle des inégalités. Cliquez sur "Quitter le monde" et décidez de votre route.
it: Ecco la mia dimostrazione: ``` intro h rw [add_succ, add_succ, add_zero] at h repeat apply succ_inj at h apply zero_ne_succ at h exact h ``` Lean è un theorem prover, ma non abbiamo ancora parlato del fatto che può anche fungere da linguaggio di programmazione. Nel Mondo Algoritmi, un mondo dal carattere più informatico, svilupperemo programmi per automatizzare le dimostrazioni, grazie ai quali potremo dimostrare $20 + 20 ≠ 41$ senza diventare matti. In alternativa, puoi proseguire lungo il filo matematico nel Mondo Addizione Avanzata, dove dimostreremo i lemmi che supportano la teoria delle disuguaglianze. Clicca su "Abbandona mondo" e scegli la tua strada.
uk: Ось мій доказ: ``` intro h rw [add_succ, add_succ, add_zero] at h repeat apply succ_inj at h apply zero_ne_succ at h exact h ``` Незважаючи на те, що Lean є інструментом доказу теорем, наразі цілком зрозуміло, що ми не розробили достатньо матеріалу, щоб зробити його адекватним калькулятором. В Світі Алгоритмів, більш комп’ютерно-науковому світі, ми будемо розробляти машинерію, яка зробить подібні запитання набагато простішими, а таку мета, як $20 + 20 ≠ 41$, здійсненною. Крім того, ви можете робити більше математики в Світі продвинотого додавання, де ми перевіряємо леми, необхідні для отримання робочої теорії нерівностей. Натисніть «Залишити світ» і виріште свій подальшій маршрут.
zh: 这是一个证明： ``` intro h rw [add_succ, add_succ, add_zero] at h repeat apply succ_inj at h apply zero_ne_succ at h exact h ``` 尽管 Lean 是一个定理证明器，但很明显我们还没有开发足够的材料使其成为一个合适的计算器。在算法世界，一个更具计算机科学色彩的世界中，我们将开发使这类问题变得更容易的机制（比如快速证明 $20 + 20 \neq 41$ ）。或者，你也可以在高级加法世界中进行更多数学学习，我们在那里证明了建立不等式理论所需的引理。点击“离开世界”并决定你的路线。

source: Implication World
fr: Monde de l'Implication
it: Mondo Implicazione
uk: Світ імплікацій
zh: 蕴含世界

source: We've proved that $2+2=4$; in Implication World we'll learn how to prove $2+2\neq 5$. In Addition World we proved *equalities* like $x + y = y + x$. In this second tutorial world we'll learn some new tactics, enabling us to prove *implications* like $x+1=4 \implies x=3.$ We'll also learn two new fundamental facts about natural numbers, which Peano introduced as axioms. Click on "Start" to proceed.
fr: Nous avons prouvé que $2+2=4$ ; dans le monde de l'Implication, nous apprendrons comment prouver $2+2\neq 5$. Dans le monde de l'Addition, nous avons prouvé des *égalités* comme $x + y = y + x$. Dans ce deuxième monde tutoriel, nous apprendrons de nouvelles tactiques, nous permettant de prouver des *implications* comme $x+1=4 \implies x=3$. Nous apprendrons également deux nouveaux faits fondamentaux sur les nombres naturels, que Peano a introduits comme axiomes. Cliquez sur "Commencer" pour continuer.
it: Abbiamo dimostrato $2+2=4$; nel Mondo Implicazione vedremo come dimostrare $2+2\neq 5$. Nel Mondo Addizione abbiamo dimostrato *uguaglianze* del tipo $x + y = y + x$. In questo mondo apprenderai le tattiche che ci permettono di dimostrare le *implicazioni* come $x+1=4 \implies x=3.$ Imparerai inoltre due nuovi fatti fondamentali sui numeri naturali, che Peano postulò come assiomi. Premi su "Via" per iniziare.
uk: Ми довели, що $2+2=4$; у Світі імплікацій ми навчимося як довести $2+2\neq 5$. У Світі додавання ми довели *рівності* такі як $x + y = y + x$. У цьому другому навчальному курсі ми навчимося деяких нових тактик, що дозволяє нам довести *імплікації* такі як $x+1=4 \implies x=3.$ Ми також дізнаємося про два нових фундаментальних факта про натуральні числа, які Пеано ввів як аксіоми. Натисніть «Почати», щоб продовжити.
zh: 我们已经证明了 $2+2=4$；在“蕴含世界”中，我们将学习如何证明 $2+2\neq 5$。 在加法世界中，我们证明了像 $x + y = y + x$ 这样的*等式*。在这第二个教程世界中，我们将学习一些新的策略，使我们能够证明像 $x+1=4 \implies x=3$ 这样的*蕴含*。 我们还将学习关于自然数的两个新的基本事实，这些是皮亚诺作为公理引入的。 点击“开始”继续。

source: `add_left_comm a b c` is a proof that `a + (b + c) = b + (a + c)`.
fr: `add_left_comm a b c` est une preuve que `a + (b + c) = b + (a + c)`.
it: `add_left_comm a b c` è la dimostrazione di `a + (b + c) = b + (a + c)`.
uk: `add_left_comm a b c` є доказом того, що `a + (b + c) = b + (a + c)`.
zh: `add_left_comm a b c` 是 `a + (b + c) = b + (a + c)` 的证明。

source: Having to rearrange variables manually using commutativity and associativity is very tedious. We start by reminding you of this. `add_left_comm` is a key component in the first algorithm which we'll explain, but we need to prove it manually. Remember that you can do precision commutativity rewriting with things like `rw [add_comm b c]`. And remember that `a + b + c` means `(a + b) + c`.
fr: Devoir réarranger manuellement les variables en utilisant la commutativité et l'associativité est très fastidieux. Nous commençons par vous le rappeler. `add_left_comm` est un composant clé du premier algorithme que nous expliquerons, mais nous devons d'abord le prouver manuellement. Rappelez-vous que vous pouvez faire des réécritures de commutativité précises avec des choses comme `rw [add_comm b c]`. Et rappelez-vous que `a + b + c` signifie `(a + b) + c`.
it: Ricollocare le variabili manualmente usando la commutatività e l'associatività è un lavoraccio. Ma possiamo fare di meglio. `add_left_comm` è un lemma chiave del primo algoritmo che spiegheremo, ma prima di impiegarlo dobbiamo dimostrarlo. Ricorda che puoi applicare la commutatività precisando le variabili che vuoi scambiare, scrivendo tipo `rw [add_comm b c]`. Ricorda anche che `a + b + c` sta per `(a + b) + c`.
uk: Потреба переставляти змінні вручну за допомогою комутативності та асоціативність дуже нудна. Ми починаємо з нагадування вам про це. `add_left_comm` є ключовим компонентом у першому алгоритмі, як саме ми пояснимо далі, але його нам потрібно довести вручну. Пам’ятайте, що ви можете виконувати точне перезаписування комутативності з такими речами, як `rw [add_comm b c]`. І пам'ятайте що `a + b + c` означає `(a + b) + c`.
zh: 我们首先提醒您一点，手动使用交换律和结合律来重新排列变量是非常繁琐的。 `add_left_comm` 是我们将要解释的第一个算法中的关键组件，但我们需要手动证明它。 请记住，您可以使用 `rw [add_comm b c]` 之类的命令进行精确的交换律重写。并记住 `a + b + c` 表示 `(a + b) + c`。

source: If $a, b, c$ are numbers, then $a+(b+c)=b+(a+c)$.
fr: Si $a, b, c$ sont des nombres, alors $a+(b+c)=b+(a+c)$.
it: Se $a, b, c$ sono dei numeri, allora $a+(b+c)=b+(a+c)$.
uk: Якщо $a, b, c$ - числа, то $a+(b+c)=b+(a+c)$.
zh: 如果 $a, b, c$ 是自然数，那么 $a+(b+c)=b+(a+c)$。

source: making life easier
fr: rendre la vie plus facile
it: semplifichiamoci la vita
uk: зробимо життя легшим
zh: 让生活更轻松

source: In some later worlds, we're going to see some much nastier levels, like `(a + a + 1) + (b + b + 1) = (a + b + 1) + (a + b + 1)`. Brackets need to be moved around, and variables need to be swapped. In this level, `(a + b) + (c + d) = ((a + c) + d) + b`, let's forget about the brackets and just think about the variable order. To turn `a+b+c+d` into `a+c+d+b` we need to swap `b` and `c`, and then swap `b` and `d`. But this is easier than you think with `add_left_comm`.
fr: Dans certains mondes ultérieurs, nous verrons des niveaux bien plus désagréables, comme `(a + a + 1) + (b + b + 1) = (a + b + 1) + (a + b + 1)`. Les parenthèses doivent être déplacées et les variables échangées. Dans ce niveau, `(a + b) + (c + d) = ((a + c) + d) + b`, oublions les parenthèses et pensons simplement à l'ordre des variables. Pour transformer `a+b+c+d` en `a+c+d+b`, nous devons échanger `b` et `c`, puis échanger `b` et `d`. Mais c'est plus facile que vous ne le pensez avec `add_left_comm`.
it: Nei mondi successivi ci sono livelli molto più brutti come `(a + a + 1) + (b + b + 1) = (a + b + 1) + (a + b + 1)`. Qui le parentesi vanno spostate, e le variabili vanno scambiate tra di loro. In questo livello, `(a + b) + (c + d) = ((a + c) + d) + b`, dimentichiamoci delle parentesi e concentriamoci solamente sull'ordine delle variabili. Per portare `a+b+c+d` a `a+c+d+b` dobbiamo scambiare `b` con `c`, e poi scambiare `b` con `d`. Questo è più facile di quanto pensi tramite `add_left_comm`.
uk: У деяких подальших світах ми побачимо набагато жахливіші рівні, наприклад `(a + a + 1) + (b + b + 1) = (a + b + 1) + (a + b + 1)`. Дужки потрібно пересунути, а змінні поміняти місцями. На цьому рівні `(a + b) + (c + d) = ((a + c) + d) + b`, давайте забудемо про дужки і просто подумаємо про порядок змінних. Щоб перетворити `a+b+c+d` на `a+c+d+b`, нам потрібно поміняти місцями `b` і `c`, а потім поміняйте `b` і `d`. Але це легше, ніж вам здається із `add_left_comm`.
zh: 在一些后续的世界中，我们将看到一些更棘手的关卡，比如 `(a + a + 1) + (b + b + 1) = (a + b + 1) + (a + b + 1)`。需要移动括号，还需要交换变量。 在这个关卡中，`(a + b) + (c + d) = ((a + c) + d) + b`，让我们忘掉括号，只考虑变量的顺序。 要将 `a+b+c+d` 转换成 `a+c+d+b`，我们需要交换 `b` 和 `c`，然后交换 `b` 和 `d`。但是使用 `add_left_comm` 比你想象的要简单。

source: If $a, b$, $c$ and $d$ are numbers, we have $(a + b) + (c + d) = ((a + c) + d) + b.$
fr: Si $a, b$, $c$ et $d$ sont des nombres, nous avons $(a + b) + (c + d) = ((a + c) + d) + b.$
it: Se $a, b$, $c$ e $d$ sono numeri, si ha che $(a + b) + (c + d) = ((a + c) + d) + b.$
uk: Якщо $a, b$, $c$ і $d$ є числами, ми маємо $(a + b) + (c + d) = ((a + c) + d) + b.$
zh: 如果 $a, b$、$c$ 和 $d$ 是自然数，我们有 $(a + b) + (c + d) = ((a + c) + d) + b.$

source: Start with `repeat rw [add_assoc]` to push all the brackets to the right.
fr: Commencez par `repeat rw [add_assoc]` pour pousser toutes les parenthèses vers la droite.
it: Inizia con `repeat rw [add_assoc]` per portare tutte le parentesi a destra.
uk: Почніть із `repeat rw [add_assoc]`, щоб перемістити всі дужки вправо.
zh: 从 `repeat rw [add_assoc]` 开始，将所有的括号推到右边。

source: Now use `rw [add_left_comm b c]` to switch `b` and `c` on the left hand side.
fr: Utilisez maintenant `rw [add_left_comm b c]` pour échanger `b` et `c` du côté gauche.
it: Ora fai `rw [add_left_comm b c]` per scambiare `b` con `c` a sinistra dell'uguale.
uk: Тепер використовуйте `rw [add_left_comm b c]`, щоб поміняти `b` і `c` з лівого боку.
zh: 现在使用 `rw [add_left_comm b c]` 将左侧的 `b` 和 `c` 交换。

source: Finally use a targetted `add_comm` to switch `b` and `d`
fr: Enfin, utilisez un `add_comm` ciblé pour échanger `b` et `d`
it: Infine fai un rewrite mirato di `add_comm` per scambiare `b` con `d`
uk: Нарешті використовуйте націлений `add_comm`, щоб переключити `b` і `d`
zh: 最后，使用有针对性的 `add_comm` 来交换 `b` 和 `d

source: So that's the algorithm: now let's use automation to perform it automatically.
fr: Voilà donc l'algorithme : utilisons maintenant l'automatisation pour l'exécuter automatiquement.
it: Questo è l'algoritmo: ora cerchiamo di automatizzarlo con l'automazione di Lean.
uk: Ось алгоритм: давайте використаємо автоматизацію для його автоматичного виконання.
zh: 所以这就是算法：现在让我们使用机器来自动执行它。

source: making life simple
fr: rendre la vie simple
it: semplifichiamoci la vita
uk: зробимо життя простим
zh: 让生活变得简单

source: # Overview Lean's simplifier, `simp`, will rewrite every lemma tagged with `simp` and every lemma fed to it by the user, as much as it can. Furthermore, it will attempt to order variables into an internal order if fed lemmas such as `add_comm`, so that it does not go into an infinite loop.
fr: # Aperçu Le simplificateur de Lean, `simp`, réécrira chaque lemme marqué `simp` et chaque lemme fourni par l'utilisateur, autant que possible. De plus, il tentera d'ordonner les variables dans un ordre interne si on lui donne des lemmes comme `add_comm`, afin de ne pas tomber dans une boucle infinie.
it: # Overview Il semplificatore di Lean, `simp`, riscriverà ogni lemma con il tag `simp` e ogni lemma dato dall'utente, finché può. Non solo, cercherà di ordinare le variabili secondo la sua logica interna affinché non entri in un loop infinito quando utilizza lemmi come `add_comm`
uk: # Огляд Спрощувач Lean, `simp`, перепише кожну лему з тегом `simp` і кожну лему, надану користувачем, настількі, наскільки це можливо. Крім того, він намагатиметься впорядкувати змінні у внутрішньому порядку, якщо йому буде скормлено леми, такі як `add_comm`, щоб він не перейшов в нескінченний цикл.
zh: ## 概述 Lean 的简化器 `simp` 将它将用每个用户提供给它的引理 以及所有标记为 `simp` 的引理重写目标。 此外，如果提供了如`add_comm`这样的引理，它将尝试将对变量排序，以避免陷入无限循环。

source: Lean's simplifier, `simp`, is "`rw` on steroids". It will rewrite every lemma tagged with `simp` and every lemma fed to it by the user, as much as it can. This level is not a level which you want to solve by hand. Get the simplifier to solve it for you.
fr: Le simplificateur de Lean, `simp`, est "`rw` sous stéroïdes". Il réécrira chaque lemme marqué `simp` et chaque lemme fourni par l'utilisateur, autant que possible. Ce n'est pas un niveau que vous voulez résoudre à la main. Demandez au simplificateur de le résoudre pour vous.
it: Il semplificatore Lean, `simp`, può essere considerato una versione dopata di `rw`. Esso riscriverà ogni lemma taggato `simp` e ogni lemma passato dall'utente fin tanto c'è qualcosa da riscrivere, più che può. Questo è un livello che non vorresti risolvere a mano. Fai fare il lavoro sporco al semplificatore.
uk: Спрощувач Lean, `simp`, це "`rw` на стероїдах". Він перепише кожну лему з тегом `simp` і кожною лемою, наданою користувачем, наскільки це можливо. Цей рівень не є рівнем, який ви хочете вирішити вручну. Візьміть спрощувач, щоб він вирішити рівень за вас.
zh: Lean 的简化器 `simp` 是加强版的 `rw` 。它将用每个用户提供给它的引理 以及所有标记为 `simp` 的引理重写目标。 这个关卡不是能轻松手动解决的关卡。 使用简化器来为解决这个问题。

source: If $a, b,\ldots h$ are arbitrary natural numbers, we have $(d + f) + (h + (a + c)) + (g + e + b) = a + b + c + d + e + f + g + h$.
fr: Si $a, b,\ldots h$ sont des nombres naturels arbitraires, nous avons $(d + f) + (h + (a + c)) + (g + e + b) = a + b + c + d + e + f + g + h$.
it: Se $a, b,\ldots h$ sono numeri naturali qualsiasi, si ha che $(d + f) + (h + (a + c)) + (g + e + b) = a + b + c + d + e + f + g + h$.
uk: Якщо $a, b,\ldots h$ довільні натуральні числа, ми маємо $(d + f) + (h + (a + c)) + (g + e + b) = a + b + c + d + e + f + g + h$.
zh: 如果 $a, b,\ldots h$ 是任意自然数，我们有 $(d + f) + (h + (a + c)) + (g + e + b) = a + b + c + d + e + f + g + h$。

source: Solve this level in one line with `simp only [add_assoc, add_left_comm, add_comm]`
fr: Résolvez ce niveau en une ligne avec `simp only [add_assoc, add_left_comm, add_comm]`
it: Completa questo livello in un'unica riga con `simp only [add_assoc, add_left_comm, add_comm]`
uk: Вирішіть цей рівень одним рядком за допомогою `simp only [add_assoc, add_left_comm, add_comm]`
zh: 用 `simp only [add_assoc, add_left_comm, add_comm]` 在一行中证明这一关

source: Let's now make our own tactic to do this.
fr: Créons maintenant notre propre tactique pour faire cela.
it: Ora creiamo la nostra tattica per fare qualcosa di simile.
uk: Давайте зробимо власну тактику для цього.
zh: 现在让我们制定自己的策略来做到这一点。

source: the simplest approach
fr: l'approche la plus simple
it: l'approccio più semplice
uk: найпростіший підхід
zh: 最简单的方法

source: # Overview Our home-made tactic `simp_add` will solve arbitrary goals of the form `a + (b + c) + (d + e) = e + (d + (c + b)) + a`.
fr: # Aperçu Notre tactique maison `simp_add` résoudra tout but de la forme `a + (b + c) + (d + e) = e + (d + (c + b)) + a`.
it: # Overview La nostra tattica casalinga `simp_add` risolverà qualsiasi goal del tipo `a + (b + c) + (d + e) = e + (d + (c + b)) + a`.
uk: # Огляд Наша саморобна тактика `simp_add` вирішить довільні цілі у формі `a + (b + c) + (d + e) = e + (d + (c + b)) + a`.
zh: ## 概述 我们自制的策略 `simp_add` 将解决以下形式的任意目标： `a + (b + c) + (d + e) = e + (d + (c + b)) + a`。

source: You can make your own tactics in Lean. This code here ``` macro "simp_add" : tactic => `(tactic|( simp only [add_assoc, add_left_comm, add_comm])) ``` was used to create a new tactic `simp_add`, which runs `simp only [add_assoc, add_left_comm, add_comm]`. Try running `simp_add` to solve this level!
fr: Vous pouvez créer vos propres tactiques dans Lean. Ce code ci-dessous ``` macro "simp_add" : tactic => `(tactic|( simp only [add_assoc, add_left_comm, add_comm])) ``` a été utilisé pour créer une nouvelle tactique `simp_add`, qui exécute `simp only [add_assoc, add_left_comm, add_comm]`. Essayez d'exécuter `simp_add` pour résoudre ce niveau !
it: Puoi creare le tue tattiche personalizzate su Lean. Con questo codice ``` macro "simp_add" : tattica => `(tattica|( simp only [add_assoc, add_left_comm, add_comm])) ``` abbiamo creato la nuova tattica `simp_add`, che esegue `simp only [add_assoc, add_left_comm, add_comm]`. Prova ad eseguire `simp_add` per risolvere questo livello!
uk: Ви можете створити власні тактики в Lean. Цей код нижче ``` macro "simp_add" : tactic => `(tactic|( simp only [add_assoc, add_left_comm, add_comm])) ``` було використано для створення нової тактики `simp_add`, яка запускає `simp only [add_assoc, add_left_comm, add_comm]`. Спробуйте запустити `simp_add`, щоб вирішити цей рівень!
zh: 你可以在 Lean 中创建自己的策略。 这里的代码 ``` macro "simp_add" : tactic => `(tactic|( simp only [add_assoc, add_left_comm, add_comm])) ``` 被用来创建一个新的策略 `simp_add`，它会执行 `simp only [add_assoc, add_left_comm, add_comm]`。 尝试运行 `simp_add` 来解决这个关卡！

source: Let's now move on to a more efficient approach to questions involving numerals, such as `20 + 20 = 40`.
fr: Passons maintenant à une approche plus efficace pour les questions impliquant des nombres, comme `20 + 20 = 40`.
it: Adesso vediamo un metodo più efficiente per risolvere i lemmi che contengono numeri, come `20 + 20 = 40`.
uk: Тепер перейдемо до більш ефективного підходу до питань за участю чисел, наприклад `20 + 20 = 40`.
zh: 现在让我们转向更有效的 涉及数字问题的方法，例如证明 `20 + 20 = 40`。

source: We now start work on an algorithm to do addition more efficiently. Recall that we defined addition by recursion, saying what it did on `0` and successors. It is an axiom of Lean that recursion is a valid way to define functions from types such as the naturals. Let's define a new function `pred` from the naturals to the naturals, which attempts to subtract 1 from the input. The definition is this: ``` pred 0 := 37 pred (succ n) := n ``` We cannot subtract one from 0, so we just return a junk value. As well as this definition, we also create a new lemma `pred_succ`, which says that `pred (succ n) = n`. Let's use this lemma to prove `succ_inj`, the theorem which Peano assumed as an axiom and which we have already used extensively without justification.
fr: Nous commençons maintenant à travailler sur un algorithme pour faire l'addition plus efficacement. Rappelons que nous avons défini l'addition par une formule de récurrence, en disant ce qu'elle fait sur `0` et les successeurs. C'est un axiome de Lean que la récursion est une manière valide de définir des fonctions à partir de types comme les naturels. Définissons une nouvelle fonction `pred` des naturels vers les naturels, qui tente de soustraire 1 de l'entrée. La définition est : ``` pred 0 := 37 pred (succ n) := n ``` Nous ne pouvons pas soustraire un de 0, donc nous renvoyons simplement une valeur quelconque. En plus de cette définition, nous créons également un nouveau lemme `pred_succ`, qui dit que `pred (succ n) = n`. Utilisons ce lemme pour prouver `succ_inj`, le théorème que Peano a supposé comme axiome et que nous avons déjà largement utilisé sans justification.
it: Ora svilupperemo un algoritmo che ci permette di svolgere le addizioni in maniera più efficiente. Se ricordi, abbiamo definito l'addizione tramite la ricorsione, definendo il suo comportamento su `0` e sul successore. Uno degli assiomi di Lean dice proprio che la ricorsione è un metodo valido per definire funzioni su tipi di dato induttivi, come i numeri naturali. Definiamo una nuova funzione `pred` dai naturali ai naturali, che tenta di sottrarre 1 dall'input. La definizione è la seguente: ``` pred 0 := 37 pred (succ n) := n ``` Non potendo sottrarre uno da 0, in tal caso restituiamo un valore spazzatura. In aggiunta a questa definizione, creiamo un nuovo lemma `pred_succ` che dice `pred (succ n) = n`. Usiamo subito questo lemma per dimostrare `succ_inj`, il teorema che Peano postulò come assioma e che abbiamo usato estensivamente finora senza mai motivarlo.
uk: Тепер ми починаємо роботу над алгоритмом для більш ефективної роботи із додаванням. Згадайте що ми визначили додавання за допомогою рекурсії, сказавши, що воно робить при `0` і при наступниках. Це аксіома Lean, що рекурсія є дійсною спосіб визначення функцій із типів, таких як натуральні числа. Давайте визначимо нову функцію `pred` із натуральних в натуральні, яка намагається відняти 1 із вхідних даних. Визначення таке: ``` pred 0 := 37 pred (succ n) := n ``` Ми не можемо відняти одиницю від 0, тому ми просто повертаємо мусорне значення. Як і це визначення, ми також створюємо нову лему `pred_succ`, яка говорить, що `pred (succ n) = n`. Скористаємося цією лемою, щоб довести `succ_inj`, теорему яку Пеано вважав за аксіому, і яку ми вже широко використовували без пояснення.
zh: 我们现在开始研究一个更高效进行加法计算的算法。回想一下，我们通过递归定义了加法，说明了它对 `0` 和后继者的作用。Lean 的一个公理是递归是从像自然数这样的类型定义函数的有效方式。 让我们定义一个从自然数到自然数的新函数 `pred`，它试图从输入中减去 1。定义如下： ``` pred 0 := 37 pred (succ n) := n ``` 我们不能从 0 中减去 1，所以我们只是返回一个无用的值。除了这个定义之外，我们还创建了一个新的引理 `pred_succ`，它说 `pred (succ n) = n`。让我们使用这个引理来证明 `succ_inj`，这是皮亚诺假设为公理的定理，我们在没有证明它的情况下已经广泛使用了。

source: `pred_succ n` is a proof of `pred (succ n) = n`.
fr: `pred_succ n` est une preuve de `pred (succ n) = n`.
it: `pred_succ n` è la dimostrazione di `pred (succ n) = n`.
uk: `pred_succ n` є доказом `pred (succ n) = n`.
zh: `pred_succ n` 是 `pred (succ n) = n` 的证明。

source: If $\operatorname{succ}(a)=\operatorname{succ}(b)$ then $a=b$.
fr: Si $\operatorname{succ}(a)=\operatorname{succ}(b)$ alors $a=b$.
it: Se $\operatorname{succ}(a)=\operatorname{succ}(b)$ allora $a=b$.
uk: Якщо $\operatorname{succ}(a)=\operatorname{succ}(b)$, тоді $a=b$.
zh: 如果 $\operatorname{succ}(a)=\operatorname{succ}(b)$ 那么 $a=b$。

source: Start with `rw [← pred_succ a]` and take it from there.
fr: Commencez par `rw [← pred_succ a]` et continuez à partir de là.
it: Inizia con `rw [← pred_succ a]` e prosegui da solo.
uk: Почніть із `rw [← pred_succ a]` і продовжіть звідти.
zh: 从 `rw [← pred_succ a]` 开始，然后再继续。

source: Nice! You've proved `succ_inj`! Let's now prove Peano's other axiom, that successors can't be $0$.
fr: Bien ! Vous avez prouvé `succ_inj` ! Prouvons maintenant l'autre axiome de Peano, que les successeurs ne peuvent pas être $0$.
it: Bene! Hai dimostrato `succ_inj`! Ora dimostriamo l'altro assioma di Peano, ossia che un successore non può essere $0$.
uk: Гарно! Ви довели `succ_inj`! Давайте тепер доведемо іншу аксіому Пеано, що наступники не можуть бути $0$.
zh: 好的！您已经证明了 `succ_inj`！ 现在让我们证明皮亚诺的另一个公理，后继数不可能是 $0$。
