Repository: leanprover-community/NNG4
Catalog: .i18n/*/Game.po
Languages: fr, it, uk, zh

source: `le_refl x` is a proof of `x ≤ x`. The reason for the name is that this lemma is "reflexivity of $\le$"
fr: `le_refl x` est une preuve de `x ≤ x`. La raison du nom est que ce lemme est "la réflexivité de $\le$"
it: `le_refl x` è la dimostrazione di `x ≤ x`. Il nome di questo lemma deriva da "reflexivity of $\le$", dove "le" è l'abbreviazione tipica di "less than or equal" (minore o uguale)
uk: `le_refl x` є доказом `x ≤ x`. Причина такої назви полягає в тому, що ця лема означає «рефлексивність $\le$»
zh: `le_refl x` 是 `x ≤ x` 的证明。 这个引理是 “$\le$ 的自反性” 因此这么命名 。

source: If $x$ is a number, then $x \le x$.
fr: Si $x$ est un nombre, alors $x \le x$.
it: Se $x$ è un numero, allora $x \le x$.
uk: Якщо $x$ є числом, то $x \le x$.
zh: 如果 $x$ 是数字，那么 $x \le x$。

source: The reason `«{x}» ≤ «{x}»` is because `«{x}» = «{x}» + 0`. So you should start this proof with `use 0`.
fr: La raison pour laquelle `«{x}» ≤ «{x}»` est que `«{x}» = «{x}» + 0`. Vous devriez donc commencer cette preuve par `use 0`.
it: La ragione per cui `«{x}» ≤ «{x}»` è perché `«{x}» = «{x}» + 0`. Dunque dovresti aprire la dimostrazione con `use 0`.
uk: Причина `«{x}» ≤ «{x}»` полягає в тому, що `«{x}» = «{x}» + 0`. Отже, ви повинні почати це доведення з `use 0`.
zh: 因为 `«{x}» = «{x}» + 0`，所以`«{x}» ≤ «{x}»` 。 所以你应该用 `use 0` 开始这个证明。

source: You can probably take it from here.
fr: Vous pouvez probablement continuer à partir d'ici.
it: Prova a proseguire da solo.
uk: Ймовірно, ви можете продовжити звідси.
zh: 你可以从这里开始。

source: To solve this level, you need to `use` a number `c` such that `x = 0 + c`.
fr: Pour résoudre ce niveau, vous devez utiliser `use` un nombre `c` tel que `x = 0 + c`.
it: Per risolvere questo livello, dovrai chiamare `use` su un numero `c` tale che `x = 0 + c`.
uk: Щоб розв’язати цей рівень, вам потрібно `use` таке число `c`, щоб `x = 0 + c`.
zh: 要通过本关卡，您需要 `use` 一个数字 `c` 使得 `x = 0 + c`。

source: `zero_le x` is a proof that `0 ≤ x`.
fr: `zero_le x` est une preuve que `0 ≤ x`.
it: `zero_le x` è la dimostrazione che `0 ≤ x`.
uk: `zero_le x` є доказом того, що `0 ≤ x`.
zh: `zero_le x` 是 `0 ≤ x` 的证明。

source: If $x$ is a number, then $0 \le x$.
fr: Si $x$ est un nombre, alors $0 \le x$.
it: Se $x$ è un numero, allora $0 \le x$.
uk: Якщо $x$ є числом, тоді $0 \le x$.
zh: 如果 $x$ 是自然数，则 $0 \le x$。

source: `le_succ_self x` is a proof that `x ≤ succ x`.
fr: `le_succ_self x` est une preuve que `x ≤ succ x`.
it: `le_succ_self x` è la dimostrazione che `x ≤ succ x`.
uk: `le_succ_self x` є доказом того, що `x ≤ succ x`.
zh: `le_succ_self x` 是 `x ≤ succ x` 的证明。

source: If you `use` the wrong number, you get stuck with a goal you can't prove. What number will you `use` here?
fr: Si vous utiliser `use` avec le mauvais nombre, vous restez bloqué avec un but que vous ne pourrez pas prouver. Quel nombre allez-vous choisir ici ?
it: Se applichi `use` su un numero errato, rimarrai bloccato con un goal non dimostrabile. Su che numero applicherai `use` qui?
uk: Якщо ви `use` неправильне число, ви застрягнете з метою, яку не зможете довести. Яке число ви за-`use`-аєте тут?
zh: 如果你使用错误的数字，你将卡在一个无法证明的目标中。 你将在这里使用哪个数字？

source: If $x$ is a number, then $x \le \operatorname{succ}(x)$.
fr: Si $x$ est un nombre, alors $x \le \operatorname{succ}(x)$.
it: Sia $x$ un numero, allora $x \le \operatorname{succ}(x)$.
uk: Якщо $x$ є числом, то $x \le \operatorname{succ}(x)$.
zh: 如果 $x$ 是自然数，则 $x \le \operatorname{succ}(x)$。

source: Here's a two-liner: ``` use 1 exact succ_eq_add_one x ``` This works because `succ_eq_add_one x` is a proof of `succ x = x + 1`.
fr: Voici une solution en deux lignes : ``` use 1 exact succ_eq_add_one x ``` Cela fonctionne car `succ_eq_add_one x` est une preuve de `succ x = x + 1`.
it: Ecco una dimostrazione di due righe: ``` use 1 exact succ_eq_add_one x ``` Questo funziona perché `succ_eq_add_one x` è la dimostrazione di `succ x = x + 1`.
uk: Ось два рядки: ``` use 1 exact succ_eq_add_one x ``` Це працює, оскільки `succ_eq_add_one x` є доказом `succ x = x + 1`.
zh: 这是两行的证明： ``` use 1 exact succ_eq_add_one x ``` 这是有效的，因为 `succ_eq_add_one x` 是 `succ x = x + 1` 的证明。

source: x ≤ y and y ≤ z implies x ≤ z
fr: x ≤ y et y ≤ z implique x ≤ z
it: x ≤ y e y ≤ z implica x ≤ z
uk: x ≤ y і y ≤ z означає x ≤ z
zh: x ≤ y 且 y ≤ z 意味着 x ≤ z

source: `le_trans x y z` is a proof that if `x ≤ y` and `y ≤ z` then `x ≤ z`. More precisely, it is a proof that `x ≤ y → (y ≤ z → x ≤ z)`. In words, If $x \le y$ then (pause) if $y \le z$ then $x \le z$. ## A note on associativity In Lean, `a + b + c` means `(a + b) + c`, because `+` is left associative. However `→` is right associative. This means that `x ≤ y → y ≤ z → x ≤ z` in Lean means exactly that `≤` is transitive. This is different to how mathematicians use $P \implies Q \implies R$; for them, this usually means that $P \implies Q$ and $Q \implies R$.
fr: `le_trans x y z` est une preuve que si `x ≤ y` et `y ≤ z` alors `x ≤ z`. Plus précisément, c'est une preuve que `x ≤ y → (y ≤ z → x ≤ z)`. En français, Si $x \le y$ alors (pause) si $y \le z$ alors $x \le z$. ## Note sur l'associativité Dans Lean, `a + b + c` signifie `(a + b) + c`, car `+` est associatif à gauche. Cependant `→` est associatif à droite. Cela signifie que dans Lean `x ≤ y → y ≤ z → x ≤ z` signifie exactement que `≤` est transitive. C'est différent de la façon dont les mathématiciens utilisent $P \implies Q \implies R$ ; pour eux, cela signifie généralement que $P \implies Q$ et $Q \implies R$.
it: `le_trans x y z` è la dimostrazione che se `x ≤ y` e `y ≤ z` allora `x ≤ z`. Riscritto in termini logici, è la dimostrazione che `x ≤ y → (y ≤ z → x ≤ z)`. Questa formula si legge ad alta voce così: Se $x \le y$ allora (pausa) se $y \le z$ allora $x \le z$. ## Nota sull'associatività Come sai già, in Lean `a + b + c` sta per `(a + b) + c`, dato che `+` associa a sinistra. Invece l'implicazione `→` associa a destra. Dunque su Lean possiamo scrivere direttamente `x ≤ y → y ≤ z → x ≤ z`, che codifica proprio la proprietà transitiva di `≤`. Attenzione però, in quanto a volte i matematici interpretano le sequenze di `→` diversamente; per alcuni, $P \implies Q \implies R$ si traduce nella congiunzione $P \implies Q$ e $Q \implies R$.
uk: `le_trans x y z` є доказом того, що якщо `x ≤ y` і `y ≤ z`, то `x ≤ z`. Точніше, це доказ того, що `x ≤ y → (y ≤ z → x ≤ z)`. Словами, якщо $x \le y$ тоді (пауза) якщо $y \le z$ тоді $x \le z$. ## Пам'ятка про асоціативність У Lean `a + b + c` означає `(a + b) + c`, тому що `+` є лівим асоціативним. Проте `→` є правоасоціативним. Це означає, що `x ≤ y → y ≤ z → x ≤ z` в Lean означає саме те, що `≤` є транзитивним. Це відрізняється від того, як використовують математики $P \implies Q \implies R$; для них це зазвичай означає, що $P \implies Q$ і $Q \implies R$.
zh: `le_trans x y z` 证明了如果 `x ≤ y` 和 `y ≤ z` 那么 `x ≤ z`。 更确切地说，它是 `x ≤ y → (y ≤ z → x ≤ z)` 的证明。换句话说 If $x \le y$ then (pause) if $y \le z$ then $x \le z$. ## 关于关联性的说明 在 Lean 中，`a + b + c` 表示 `(a + b) + c`，因为 `+` 是左关联。但是 `→` 是右关联式。这意味着Lean中的 `x ≤ y → y ≤ z → x ≤ z` 表示 `≤` 是传递式的。这与数学家使用 $P\implies Q\implies R$ 的用法不同；对他们来说，这通常意味着 $P\implies Q$ 和 $Q\implies R$。

source: In this level, we see inequalities as *hypotheses*. We have not seen this before. The `cases` tactic can be used to take `hxy` apart.
fr: Dans ce niveau, nous voyons des inégalités comme *hypothèses*. Nous n'avons pas vu cela auparavant. La tactique `cases` peut être utilisée pour décomposer `hxy`.
it: In questo livello, abbiamo delle disuguaglianze tra le *ipotesi*. Non abbiamo ancora visto questo caso. La tattica `cases` può essere usata per scomporre l'ipotesi `hxy`.
uk: На цьому рівні ми розглядаємо нерівності як *гіпотези*. Такого ми ще не бачили. Тактику `cases` можна використати, щоб розібрати `hxy` на частини.
zh: 在本关，我们将不等视为 *假设* 。我们以前没有见过这个。 `cases` 策略可用于拆解 `hxy` 假设。

source: If $x \leq y$ and $y \leq z$, then $x \leq z$.
fr: Si $x \leq y$ et $y \leq z$, alors $x \leq z$.
it: Se $x \leq y$ e $y \leq z$, allora $x \leq z$.
uk: Якщо $x \leq y$ і $y \leq z$, то $x \leq z$.
zh: 如果 $x \leq y$ 且 $y \leq z$，那么 $x \leq z$。

source: Start with `cases «{hxy}» with a ha`.
fr: Commencez par `cases «{hxy}» with a ha`.
it: Inizia con `cases «{hxy}» with a ha`.
uk: Почніть із `cases «{hxy}» with a ha`.
zh: 从 `cases «{hxy}» with a ha` 开始。

source: Now `«{ha}»` is a proof that `«{y}» = «{x}» + «{a}»`, and `hxy` has vanished. Similarly, you can destruct `«{hyz}»` into its parts with `cases «{hyz}» with b hb`.
fr: Maintenant `«{ha}»` est une preuve que `«{y}» = «{x}» + «{a}»`, et `hxy` a disparu. De même, vous pouvez décomposer `«{hyz}»` avec `cases «{hyz}» with b hb`.
it: Ora `«{ha}»` è una dimostrazione di `«{y}» = «{x}» + «{a}»`, mentre `hxy` è scomparso. In modo simile, puoi scomporre `«{hyz}»` nelle sue varie parti tramite `cases «{hyz}» with b hb`.
uk: Тепер `«{ha}»` є доказом того, що `«{y}» = «{x}» + «{a}»`, а `hxy` зник. Так само можна розібрати `«{hyz}»` на частини із `cases «{hyz}» with b hb`.
zh: 现在 `«{ha}»` 是 `«{y}» = «{x}» + «{a}»`, 的证明，而 `hxy` 已经消失了。同样，你可以通过 `cases «{hyz}» with b hb` 将 `«{hyz}»` 分解。

source: Now you need to figure out which number to `use`. See if you can take it from here.
fr: Maintenant, vous devez déterminer quel nombre `use`. Voyez si vous pouvez continuer à partir d'ici.
it: Ora devi individuare il numero su cui applicare `use`. Fai un tentativo!
uk: Тепер вам потрібно визначити, яке число `use`-ати. Подивіться, чи можете продовжити звідси.
zh: 现在你需要弄清楚使用（ `use` ）哪个数字。看看你是否可以从这里继续。

source: A passing mathematician remarks that with reflexivity and transitivity out of the way, you have proved that `≤` is a *preorder* on `ℕ`.
fr: Un mathématicien de passage remarque qu'avec la réflexivité et la transitivité, vous avez prouvé que `≤` est un *préordre* sur `ℕ`.
it: Un matematico di passaggio ti fa notare che avendo dimostrato le proprietà riflessiva e transitiva, hai dimostrato che `≤` è un *preordine* su `ℕ`.
uk: Математик, який проходив повз, зауважує, що, коли рефлексивність і транзитивність усунені, ви довели, що `≤` є *предпорядок* на `ℕ`.
zh: 一个路过的数学家指出，随着自反性和传递性的解决，你已经证明了 `≤` 是 `ℕ` 上的一个*预序*。

source: `le_zero x` is a proof of `x ≤ 0 → x = 0`.
fr: `le_zero x` est une preuve de `x ≤ 0 → x = 0`.
it: `le_zero x` è la dimostrazione di `x ≤ 0 → x = 0`.
uk: `le_zero x` є доказом `x ≤ 0 → x = 0`.
zh: `le_zero x` 是 `x ≤ 0 → x = 0` 的证明。

source: It's "intuitively obvious" that there are no numbers less than zero, but to prove it you will need a result which you showed in advanced addition world.
fr: C'est "intuitivement évident" qu'il n'y a pas de nombres inférieurs à zéro, mais pour le prouver, vous aurez besoin d'un résultat que vous avez montré dans le monde de l'addition avancée.
it: È "intuitivamente ovvio" che non esistono numeri naturali minori di zero, ma per dimostrarlo dovrai ricorrere a un risultato che abbiamo dimostrato nel mondo Addizione Avanzata.
uk: Це «інтуїтивно очевидно», що не існує чисел, менших за нуль, але щоб довести це вам знадобиться результат, який ви показали в Світі розширеного додавання.
zh: 没有小于零的数，这是 "直觉上显而易见的"、 但是在高级加法世界要你需要证明这一点。

source: `le_zero x` is a proof of the implication `x ≤ 0 → x = 0`.
fr: `le_zero x` est une preuve de l'implication `x ≤ 0 → x = 0`.
it: `le_zero x` è la dimostrazione dell'implicazione `x ≤ 0 → x = 0`.
uk: `le_zero x` є доказом імплікації `x ≤ 0 → x = 0`.
zh: `le_zero x` 是一个蕴含式 `x ≤ 0 → x = 0` 的证明。

source: If $x \leq 0$, then $x=0$.
fr: Si $x \leq 0$, alors $x=0$.
it: Se $x \leq 0$, allora $x=0$.
uk: Якщо $x \leq 0$, то $x=0$.
zh: 如果是 $x \leq 0$，那么 $x=0$。

source: You want to use `add_right_eq_zero`, which you already proved, but you'll have to start with `symm at` your hypothesis.
fr: Vous voulez utiliser `add_right_eq_zero`, que vous avez déjà prouvé, mais vous devrez commencer par `symm at` votre hypothèse.
it: Qui è opportuno usare `add_right_eq_zero`, che hai già dimostrato, ma prima dovrai applicare `symm at` su un'ipotesi.
uk: Ви хочете використовувати `add_right_eq_zero`, який ви вже довели, але вам доведеться почати з `symm at` вашої гіпотези.
zh: 你想使用 `add_right_eq_zero`，这是你已经证明过的，但你需要从对你的假设使用 `symm at` 开始。

source: x ≤ y and y ≤ x implies x = y
fr: x ≤ y et y ≤ x implique x = y
it: x ≤ y e y ≤ x implica x = y
uk: Із x ≤ y і y ≤ x випливає, що x = y
zh: x ≤ y 且 y ≤ x 意味着 x = y

source: `le_antisymm x y` is a proof that if `x ≤ y` and `y ≤ x` then `x = y`.
fr: `le_antisymm x y` est une preuve que si `x ≤ y` et `y ≤ x` alors `x = y`.
it: `le_antisymm x y` è la dimostrazione che `x ≤ y` e `y ≤ x` implica `x = y`.
uk: `le_antisymm x y` є доказом того, що якщо `x ≤ y` і `y ≤ x`, то `x = y`.
zh: `le_antisymm x y` 是如果 `x ≤ y` 和 `y ≤ x` 则 `x = y` 的证明。

source: This level asks you to prove *antisymmetry* of $\leq$. In other words, if $x \leq y$ and $y \leq x$ then $x = y$. It's the trickiest one so far. Good luck!
fr: Ce niveau vous demande de prouver l'*antisymétrie* de $\leq$. Autrement dit, si $x \leq y$ et $y \leq x$ alors $x = y$. C'est le plus délicat jusqu'à présent. Bonne chance !
it: Questo livello ti chiede di dimostrare la proprietà *antisimmetrica* di $\leq$. In formula, se $x \leq y$ e $y \leq x$ allora $x = y$. È forse la più complicata tra quelle affrontate finora. Buona fortuna!
uk: На цьому рівні вам потрібно довести *антисиметричність* $\leq$. Іншими словами, якщо $x \leq y$ і $y \leq x$, то $x = y$. Це найскладніше завдання наразі. Удачі!
zh: 这一关卡要求你证明 $\leq$ 的 *反对称性* 。换句话说，如果 $x \leq y$ 且 $y \leq x$，那么 $x = y$。 这是本游戏到目前最棘手的证明之一。祝你好运！

source: If $x \leq y$ and $y \leq x$, then $x = y$.
fr: Si $x \leq y$ et $y \leq x$, alors $x = y$.
it: Se $x \leq y$ e $y \leq x$, allora $x = y$.
uk: Якщо $x \leq y$ і $y \leq x$, то $x = y$.
zh: 如果 $x \leq y$ 且 $y \leq x$，则 $x = y$。

source: Here's my proof: ``` cases hxy with a ha cases hyx with b hb rw [ha] rw [ha, add_assoc] at hb symm at hb apply add_right_eq_self at hb apply add_right_eq_zero at hb rw [hb, add_zero] rfl ``` A passing mathematician remarks that with antisymmetry as well, you have proved that `≤` is a *partial order* on `ℕ`. The boss level of this world is to prove that `≤` is a total order. Let's learn two more easy tactics first.
fr: Voici ma preuve : ``` cases hxy with a ha cases hyx with b hb rw [ha] rw [ha, add_assoc] at hb symm at hb apply add_right_eq_self at hb apply add_right_eq_zero at hb rw [hb, add_zero] rfl ``` Un mathématicien de passage remarque qu'avec l'antisymétrie aussi, vous avez prouvé que `≤` est un *ordre partiel* sur `ℕ`. Le niveau boss de ce monde est de prouver que `≤` est un ordre total. Apprenons d'abord deux autres tactiques faciles.
it: Ecco la mia dimostrazione: ``` cases hxy with a ha cases hyx with b hb rw [ha] rw [ha, add_assoc] at hb symm at hb apply add_right_eq_self at hb apply add_right_eq_zero at hb rw [hb, add_zero] rfl ``` Un matematico di passaggio ti fa notare che con l'aggiunta dell'antisimmetria, hai dimostrato che `≤` è un *ordine parziale* su `ℕ`. Il livello boss di questo mondo consiste nel dimostrare che `≤` è un ordine totale. Prima di affrontarlo vediamo altre due tattiche utili.
uk: Ось мій доказ: ``` cases hxy with a ha cases hyx with b hb rw [ha] rw [ha, add_assoc] at hb symm at hb apply add_right_eq_self at hb apply add_right_eq_zero at hb rw [hb, add_zero] rfl ``` Перехожий математик зауважує, що з антисиметрією також, ви довели, що `≤` є *частковим порядком* на `ℕ`. Рівень боса цього світу - довести що `≤` є тотальним порядком. Давайте вивчимо ще дві прості тактики першими.
zh: 这是我的证明： ``` cases hxy with a ha cases hyx with b hb rw [ha] rw [ha, add_assoc] at hb symm at hb apply add_right_eq_self at hb apply add_right_eq_zero at hb rw [hb, add_zero] rfl ``` 一位路过的数学家评论说，你已经运用“反对称性”证明了 `≤` 在 `ℕ` 上是一个*偏序*。 这个世界中的 Boss 关卡是证明 `≤` 是一个全序。我们先学习两个更简单的策略。

source: Dealing with `or`
fr: Gérer `or`
it: Come ragionare con `or`
uk: Робота з `or`
zh: 处理 `or`

source: # Summary The `left` tactic changes a goal of `P ∨ Q` into a goal of `P`. Use it when your hypotheses guarantee that the reason that `P ∨ Q` is true is because in fact `P` is true. Internally this tactic is just `apply`ing a theorem saying that $P \implies P \lor Q.$ Note that this tactic can turn a solvable goal into an unsolvable one.
fr: # Résumé La tactique `left` change un but `P ∨ Q` en un but `P`. Utilisez-la lorsque vos hypothèses garantissent que la raison pour laquelle `P ∨ Q` est vrai est qu'en fait `P` est vrai. En interne, cette tactique applique simplement un théorème disant que $P \implies P \lor Q.$ Notez que cette tactique peut transformer un but résoluble en un but insoluble.
it: # Descrizione La tattica `left` trasforma un goal della forma `P ∨ Q` nel nuovo goal `P`. Usala quando le tue ipotesi garantiscono che si può dedurre `P ∨ Q` dalla verità di `P`. L'implementazione di Lean di questa tattica non fa altro che l'`apply` di un teorema che dice $P \implies P \lor Q.$ Nota bene che questa tattica può portare il tuo goal a uno stato irrisolvibile.
uk: # Резюме Тактика `left` змінює мету `P ∨ Q` на мету `P`. Використовуйте її, коли ваші гіпотези гарантують, що причина чому `P ∨ Q` є істинним тому, що насправді `P` є істинним. Внутрішньо ця тактика є лише `apply`-ікацією теореми яка каже що $P \implies P \or Q.$ Зауважте, що ця тактика може перетворити вирішувану мету на нерозв’язувану мету.
zh: ## 概述 `left` 策略将目标 `P ∨ Q` 转换为目标 `P`。当您的假设保证 `P ∨ Q` 为真的原因是由于 `P` 为真时，请使用它。 在内部，这个策略只是应用了一个定理，该定理是 $P\implies P\lor Q$ 。 请注意，此策略可能会将一个可解决的目标转换为不可解决的目标。

source: # Summary The `right` tactic changes a goal of `P ∨ Q` into a goal of `Q`. Use it when your hypotheses guarantee that the reason that `P ∨ Q` is true is because in fact `Q` is true. Internally this tactic is just `apply`ing a theorem saying that $Q \implies P \lor Q.$ Note that this tactic can turn a solvable goal into an unsolvable one.
fr: # Résumé La tactique `right` change un but `P ∨ Q` en un but `Q`. Utilisez-la lorsque vos hypothèses garantissent que la raison pour laquelle `P ∨ Q` est vrai est qu'en fait `Q` est vrai. En interne, cette tactique applique simplement un théorème disant que $Q \implies P \lor Q.$ Notez que cette tactique peut transformer un but résoluble en un but insoluble.
it: # Descrizione La tattica `right` trasforma un goal della forma `P ∨ Q` nel nuovo goal `Q`. Usala quando le tue ipotesi garantiscono che si può dedurre `P ∨ Q` dalla verità di `Q`. L'implementazione di Lean di questa tattica non fa altro che `apply` di un teorema che dice che $Q \implies P \lor Q.$ Nota bene che questa tattica può portare il tuo goal a uno stato irrisolvibile.
uk: # Резюме Тактика `right` змінює мету `P ∨ Q` на мету `Q` . Використовуйте її, коли ваші гіпотези гарантують, що причина чому `P ∨ Q` є істинним тому, що насправді `Q` є істинним. Внутрішньо ця тактика є лише `apply`-ікацією теореми кажучи, що $Q \implies P \or Q.$ Зауважте, що ця тактика може перетворити вирішувану мету на нерозв’язувану мету.
zh: ## 概述 `right` 策略将 `P ∨ Q` 的目标更改为 `Q` 的目标。 当您的假设`Q` 为真是 `P ∨ Q`为真的原因时使用它。 在策略内部，它只是 `apply` （应用） 了 $Q \implies P \lor Q$ 这个定理 请注意，这种策略可以将可解决的目标变成无法解决的目标。

source: Totality of `≤` is the boss level of this world, and it's coming up next. It says that if `a` and `b` are naturals then either `a ≤ b` or `b ≤ a`. But we haven't talked about `or` at all. Here's a run-through. 1) The notation for "or" is `∨`. You won't need to type it, but you can type it with `\or`. 2) If you have an "or" statement in the *goal*, then two tactics made progress: `left` and `right`. But don't choose a direction unless your hypotheses guarantee that it's the correct one. 3) If you have an "or" statement as a *hypothesis* `h`, then `cases h with h1 h2` will create two goals, one where you went left, and the other where you went right.
fr: Que `≤` soit un ordre total est le niveau boss de ce monde, et il arrive bientôt. Il signifie que si `a` et `b` sont des naturels, alors soit `a ≤ b` soit `b ≤ a`. Mais nous n'avons pas du tout parlé de `or`. Voici un aperçu. 1) La notation pour "ou" est `∨`. Vous n'aurez pas besoin de la taper, mais vous pouvez la taper avec `\or`. 2) Si vous avez un terme "ou" dans le *but*, alors deux tactiques font avancer : `left` et `right`. Mais ne choisissez pas une direction à moins que vos hypothèses ne garantissent que c'est la bonne. 3) Si vous avez un énoncé "ou" comme *hypothèse* `h`, alors `cases h with h1 h2` créera deux buts, un où vous êtes allé à gauche, et un autre où vous êtes allé à droite.
it: La totalità di `≤` è il livello boss di questo mondo, ed è il prossimo livello. Essa afferma che se `a` e `b` sono due numeri naturali allora `a ≤ b` or `b ≤ a`. Ma non abbiamo mai parlato di `or` (o, oppure). In breve: 1) La notazione per "or" è `∨`. Non avrai bisogno di digitarlo, ma puoi ottenere quel simbolo digitando `\or`. 2) Se hai un enunciato "or" nel *goal*, due tattiche ti consentono di fare progresso: `left` e `right`. Ma non avere mai fretta di prendere una direzione o l'altra se le tue ipotesi non ti garantiscono che stai scegliendo la direzione giusta. 3) Se hai un enunciato "or" come *ipotesi* `h`, allora `cases h with h1 h2` creerà due goal, in uno devi dimostrare il lato sinistro, e nel secondo devi dimostrare il lato destro.
uk: Тотальність `≤` — це рівень боса цього світу, і він наступний. Він говорить, що якщо `a` і `b` є натуральними, тоді або `a ≤ b`, або `b ≤ a`. Але ми взагалі не говорили про `or`. Ось швидкий огляд. 1) Нотація для "або" це `∨`. Вам не потрібно буде ввести цей символ, але ви можете набрати його за допомогою `\or`. 2) Якщо у *мети* є твердження «або», то дві тактики роблять прогрес: `left` і `right`. Але не вибирайте напрямок, якщо ваша гіпотези не гарантує, що вона правильна. 3) Якщо у вас є твердження "або" як *гіпотеза* `h`, тоді `cases h with h1 h2` створить дві цілі: одну, де ви пішли ліворуч, і іншу там, де ви пішли праворуч.
zh: `≤`的完全性是这个世界的Boss关卡了，接下来就是它了。它表明如果`a`和`b`是自然数， 那么`a ≤ b`或`b ≤ a`。但我们根本没有讨论过“或”（`or`）。这里有一个简要说明。 1. “或”的符号是`∨`，你可以用`\or`来输入它。 2. 如果你的 *目标* 是一个“或”命题，那么有两个策略可以取得进展：`left`和`right`。 但除非你的知道哪边是真的，否则不要选择一个方向。 3. 如果你在 *假设* 中有一个“或”命题`h`，那么`cases h with h1 h2`会创建两个目标，一个假设左边是真的，另一个假设右边是真的。

source: If $x=37$ or $y=42$, then $y=42$ or $x=37$.
fr: Si $x=37$ ou $y=42$, alors $y=42$ ou $x=37$.
it: Se $x=37$ o $y=42$, allora $y=42$ o $x=37$.
uk: Якщо $x=37$ або $y=42$, то $y=42$ або $x=37$.
zh: 如果 $x=37$ 或 $y=42$，那么 $y=42$ 或 $x=37$。

source: We don't know whether to go left or right yet. So start with `cases «{h}» with hx hy`.
fr: Nous ne savons pas encore si aller à gauche ou à droite. Commencez donc par `cases «{h}» with hx hy`.
it: Non sappiamo ancora se andare a sinistra o a destra nel goal. Dunque lavoriamo sull'ipotesi, inizia con `cases «{h}» with hx hy`.
uk: Ми ще не знаємо куда питі, ліворуч чи праворуч. Тож почніть із `cases «{h}» with hx hy`.
zh: 我们还不确定是向左还是向右。所以从 `cases «{h}» with hx hy` 开始。

source: Now we can prove the `or` statement by proving the statement on the right, so use the `right` tactic.
fr: Maintenant, nous pouvons prouver l'énoncé `or` en prouvant l'énoncé de droite, donc utilisez la tactique `right`.
it: Ora possiamo dimostrare il goal con `or` dimostrando la proposizione a destra, perciò usa `right`.
uk: Тепер ми можемо довести твердження `or`, довівши твердження праворуч, тому використовуйте тактику `right`.
zh: 现在我们可以通过证明右边的声明来证明 `or` 命题， 所以使用 `right` 策略。

source: This time, use the `left` tactic.
fr: Cette fois, utilisez la tactique `left`.
it: Questa volta, puoi usare tattica `left`.
uk: Цього разу використовуйте тактику `left`.
zh: 这一次，使用 `left` 策略。

source: Ready for the boss level of this world?
fr: Prêt pour le niveau boss de ce monde ?
it: Pronto per il livello boss di questo mondo?
uk: Готові до рівня боса цього світу?
zh: 准备好迎接这个世界的Boss关了吗？

source: x ≤ y or y ≤ x
fr: x ≤ y ou y ≤ x
it: x ≤ y o y ≤ x
uk: x ≤ y або y ≤ x
zh: x ≤ y 或 y ≤ x
