Repository: leanprover-community/NNG4
Catalog: .i18n/*/Game.po
Languages: fr, it, uk, zh

source: We'd like to prove `2 + 2 = 4` but right now we can't even *state* it because we haven't yet defined addition. ## Defining addition. How are we going to add $37$ to an arbitrary number $x$? Well, there are only two ways to make numbers in this game: $0$ and successors. So to define `37 + x` we will need to know what `37 + 0` is and what `37 + succ x` is. Let's start with adding `0`. ### Adding 0 To make addition agree with our intuition, we should *define* `37 + 0` to be `37`. More generally, we should define `a + 0` to be `a` for any number `a`. The name of this proof in Lean is `add_zero a`. For example `add_zero 37` is a proof of `37 + 0 = 37`, `add_zero x` is a proof of `x + 0 = x`, and `add_zero` is a proof of `? + 0 = ?`. We write `add_zero x : x + 0 = x`, so `proof : statement`.
fr: Nous aimerions prouver `2 + 2 = 4` mais actuellement nous ne pouvons même pas *l'énoncer* car nous n'avons pas encore défini l'addition. ## Définition de l'addition. Comment allons-nous ajouter $37$ à un nombre arbitraire $x$ ? Eh bien, il n'y a que deux façons de créer des nombres dans ce jeu : $0$ et les successeurs. Donc pour définir `37 + x`, nous aurons besoin de savoir ce que sont `37 + 0` et `37 + succ x`. Commençons par ajouter `0`. ### Ajouter 0 Pour que l'addition corresponde à notre intuition, nous devons *définir* `37 + 0` comme `37`. Plus généralement, nous devons définir `a + 0` comme `a` pour tout nombre `a`. Le nom de cette preuve dans Lean est `add_zero a`. Par exemple, `add_zero 37` est une preuve de `37 + 0 = 37`, `add_zero x` est une preuve de `x + 0 = x`, et `add_zero` est une preuve de `? + 0 = ?`. Nous écrivons `add_zero x : x + 0 = x`, donc `preuve : énoncé`.
it: Il nostro obiettivo è dimostrare `2 + 2 = 4`, ma per ora non possiamo nemmeno *enunciarlo* dato che non abbiamo ancora definito l'addizione. ## Definiamo l'addizione Come possiamo sommare $37$ a un numero arbitrario $x$? Beh, questo numero arbitrario può essere stato creato in due modi: o $0$ o il successore. Dunque per definire `37 + x` abbiamo bisogno di sapere quanto fa `37 + 0` e quanto fa `37 + succ x`. Partiamo dall'aggiungere `0` a qualcosa. ### Aggiungere zero Per far sì che l'addizione rispetti la nostra intuizione, *definiamo* `37 + 0` come `37`. In generale, definiamo `a + 0` uguale ad `a` per qualsiasi numero `a`. Questa dimostrazione in Lean si chiama `add_zero a`. Ad esempio `add_zero 37` è la dimostrazione di `37 + 0 = 37`, `add_zero x` è la dimostrazione di `x + 0 = x`, `add_zero` da solo è la dimostrazione di `? + 0 = ?`. La sintassi è `add_zero x : x + 0 = x`, dunque `dimostrazione : enunciato`.
uk: Ми хотіли б довести, що `2 + 2 = 4`, але прямо зараз ми навіть не можемо *заявити* про це оскільки ми ще не визначили додавання. ## Визначення додавання. Як ми збираємося додати $37$ до довільного числа $x$? добре, у цій грі є лише два способи робити числа: $0$ та наступники. Отже, щоб визначити `37 + x`, нам знадобиться щоб знати, що таке `37 + 0` і що таке `37 + succ x`. Почнемо з додавання `0`. ### Додавання 0 Щоб додавання узгоджувалося з нашою інтуїцією, ми повинні *визначити* `37 + 0` як `37`. Загалом, ми повинні визначити `a + 0` як `a` для будь-якого числа `а`. Назва цього доказу в Lean це `add_zero a`. Наприклад, `add_zero 37` є доказом `37 + 0 = 37`, `add_zero x` є доказом `x + 0 = x`, а `add_zero` є доказом з `? + 0 = ?`. Ми пишемо `add_zero x : x + 0 = x`, отже `доказ : твердження`.
zh: 我们正寻求证明 `2 + 2 = 4`，但目前我们连*表述*它都做不到，因为加法尚未被定义。 ## 加法的定义 如何实现将任意数字 $x$ 加到 $37$ 上呢？在这个游戏里，我们只有两种方式生成数字：$0$ 和后继数。因此，为了定义 `37 + x`，我们需要明白 `37 + 0` 和 `37 + succ x` 分别是什么。先从加 `0` 的情况开始探索。 ### 加 0 为了让加法操作符合直觉，我们应当*定义* `37 + 0` 为 `37`。更广泛来说，对于任何数字 `a`，我们定义 `a + 0` 应等于 `a`。在 Lean 中，从这个定义直接衍生出的定理被命名为 `add_zero a`。比如，`add_zero 37` 证明了 `37 + 0 = 37`，`add_zero x` 证明了 `x + 0 = x`，而 `add_zero` 则证明了 `? + 0 = ?`。 我们将定理记作 `add_zero x : x + 0 = x`，其中定理的名称位于前面，而定理的表述则位于后面。这和之前在*假设*中的记法很像。

source: `rw [add_zero]` will change `b + 0` into `b`.
fr: `rw [add_zero]` changera `b + 0` en `b`.
it: `rw [add_zero]` trasformerà `b + 0` in `b`.
uk: `rw [add_zero]` замінить `b + 0` на `b`.
zh: `rw [add_zero]` 会把 `b + 0` 改为 `b`。

source: Now `rw [add_zero]` will change `c + 0` into `c`.
fr: Maintenant `rw [add_zero]` changera `c + 0` en `c`.
it: Ora `rw [add_zero]` trasformerà `c + 0` in `c`.
uk: Тепер `rw [add_zero]` замінить `c + 0` на `c`.
zh: 现在，`rw [add_zero]` 会把 `c + 0` 改为 `c`。

source: Those of you interested in speedrunning the game may want to know that `repeat rw [add_zero]` will do both rewrites at once.
fr: Ceux d'entre vous intéressés par le speedrun du jeu voudront peut-être savoir que `repeat rw [add_zero]` fera les deux réécritures en une seule fois.
it: Se sei interessato a fare lo speedrun del gioco, sappi che `repeat rw [add_zero]` esegue entrambe le sostituzioni in un'unica mossa.
uk: Ті з вас, хто цікавиться швидким проходженням гри, можливо, захочуть знати що `repeat rw [add_zero]` виконає обидва перезаписи одночасно.
zh: 对于那些对快速通关游戏感兴趣的玩家，一个小技巧是使用 `repeat rw [add_zero]` 可以一次性完成两次重写操作。

source: Precision rewriting
fr: Réécriture de précision
it: Rewriting mirato
uk: Точний перезапис
zh: 精准重写

source: ## Precision rewriting In the last level, there was `b + 0` and `c + 0`, and `rw [add_zero]` changed the first one it saw, which was `b + 0`. Let's learn how to tell Lean to change `c + 0` first by giving `add_zero` an explicit input.
fr: ## Réécriture de précision Dans le niveau précédent, il y avait `b + 0` et `c + 0`, et `rw [add_zero]` a changé le premier qu'il a vu, qui était `b + 0`. Apprenons à dire à Lean de changer `c + 0` en premier en donnant à `add_zero` une entrée explicite.
it: ## Rewriting mirato Nell'ultimo livello vi erano sia `b + 0` che `c + 0` da riscrivere, e `rw [add_zero]` ha scelto il primo che ha trovato, ossia `b + 0`. Impariamo come dire a Lean di riscrivere `c + 0` per primo dando ad `add_zero` un input esplicito.
uk: ## Точний перезапис На останньому рівні були твердження `b + 0` і `c + 0`, і `rw [add_zero]` змінив перше побачене твердження, яким було `b + 0`. Давайте дізнаємося, як сказати Lean щоб спочатку змінити `c + 0`, передавши `add_zero` явний параметр.
zh: ## 精准重写 在上一个关卡中，有 `b + 0` 和 `c + 0`， 而 `rw [add_zero]` 改变了它看到的第一个加0， 也就是 `b + 0`。让我们学习如何告诉 Lean 通过给 `add_zero` 一个明确的输入来首先改变 `c + 0`。

source: Try `rw [add_zero c]`.
fr: Essayez `rw [add_zero c]`.
it: Esegui `rw [add_zero c]`.
uk: Спробуйте `rw [add_zero c]`.
zh: 尝试使用 `rw [add_zero c]`。

source: `add_zero c` is a proof of `c + 0 = c` so that was what got rewritten. You can now change `b + 0` to `b` with `rw [add_zero]` or `rw [add_zero b]`. You can usually stick to `rw [add_zero]` unless you need real precision.
fr: `add_zero c` est une preuve que `c + 0 = c`, donc c'est ce qui a été réécrit. Vous pouvez maintenant changer `b + 0` en `b` avec `rw [add_zero]` ou `rw [add_zero b]`. Vous pouvez généralement vous en tenir à `rw [add_zero]` sauf si vous avez besoin d'une grande précision.
it: `add_zero c` è la dimostrazione di `c + 0 = c`, proprio quello che è stato riscritto. Ora puoi scambiare `b + 0` con `b` scrivendo `rw [add_zero]` o `rw [add_zero b]`. Nella pratica, usa `rw [add_zero]` quando non hai bisogno di precisare il termine da sostituire.
uk: `add_zero c` є доказом `c + 0 = c`, отже, це те, що буде перезаписано. Тепер ви можете змінити `b + 0` на `b` за допомогою `rw [add_zero]` або `rw [add_zero b]`. Ви зазвичай можете використовувати `rw [add_zero]`, якщо вам не потрібна справжня точність.
zh: `add_zero c` 是 `c + 0 = c` 的证明，所以可以用来改写目标了。现在你可以用 `rw [add_zero]` 或 `rw [add_zero b]` 把 `b + 0` 改成 `b`。您通常可以使用 `rw [add_zero]`，除非你需要精准控制改写的内容。

source: Let's now learn about Peano's second axiom for addition, `add_succ`.
fr: Apprenons maintenant le second axiome de Peano pour l'addition, `add_succ`.
it: Vediamo adesso il secondo assioma di Peano sull'addizione, `add_succ`.
uk: Давайте тепер дізнаємося про другу аксіому Пеано для додавання, `add_succ`.
zh: 现在，让我们来学习皮亚诺加法的第二条公理——`add_succ`。

source: `add_succ a b` is the proof of `a + succ b = succ (a + b)`.
fr: `add_succ a b` est la preuve que `a + succ b = succ (a + b)`.
it: `add_succ a b` è la dimostrazione di `a + succ b = succ (a + b)`.
uk: `add_succ a b` є доказом `a + succ b = succ (a + b)`.
zh: `add_succ a b` 是 `a + succ b = succ (a + b)` 的证明。

source: `succ_eq_add_one n` is the proof that `succ n = n + 1`.
fr: `succ_eq_add_one n` est la preuve que `succ n = n + 1`.
it: `succ_eq_add_one n` è la dimostrazione di `succ n = n + 1`.
uk: `succ_eq_add_one n` є доказом того, що `succ n = n + 1`.
zh: `succ_eq_add_one n` 是 `succ n = n + 1` 的证明。

source: Every number in Lean is either $0$ or a successor. We know how to add $0$, but we need to figure out how to add successors. Let's say we already know that `37 + d = q`. What should the answer to `37 + succ d` be? Well, `succ d` is one bigger than `d`, so `37 + succ d` should be `succ q`, the number one bigger than `q`. More generally `x + succ d` should be `succ (x + d)`. Let's add this as a lemma. * `add_succ x d : x + succ d = succ (x + d)` If you ever see `... + succ ...` in your goal, `rw [add_succ]` is normally a good idea. Let's now prove that `succ n = n + 1`. Figure out how to get `+ succ` into the picture, and then `rw [add_succ]`. Switch between the `+` (addition) and `012` (numerals) tabs under "Theorems" on the right to see which proofs you can rewrite.
fr: Chaque nombre dans Lean est soit $0$, soit un successeur. Nous savons comment ajouter $0$, mais nous devons comprendre comment ajouter des successeurs. Disons que nous savons déjà que `37 + d = q`. Que devrait être la réponse à `37 + succ d` ? Eh bien, `succ d` est un de plus que `d`, donc `37 + succ d` devrait être `succ q`, le nombre un de plus que `q`. Plus généralement, `x + succ d` devrait être `succ (x + d)`. Ajoutons cela comme lemme. * `add_succ x d : x + succ d = succ (x + d)` Si vous voyez `... + succ ...` dans votre but, `rw [add_succ]` est généralement une bonne idée. Prouvons maintenant que `succ n = n + 1`. Trouvez comment introduire `+ succ` dans notre situation, puis `rw [add_succ]`. Alternez entre les onglets `+` (addition) et `012` (numéraux) sous "Théorèmes" à droite pour voir quelles preuves vous pouvez réécrire.
it: Ogni numero in Lean è $0$ oppure il successore di un altro numero. Abbiamo già visto come aggiungere $0$, e ci rimane da capire come aggiungere un successore. Ipotizziamo di sapere che vale l'uguaglianza `37 + d = q`. A cosa dovrebbe essere uguale `37 + succ d`? Beh, `succ d` è un'unità più grande di `d`, quindi `37 + succ d` dovrebbe essere `succ q`, ossia un'unità più grande di `q`. In generale `x + succ d` dovrebbe dare `succ (x + d)`. Formalizziamo questo ragionamento in un lemma. * `add_succ x d : x + succ d = succ (x + d)` Quando vedi `... + succ ...` nel goal, eseguire `rw [add_succ]` è una buona idea. Dimostriamo ora che `succ n = n + 1`. Cerca di introdurre un `+ succ` nel goal, poi esegui `rw [add_succ]`. Controlla entrambi i tab `+` (addizione) e `012` (numeri) nella sezione "Teoremi" a destra per vedere quali teoremi da riscrivere hai a disposizione.
uk: Кожне число в Lean є або $0$, або наступним значенням (наступником). Ми знаємо, як додати $0$, але нам потрібно зрозуміти, як додати наступників. Скажімо, ми вже знаємо що `37 + d = q`. Якою має бути відповідь на `37 + succ d`? Гаразд, `succ d` на одиницю більший за `d`, тому `37 + succ d` має бути `succ q`, число на один більше за `q`. Більш загально `x + succ d` повинен бути `succ (x + d)`. Додамо це як лему. * `add_succ x d : x + succ d = succ (x + d)` Якщо ви побачите `... + succ ...` у своїй меті, `rw [add_succ]` зазвичай хороша ідея. Давайте тепер доведемо, що `succ n = n + 1`. З’ясуйте, як додати `+ succ` у фокус, а потім зробіть `rw [add_succ]`. Перемикайте між вкладками `+` (додавання) і `012` (цифри) у розділі "Теореми" праворуч і подивіться, які докази ви можете переписати.
zh: Lean 中的每个数字要么是 $0$ 要么是后继数。我们已经知道如何加 $0$， 我们还需要弄清楚如何添加后继数。假设我们已经知道 `37 + d = q`。 `37 + succ d` 的答案应该是什么？ `succ d` 比 `d` 大1，因此 `37 + succ d` 应该是 `succ q`， 也就是比 `q` 大1。更一般地说，`x + succ d` 应该 为 `succ (x + d)`。让我们将其添加为定理。 * `add_succ x d : x + succ d = succ (x + d)` 如果您在证明目标中看到 `... + succ ...`，那么用 `rw [add_succ]` 改写 通常是个好主意。 现在让我们证明 `succ n = n + 1`。弄清楚如何引入 `+ succ` ，然后再 `rw [add_succ]`。在右侧“定理”下的 `+`（加法）和 `012`（数字）选项卡里 看看你可以用哪些证明重写目标。 在 Lean 中，每个数字要么是 $0$，要么是某个数字的后继数。我们已经掌握了如何加上 $0$，下一步需要明白如何加上后继数。设想我们已经知道 `37 + d = q`。那么 `37 + succ d` 应该是什么呢？由于 `succ d` 比 `d` 多 $1$，所以 `37 + succ d` 应该等于 `succ q`，也就是 `q` 加 $1$。更一般地，`x + succ d` 应等于 `succ (x + d)`。我们把这个规则加为一个引理： - `add_succ x d : x + succ d = succ (x + d)` 当你在证明目标中遇到 `... + succ ...` 形式时，使用 `rw [add_succ]` 来重写通常是一个好策略。 现在，让我们来证明 `succ n = n + 1`。思考如何先引入 `+ succ` 形式，然后再应用 `rw [add_succ]` 策略。请在右侧“定理”部分的 `+`（代表加法）和 `012`（代表数字）标签页中查找可以用来重写目标的定理。

source: For all natural numbers $a$, we have $\operatorname{succ}(a) = a+1$.
fr: Pour tout nombre naturel $a$, nous avons $\operatorname{succ}(a) = a+1$.
it: Per ogni numero naturale $a$, si ha che $\operatorname{succ}(a) = a+1$.
uk: Для всіх натуральних чисел $a$ маємо $\operatorname{succ}(a) = a+1$.
zh: 对于所有自然数 $a$，我们有 $\operatorname{succ}(a) = a+1$ 。

source: Start by unravelling the `1`.
fr: Commencez par décomposer le `1`.
it: Comincia espandendo `1`.
uk: Почніть із рокривання `1`.
zh: 从展开 "1 "开始。

source: `rw [one_eq_succ_zero]` will do this.
fr: `rw [one_eq_succ_zero]` fera cela.
it: `rw [one_eq_succ_zero]` per espandere.
uk: `rw [one_eq_succ_zero]` допоможе у цьому.
zh: `rw [one_eq_succ_zero]` 能这样做。

source: Now you can `rw [add_succ]`
fr: Maintenant vous pouvez utiliser `rw [add_succ]`
it: Ora puoi eseguire `rw [add_succ]`
uk: Тепер ви можете зробити `rw [add_succ]`
zh: 现在，您可以 `rw [add_succ]`

source: And now `rw [add_zero]`
fr: Et maintenant `rw [add_zero]`
it: E ora `rw [add_zero]`
uk: А тепер `rw [add_zero]`
zh: 现在使用`rw [add_zero]`

source: And finally `rfl`.
fr: Et enfin `rfl`.
it: Infine, `rfl`.
uk: І нарешті `rfl`.
zh: 最后是 `rfl`。

source: [dramatic music]. Now are you ready to face the first boss of the game?
fr: [musique dramatique]. Êtes-vous maintenant prêt à affronter le premier boss du jeu ?
it: [musica drammatica] Sei pronto per affrontare il primo boss del gioco?
uk: [драматична музика]. Тепер ви готові зустрітися з першим босом у грі?
zh: 【背景音乐】现在你准备好面对游戏里的第一个boss了吗？

source: Good luck! One last hint. If `h : X = Y` then `rw [h]` will change *all* `X`s into `Y`s. If you only want to change one of them, say the 3rd one, then use `nth_rewrite 3 [h]`.
fr: Bonne chance ! Un dernier indice. Si `h : X = Y` alors `rw [h]` changera *tous* les `X` en `Y`. Si vous ne voulez en changer qu'un seul, disons le 3ème, alors utilisez `nth_rewrite 3 [h]`.
it: Buona fortuna! Un'ultima cosa. Se hai `h : X = Y`, con `rw [h]` cambierai *tutte* le `X` in`Y`. Se vuoi cambiarne solo una, la terza ad esempio, allora devi scrivere `nth_rewrite 3 [h]`.
uk: Удачі! Остання підказка. Якщо `h : X = Y`, то `rw [h]` змінить *усі* `X` на `Y`. Якщо ви хочете змінити лише один із них, скажімо, 3-й, тоді використовуйте `nth_rewrite 3 [h]`.
zh: 祝你好运！ 最后一个提示。如果 `h : X = Y`，那么 `rw [h]` 会将 *所有* 的 `X` 替换为 `Y`。如果你只想替换其中一个，比如第 3 个，那么请使用 `nth_rewrite 3 [h]`。

source: `nth_rewrite 2 [two_eq_succ_one]` is I think quicker than `rw [two_eq_succ_one]`.
fr: `nth_rewrite 2 [two_eq_succ_one]` est je pense plus rapide que `rw [two_eq_succ_one]`.
it: `nth_rewrite 2 [two_eq_succ_one]` più veloce di `rw [two_eq_succ_one]`, secondo me.
uk: я думаю, `nth_rewrite 2 [two_eq_succ_one]` швидше, ніж `rw [two_eq_succ_one]`.
zh: 我认为 `nth_rewrite 2 [two_eq_succ_one]` 比 `rw [two_eq_succ_one]` 更快。

source: Here is an example proof of 2+2=4 showing off various techniques. ```lean nth_rewrite 2 [two_eq_succ_one] -- only change the second `2` to `succ 1`. rw [add_succ] rw [one_eq_succ_zero] rw [add_succ, add_zero] -- two rewrites at once rw [← three_eq_succ_two] -- change `succ 2` to `3` rw [← four_eq_succ_three] rfl ``` Optional extra: you can run this proof yourself. Switch the game into "Editor mode" by clicking on the `</>` button in the top right. You can now see your proof written as several lines of code. Move your cursor between lines to see the goal state at any point. Now cut and paste your code elsewhere if you want to save it, and paste the above proof in instead. Move your cursor around to investigate. When you've finished, click the `>_` button in the top right to move back into "Typewriter mode". You have finished tutorial world! Click "Leave World" to go back to the overworld, and select Addition World, where you will learn about the `induction` tactic.
fr: Voici un exemple de preuve de 2+2=4 montrant diverses techniques. ```lean nth_rewrite 2 [two_eq_succ_one] -- ne change que le deuxième `2` en `succ 1` rw [add_succ] rw [one_eq_succ_zero] rw [add_succ, add_zero] -- deux réécritures en une fois rw [← three_eq_succ_two] -- change `succ 2` en `3` rw [← four_eq_succ_three] rfl ``` Option supplémentaire : vous pouvez exécuter cette preuve vous-même. Passez le jeu en "Mode Éditeur" en cliquant sur le bouton `</>` en haut à droite. Vous pouvez maintenant voir votre preuve écrite sous forme de plusieurs lignes de code. Déplacez votre curseur entre les lignes pour voir l'état du but à tout moment. Maintenant, copiez et collez votre code ailleurs si vous voulez le sauvegarder, et collez la preuve ci-dessus à la place. Déplacez votre curseur autour pour examiner. Lorsque vous avez terminé, cliquez sur le bouton `>_` en haut à droite pour revenir en "Mode Machine à écrire". Vous avez terminé le monde tutoriel ! Cliquez sur "Quitter le monde" pour revenir au monde principal, et sélectionnez Addition World, où vous apprendrez la tactique `induction`.
it: Ecco un esempio di dimostrazione di 2+2=4 che impiega varie tecniche. ```lean nth_rewrite 2 [two_eq_succ_one] -- only change the second `2` to `succ 1`. rw [add_succ] rw [one_eq_succ_zero] rw [add_succ, add_zero] -- two rewrites at once rw [← three_eq_succ_two] -- change `succ 2` to `3` rw [← four_eq_succ_three] rfl ``` Esercizio facoltativo: prova ad eseguire questa dimostrazione. Entra nella "Modalità editor" cliccando sul pulsante `</>` in alto a destra. Dovresti vedere la tua dimostrazione estesa su diverse linee di codice. Muovendo il cursore da una linea all'altra vedrai lo stato della dimostrazione in ogni punto. Ora copia la tua dimostrazione e salvala da qualche parte per non perderla, e incolla la dimostrazione che abbiamo riportato qui sopra al posto del tuo codice. Muovi il cursore tra le linee per vedere come si comporta, sperimenta un po' con l'interfaccia. Quando hai finito, premi il pulsante `>_` in alto a destra per ritornare nella "Modalità interattiva". Hai completato il Mondo Tutorial! Premi "Abbandona mondo" per tornare al menu principale, ed entra nel Mondo Addizione, dove imparerai a usare la tattica `induction`.
uk: Ось приклад доказу 2+2=4 із демонстрацією різних технік. ```lean nth_rewrite 2 [two_eq_succ_one] -- змінює лише другий `2` на `succ 1`. rw [add_succ] rw [one_eq_succ_zero] rw [add_succ, add_zero] -- два перезаписи одночасно rw [← three_eq_succ_two] -- змінює `succ 2` на `3` rw [← four_eq_succ_three] rfl ``` Додатково: ви можете виконати цей доказ самостійно. Переведіть гру в «Режим редактора», клацнувши на кнопці `</>` у верхньому правому куті. Тепер ви можете побачити свій доказ написаний у вигляді декількох рядків коду. Переміщуйте курсор між рядками, щоб побачити цільовий стан у будь-якій точці. Тепер виріжте та вставте свій код в іншому місці, якщо ви хочете зберегти його та вставте натомість наведене вище підтвердження. Перемістіть курсор навколо, щоб дослідити. Коли ви закінчите, натисніть кнопку `>_` у верхньому правому куті, щоб повернутися назад у «Режим друку». Ви закінчили навчальний світ! Натисніть «Залишити світ», щоб повернутися до всесвіту і виберіть Світ додавання, де ви дізнаєтесь про тактику `induction`.
zh: 下面是一个证明 2+2=4 的例子，展示了各种技巧。 ```lean nth_rewrite 2 [two_eq_succ_one] -- 只将第二个 `2 ` 改为 `succ 1` 。 rw [add_succ］ rw [one_eq_succ_zero] rw [add_succ, add_zero] -- 一次改写两个内容 rw [← three_eq_succ_two] -- 将 `succ 2` 改为 `3` rw [← four_eq_succ_three] 。 rfl ``` 可选附加功能：你可以自己运行这个证明。点击右上角的 右上角的 `</>` 按钮，将游戏切换到 "编辑器模式"。现在你可以看到你的证明 被写成了几行代码。在各行代码之间移动光标，即可查看 目标状态。现在，如果想保存代码，你就要将代码剪切并粘贴到其他地方 ，请将上述证明粘贴进去。移动光标 进行研究。完成后，点击右上角的 `>_` 按钮，回到 "打字机模式"。 回到 "打字机模式"。 您已经完成了 "教程世界"！ 点击 "离开世界 "回到世界选择界面 选择 "加法世界"，在这里您将学习 `induction ` 策略。

source: Tutorial World
fr: Monde Tutoriel
it: Mondo Tutorial
uk: Навчальний світ
zh: 教程世界

source: Welcome to tutorial world! In this world we learn the basics of proving theorems. The boss level of this world is the theorem `2 + 2 = 4`. You prove theorems by solving puzzles using tools called *tactics*. The aim is to prove the theorem by applying tactics in the right order. Let's learn some basic tactics. Click on "Start" below to begin your quest.
fr: Bienvenue dans le monde tutoriel ! Dans ce monde, nous apprenons les bases de la preuve de théorèmes. Le niveau boss de ce monde est le théorème `2 + 2 = 4`. Vous prouvez des théorèmes en résolvant des énigmes à l'aide d'outils appelés *tactiques*. Le but est de prouver le théorème en appliquant des tactiques dans le bon ordre. Apprenons quelques tactiques de base. Cliquez sur "Commencer" ci-dessous pour débuter votre quête.
it: Benvenuto nel Mondo Tutorial! In questo mondo impareremo le basi della dimostrazione formale. Il livello boss di questo mondo è il teorema `2 + 2 = 4`. Dimostrare i teoremi consiste nel risolvere dei puzzle matematici utilizzando degli strumenti chiamati *tactics* (tattiche). Per dimostrare un teorema dovrai applicare le tattiche nell'ordine giusto. Impariamo subito qualche tattica basilare. Premi sul pulsante "Via" qui sotto per cominciare l'avventura.
uk: Ласкаво просимо до навчального світу! У цьому світі ми вивчаємо основи доведення теорем. Рівневим босом цього світу є теорема `2 + 2 = 4`. Ви доводите теореми, вирішуючи головоломки за допомогою інструментів під назвою *тактики*. Мета полягає в тому, щоб довести теорему шляхом застосування тактики у правильному порядку. Давайте навчимося деяким основним тактикам. Натисніть «Почати» нижче щоб почати свою пригоду.
zh: 欢迎进入教程世界！在这里，我们将掌握证明定理的初步技能。这个世界中的终极挑战是证明 `2 + 2 = 4` 这一定理。 解决这些谜题并证明定理的过程中，你将使用一种名为*策略*的强大工具。证明定理的关键在于准确地应用这些策略。 现在，让我们开始学习一些基本策略吧。请点击下面的“开始”按钮，开启你的证明之旅。
