Repository: leanprover-community/NNG4
Catalog: .i18n/*/Game.po
Languages: fr, it, uk, zh

source: Advanced *Addition* World proved various implications involving addition, such as `x + y = 0 → x = 0` and `x + y = x → y = 0`. These lemmas were used to prove basic facts about ≤ in ≤ World. In Advanced Multiplication World we prove analogous facts about multiplication, such as `x * y = 1 → x = 1`, and `x * y = x → y = 1` (assuming `x ≠ 0` in the latter result). This will prepare us for Divisibility World. Multiplication World is more complex than Addition World. In the same way, Advanced Multiplication world is more complex than Advanced Addition World. One reason for this is that certain intermediate results are only true under the additional hypothesis that one of the variables is non-zero. This causes some unexpected extra twists.
fr: Le Monde de l'Addition Avancée a prouvé diverses implications impliquant l'addition, telles que `x + y = 0 → x = 0` et `x + y = x → y = 0`. Ces lemmes ont été utilisés pour prouver des faits de base sur ≤ dans le Monde ≤. Dans le Monde de la Multiplication Avancée, nous prouvons des résultats analogues sur la multiplication, tels que `x * y = 1 → x = 1`, et `x * y = x → y = 1` (en supposant `x ≠ 0` pour ce dernier résultat). Cela nous préparera au Monde de la Divisibilité. Le Monde de la Multiplication est plus complexe que le Monde de l'Addition. De la même manière, le Monde de la Multiplication Avancée est plus complexe que le Monde de l'Addition Avancée. Une raison est que certains résultats intermédiaires ne sont vrais que sous l'hypothèse supplémentaire qu'une des variables est non nulle. Cela crée des complications inattendues.
it: Nel Mondo *Addizione* Avanzata abbiamo dimostrato varie implicazioni sull'addizione, ad esempio `x + y = 0 → x = 0` e `x + y = x → y = 0`. In seguito abbiamo usato questi lemmi per dimostrare fatti basilari su ≤ nel Mondo ≤. Nel Mondo Moltiplicazione Avanzata dimostreremo dei fatti analoghi sulla moltiplicazione, ad esempio `x * y = 1 → x = 1`, e `x * y = x → y = 1` (assumendo che `x ≠ 0` nel secondo enunciato). Questi saranno propedeutici per il Mondo Divisibilità. Il Mondo Moltiplicazione è più complesso del Mondo Addizione. Allo stesso modo, il Mondo Moltiplicazione Avanzata è più complesso del Mondo Addizione Avanzata. La maggiore complessità di questo mondo è dovuta al fatto che certi teoremi valgono a condizione che una delle variabili non possa assumere il valore zero (sia non-nulla). Questo ulteriore vincolo ha dei risvolti inaspettati.
uk: Світ розширенного *додаванн* довів різні імплікації включаючі додавання, наприклад `x + y = 0 → x = 0` і `x + y = x → y = 0`. Ці леми були використані для доведення основних фактів про ≤ у Світі ≤. У Світі розширенного множення ми доводимо аналогічни факти про множення, наприклад `x * y = 1 → x = 1`, і `x * y = x → y = 1` (припускаючи, що `x ≠ 0` в останньому результаті). Це підготує нас для світу ділення. Світ множення складніший за світ додавання. У тому самому сенсі, світ розширеного множення є складнішим, ніж світ розширеного додавання. Однією з причин цього є те, що є лише певні проміжні результати є вірними лише за умови додаткової гіпотези, що одна зі змінних не дорівнює нулю. Це викликає деякі несподівані додаткові повороти.
zh: 高级 *加法* 世界证明了涉及加法的各种引理，例如 `x + y = 0 → x = 0` 和 `x + y = x → y = 0`。这些引理被用来证明 ≤ 世界中关于 ≤ 的基本事实。 在高级乘法世界中，我们证明了关于乘法的类似事实，例如 `x * y = 1 → x = 1`，以及 `x * y = x → y = 1`（在后一个结果中假设 `x ≠ 0`）。这将为我们进入可除性世界做准备。 乘法世界比加法世界更为复杂。同样，高级乘法世界比高级加法世界更为复杂。其中一个原因是某些中间结果只在额外假设下为真，即变量之一非零。这导致了一些意想不到的转折。

source: Natural Number Game
fr: Le Jeu des Nombres Naturels
it: Il Gioco dei Numeri Naturali
uk: Гра «Натуральні числа»
zh: 自然数游戏

source: # Welcome to the Natural Number Game #### An introduction to mathematical proof. In this game, we will build the basic theory of the natural numbers `{0,1,2,3,4,...}` from scratch. Our first goal is to prove that `2 + 2 = 4`. Next we'll prove that `x + y = y + x`. And at the end we'll see if we can prove Fermat's Last Theorem. We'll do this by solving levels of a computer puzzle game called Lean. # Read this. Learning how to use an interactive theorem prover takes time. Tests show that the people who get the most out of this game are those who read the help texts like this one. To start, click on "Tutorial World". Note: this is a new Lean 4 version of the game containing several worlds which were not present in the old Lean 3 version. More new worlds such as Strong Induction World, Even/Odd World and Prime Number World are in development; if you want to see their state or even help out, checkout out the [issues in the github repo](https://github.com/leanprover-community/NNG4/issues). ## More Click on the three lines in the top right and select "Game Info" for resources, links, and ways to interact with the Lean community.
fr: # Bienvenue dans le Jeu des Nombres Naturels #### Une introduction aux preuves mathématiques. Dans ce jeu, nous construirons la théorie de base des nombres naturels `{0,1,2,3,4,...}` à partir de zéro. Notre premier objectif est de prouver que `2 + 2 = 4`. Ensuite, nous prouverons que `x + y = y + x`. Et à la fin, nous verrons si nous pouvons prouver le Grand Théorème de Fermat. Nous allons résoudre les niveaux d'un jeu de puzzle informatique appelé Lean. # Lisez ceci. Apprendre à utiliser un assistant de preuve interactif prend du temps. Des tests montrent que les personnes qui tirent le meilleur parti de ce jeu sont celles qui lisent les textes d'aide comme celui-ci. Pour commencer, cliquez sur "Monde Tutoriel". Note : ceci est une nouvelle version Lean 4 du jeu contenant plusieurs mondes absents de l'ancienne version Lean 3. D'autres nouveaux mondes tels que le Monde de l'Induction Forte, le Monde Pair/Impair et le Monde des Nombres Premiers sont en développement ; si vous souhaitez voir leur état ou même aider, consultez les [problèmes dans le dépôt github](https://github.com/leanprover-community/NNG4/issues). ## En savoir plus Cliquez sur les trois lignes en haut à droite et sélectionnez "Infos du jeu" pour les ressources, liens et moyens d'interagir avec la communauté Lean.
uk: # Ласкаво просимо до гри натуральних чисел #### Вступ до математичних доказів. У цій грі ми побудуємо базову теорію натуральних чисел `{0,1,2,3,4,...}` з нуля. Наша перша мета – довести що `2 + 2 = 4`. Далі ми доведемо, що `x + y = y + x`. І в кінці ми побачимо, чи зможемо довести останню теорему Ферма. Ми зробимо це, розв’язуючи рівні комп’ютерної гри-головоломки під назвою Lean. # Прочитайте це. Щоб навчитися використовувати інтерактивний засіб доказування теорем, потрібен час. Тести показують, що люди, які отримують від цієї гри найбільше тих, хто читає довідкові тексти, як наприклад цей. Щоб почати, натисніть «Світ введення». Примітка: це нова версія гри Lean 4, яка містить декілька світи, яких не було в старій версії Lean 3. Більше нових світів наприклад світ сильної індукції, світ парних/непарних і світ простих чисел знаходяться в розробці; якщо ви хочете побачити їхній стан або навіть допомогти, перевірте [проблеми в сховищі github](https://github.com/leanprover-community/NNG4/issues). ## Більше Натисніть на три рядки у верхньому правому куті та виберіть «Інформація про гру» для ресурсів, посилання та способи взаємодії зі спільнотою Lean.

source: *Game version: 4.3* *Recent additions: bug fixes* ## Progress saving The game stores your progress in your local browser storage. If you delete it, your progress will be lost! Warning: In most browsers, deleting cookies will also clear the local storage (or "local site data"). Make sure to download your game progress first! ## Credits * **Creators:** Kevin Buzzard, Jon Eugster * **Original Lean3-version:** Kevin Buzzard, Mohammad Pedramfar * **Game Engine:** Alexander Bentkamp, Jon Eugster, Patrick Massot * **Additional levels:** Sian Carey, Ivan Farabella, Archie Browne. * **Additional thanks:** All the student beta testers, all the schools who invited Kevin to speak, and all the schoolkids who asked him questions about the material. ## Resources * The [Lean Zulip chat](https://leanprover.zulipchat.com/) forum * [Original Lean3 version](https://www.ma.imperial.ac.uk/~buzzard/xena/natural_number_game/) (no longer maintained) ## Problems? Please ask any questions about this game in the [Lean Zulip chat](https://leanprover.zulipchat.com/) forum, for example in the stream "New Members". The community will happily help. Note that the Lean Zulip chat is a professional research forum. Please use your full real name there, stay on topic, and be nice. If you're looking for somewhere less formal (e.g. you want to post natural number game memes) then head on over to the [Lean Discord](https://discord.gg/WZ9bs9UCvx). Alternatively, if you experience issues / bugs you can also open github issues: * For issues with the game engine, please open an [issue at the lean4game](https://github.com/leanprover-community/lean4game/issues) repo. * For issues about the game's content, please open an [issue at the NNG](https://github.com/hhu-adam/NNG4/issues) repo.
fr: *Version du jeu : 4.3* *Ajouts récents : corrections de bugs* ## Sauvegarde de la progression Le jeu stocke votre progression dans le stockage local de votre navigateur. Si vous le supprimez, votre progression sera perdue ! Avertissement : Dans la plupart des navigateurs, supprimer les cookies effacera également le stockage local (ou "données locales du site"). Assurez-vous de télécharger d'abord votre progression dans le jeu ! ## Crédits * **Créateurs :** Kevin Buzzard, Jon Eugster * **Version Lean3 originale :** Kevin Buzzard, Mohammad Pedramfar * **Moteur de jeu :** Alexander Bentkamp, Jon Eugster, Patrick Massot * **Niveaux supplémentaires :** Sian Carey, Ivan Farabella, Archie Browne. * **Remerciements supplémentaires :** Tous les bêta-testeurs étudiants, toutes les écoles qui ont invité Kevin à parler, et tous les écoliers qui lui ont posé des questions sur le contenu. ## Ressources * Le forum [Lean Zulip chat](https://leanprover.zulipchat.com/) * [Version Lean3 originale](https://www.ma.imperial.ac.uk/~buzzard/xena/natural_number_game/) (non maintenue) ## Problèmes ? Veuillez poser toute question sur ce jeu dans le forum [Lean Zulip chat](https://leanprover.zulipchat.com/), par exemple dans le flux "New Members". La communauté se fera un plaisir d'aider. Notez que le chat Lean Zulip est un forum de recherche professionnel. Veuillez utiliser votre vrai nom complet, rester sur le sujet et être courtois. Si vous cherchez un endroit moins formel (par exemple pour poster des mèmes sur le jeu des nombres naturels), rendez-vous sur le [Discord Lean](https://discord.gg/WZ9bs9UCvx). Alternativement, si vous rencontrez des problèmes/bugs, vous pouvez ouvrir des issues GitHub : * Pour les problèmes liés au moteur de jeu, veuillez ouvrir une issue [sur le dépôt lean4game](https://github.com/leanprover-community/lean4game/issues). * Pour les problèmes liés au contenu du jeu, veuillez ouvrir une issue [sur le dépôt NNG](https://github.com/hhu-adam/NNG4/issues).
uk: *Версія гри: 4.3* *Останні доповнення: виправлення помилок* ## Збереження прогресу Гра зберігає ваш прогрес у локальному сховищі браузера. Якщо ви видалите його, ваш прогрес буде втрачено! Попередження: у більшості браузерів видалення файлів cookie також очищає локальне сховище (або «дані локального сайту»). Обов’язково спершу скачайте свій прогрес гри! ## Подяки * **Творці:** Кевін Баззард, Джон Югстер * **Оригінальна версія Lean3:** Кевін Баззард, Мохаммад Педрамфар * **Ігровий рушій:** Олександр Бенткамп, Джон Югстер, Патрік Массо * **Додаткові рівні:** Сіан Кері, Іван Фарабелла, Арчі Браун. * **Додаткова подяка:** Усім учням-бета-тестерам, усім школам які запросли Кевіна виступити, і всіх школярів, які ставили йому запитання про матеріал. ## Ресурси * Форум [Lean Zulip chat](https://leanprover.zulipchat.com/). * [Оригінальна версія Lean3](https://www.ma.imperial.ac.uk/~buzzard/xena/natural_number_game/) (більше не підтримується) ## Проблеми? Будь ласка, задавайте будь-які запитання щодо цієї гри на форумі [Zulip чату Lean](https://leanprover.zulipchat.com/), наприклад у потік «New Members». Громада з радістю допоможе. Зауважте, що чат Lean Zulip — це професійний дослідницький форум. Будь ласка, використовуйте тут своє повне справжнє ім’я, не відривайтесь від теми та будьте чемними. Якщо ви шукаєте десь менш формальне (наприклад, ви хочете опублікувати меми гри в натуральні числа), то перейдіть до [Lean діскорду](https://discord.gg/WZ9bs9UCvx). Крім того, якщо у вас виникли проблеми / помилки, ви також можете відкрити проблеми на github: * Якщо у вас виникли проблеми з ігровим двигуном, відкрийте [проблема в репозиторії lean4game](https://github.com/leanprover-community/lean4game/issues). * Якщо у вас виникли питання щодо вмісту гри, відкрийте [проблема в NNG](https://github.com/hhu-adam/NNG4/issues) репі.

source: The classical introduction game for Lean.
fr: Le jeu d'introduction classique pour Lean.
it: Il classico gioco introduttivo per Lean.
uk: Класична вступна гра для Lean.
zh: 经典的Lean入门游戏。

source: In this game you recreate the natural numbers $\mathbb{N}$ from the Peano axioms, learning the basics about theorem proving in Lean. This is a good first introduction to Lean!
fr: Dans ce jeu, vous recréez les nombres naturels $\mathbb{N}$ à partir des axiomes de Peano, en apprenant les bases de la preuve de théorèmes dans Lean. C'est une excellente première introduction à Lean !
it: In questo gioco ricreerai l'insieme dei numeri naturali $\mathbb{N}$ partendo dagli assiomi di Peano, e lungo il percorso imparerai le basi del *theorem proving* su Lean. Questo gioco è un'ottima introduzione a Lean!
uk: У цій грі ви відтворюєте натуральні числа $\mathbb{N}$ із аксіом Пеано, вивчаючи основи доведення теорем в Lean. Це хороший перший крок у Lean!
zh: 在这个游戏中，你将根据皮亚诺公理重新构建自然数集 $\mathbb{N}$，学习在 Lean 中证明定理的基础知识。 这是对 Lean 的一个很好的初步介绍！

source: On the set of natural numbers, addition is associative. In other words, for all natural numbers $a, b$ and $c$, we have $ (a + b) + c = a + (b + c). $
fr: Sur l'ensemble des nombres naturels, l'addition est associative. Autrement dit, pour tous les nombres naturels $a, b$ et $c$, nous avons $ (a + b) + c = a + (b + c). $

source: ## Summary If `h` is a proof of an equality `X = Y`, then `rw [h]` will change all `X`s in the goal to `Y`s. It's the way to \"substitute in\". ## Variants * `rw [← h]` (changes `Y`s to `X`s; get the back arrow by typing `\left ` or `\l`.) * `rw [h1, h2]` (a sequence of rewrites) * `rw [h] at h2` (changes `X`s to `Y`s in hypothesis `h2`) * `rw [h] at h1 h2 ⊢` (changes `X`s to `Y`s in two hypotheses and the goal; get the `⊢` symbol with `\|-`.) * `repeat rw [add_zero]` will keep changing `? + 0` to `?` until there are no more matches for `? + 0`. * `nth_rewrite 2 [h]` will change only the second `X` in the goal to `Y`. ### Example: If you have the assumption `h : x = y + y` and your goal is ``` succ (x + 0) = succ (y + y) ``` then `rw [add_zero]` will change the goal into `succ x = succ (y + y)`, and then `rw [h]` will change the goal into `succ (y + y) = succ (y + y)`, which can be solved with `rfl`. ### Example: You can use `rw` to change a hypothesis as well. For example, if you have two hypotheses ``` h1 : x = y + 3 h2 : 2 * y = x ``` then `rw [h1] at h2` will turn `h2` into `h2 : 2 * y = y + 3`. ## Common errors * You need the square brackets. `rw h` is never correct. * If `h` is not a *proof* of an *equality* (a statement of the form `A = B`), for example if `h` is a function or an implication, then `rw` is not the tactic you want to use. For example, `rw [P = Q]` is never correct: `P = Q` is the theorem *statement*, not the proof. If `h : P = Q` is the proof, then `rw [h]` will work. ## Details The `rw` tactic is a way to do \"substituting in\". There are two distinct situations where you can use this tactic. 1) Basic usage: if `h : A = B` is an assumption or the proof of a theorem, and if the goal contains one or more `A`s, then `rw [h]` will change them all to `B`'s. The tactic will error if there are no `A`s in the goal. 2) Advanced usage: Assumptions coming from theorem proofs often have missing pieces. For example `add_zero` is a proof that `? + 0 = ?` because `add_zero` really is a function, and `?` is the input. In this situation `rw` will look through the goal for any subterm of the form `x + 0`, and the moment it finds one it fixes `?` to be `x` then changes all `x + 0`s to `x`s. Exercise: think about why `rw [add_zero]` changes the term `(0 + 0) + (x + 0) + (0 + 0) + (x + 0)` to `0 + (x + 0) + 0 + (x + 0)` If you can't remember the name of the proof of an equality, look it up in the list of lemmas on the right. ## Targetted usage If your goal is `b + c + a = b + (a + c)` and you want to rewrite `a + c` to `c + a`, then `rw [add_comm]` will not work because Lean finds another addition first and swaps those inputs instead. Use `rw [add_comm a c]` to guarantee that Lean rewrites `a + c` to `c + a`. This works because `add_comm` is a proof that `?1 + ?2 = ?2 + ?1`, `add_comm a` is a proof that `a + ? = ? + a`, and `add_comm a c` is a proof that `a + c = c + a`. If `h : X = Y` then `rw [h]` will turn all `X`s into `Y`s. If you only want to change the 37th occurrence of `X` to `Y` then do `nth_rewrite 37 [h]`.
it: ## Descrizione Se `h` è una prova dell'uguaglianza `X = Y`, allora `rw [h]` scriverà `Y` al posto di ogni `X` nel goal. `rw` svolge l'operazione di \"sostituzione\". ## Varianti di `rw` * `rw [← h]` (riscrive le `Y` con `X`; per avere la freccetta all'indietro si digita `\left ` oppure `\l`.) * `rw [h1, h2]` (sostituzioni in sequenza) * `rw [h] at h2` (riscrive le `X` in `Y` nell'ipotesi `h2`) * `rw [h] at h1 h2 ⊢` (riscrive le `X` in `Y` in due ipotesi e nel goal; per avere il simbolo `⊢` digita `\|-`.) * `repeat rw [add_zero]` riscriverà continuamente `? + 0` in `?` finché non riesce più a trovare espressioni della forma `? + 0`. * `nth_rewrite 2 [h]` riscriverà solo la seconda `X` nel goal in `Y`. ### Esempio: Se hai l'ipotesi `h : x = y + y` e il goal è ``` succ (x + 0) = succ (y + y) ``` allora il comando `rw [add_zero]` riscriverà il goal in `succ x = succ (y + y)`, e poi il comando `rw [h]` riscriverà il goal in `succ (y + y) = succ (y + y)`, il quale può essere risolto con `rfl`. ### Esempio: `rw` può anche riscrivere nelle ipotesi. Ad esempio, se hai le seguenti due ipotesi: ``` h1 : x = y + 3 h2 : 2 * y = x ``` eseguendo `rw [h1] at h2` sostituirà la `x` dentro `h2`, che diventerà `h2 : 2 * y = y + 3`. ## Errori comuni * `rw` accetta una lista di teoremi, dunque le parentesi quadre sono sempre da mettere. Scrivere `rw h` è un errore di sintassi. * Inoltre, gli argomenti che passi a `rw` devono essere *prove* di *uguaglianza*, dunque dei teoremi che hai dimostrato in precedenza e che hanno la forma`A = B`). Scrivere `rw [P = Q]` è sbagliato: `P = Q` è solo l'*affermazione* dell'uguaglianza, non la sua dimostrazione. Se invece hai `h : P = Q` nel contesto, `h` è una dimostrazione di `P = Q` e allora potrai scrivere `rw [h]`. ## Dettagli `rw` è la tattica che svolge la \"sostituzione\". Ci sono due casi in cui può essere usata: 1) Uso basilare: se `h : A = B` è un'ipotesi del contesto oppure la dimostrazione di un teorema, e se il goal contiene una o più `A`, allora `rw [h]` le sostituirà tutte con `B`. La tattica darà un errore se non ci sono `A` nel goal. 2) Uso avanzato: certi teoremi hanno delle incognite. Ad esempio, `add_zero` può essere trattato come un funzione il cui corpo è `? + 0 = ?` dove `?` è l'input. Applicando `rw` a `add_zero`, `rw` cercherà all'interno del goal un termine della forma `x + 0`; appena lo trova fissa l'incognita `?` a `x` e cambierà tutte le occorrenze di `x + 0` a `x`. Esercizio: prova a spiegare perché `rw [add_zero]` trasforma il termine `(0 + 0) + (x + 0) + (0 + 0) + (x + 0)` in `0 + (x + 0) + 0 + (x + 0)` Se non ti ricordi il nome di una dimostrazione di un'uguaglianza, puoi cercarlo nell'elenco di lemma sulla destra. ## Uso mirato Se nel goal hai `b + c + a = b + (a + c)` e vuoi riscrivere solo il termine `a + c` a `c + a`, invocare semplicemente `rw [add_comm]` non darà il risultato che ti aspetti perché Lean applica il teorema sulla prima espressione che ha un match con un'addizione. Puoi usare `rw [add_comm a c]` per far sì che Lean riscriva `a + c` a `c + a`. In questo modo stai fissando le incognite del teorema: `add_comm` è la prova di `?1 + ?2 = ?2 + ?1`, `add_comm a` è la prova di `a + ? = ? + a`, e infine `add_comm a c` è la prova di `a + c = c + a`. Data la dimostrazione `h : X = Y`, `rw [h]` riscriverà tutte le `X` a `Y` nel goal. Per cambiare solo la trentasettesima occorrenza di `X` a `Y`, il metodo giusto è `nth_rewrite 37 [h]`.

source: The music gets ever more dramatic, as we explore the interplay between exponentiation and multiplication. If you're having trouble exchanging the right `x * y` because `rw [mul_comm]` swaps the wrong multiplication, then read the documentation of `rw` for tips on how to fix this.
it: La musica si fa sempre più drammatica nel mentre che ci addentriamo nella relazione tra elevamento a potenza e prodotto. Se stai avendo difficoltà a scambiare il giusto `x * y` perché `rw [mul_comm]` sta operando su un prodotto diverso, leggi la documentazione di `rw` per ripassare come fare sostituzioni mirate.

source: The music dies down. Is that it? Course it isn't, you can clearly see that there are two worlds left. A passing mathematician says that mathematicians don't have a name for the structure you just constructed. You feel cheated. Suddenly the music starts up again. This really is the final boss.
it: La musica cessa di suonare. È finita? Ovvio che no, come vedi ci sono ancora due livelli da battere. Intanto, un matematico di passaggio ti svela che i matematici non hanno dato un nome alla struttura che hai appena costruito. Questa notizia ti lascia l'amaro in bocca. La musica riparte improvvisamente. Ti lasci alle spalle il passato: lo scontro con il boss finale è vicino.

source: In this level one of our hypotheses is an *implication*. We can use this hypothesis with the `apply` tactic.
it: In questo livello una delle nostre ipotesi è un'*implicazione*. Possiamo usare questa ipotesi con la tattica `apply`.

source: Now `repeat rw [← succ_eq_add_one] at h` is the quickest way to change `succ x = succ y`.
it: Adesso puoi fare `repeat rw [← succ_eq_add_one] at h` per fare due sostituzioni in un colpo e avrai `succ x = succ y`.

source: `a ≠ b` is *notation* for `(a = b) → False`. The reason this is mathematically valid is that if `P` is a true-false statement then `P → False` is the logical opposite of `P`. Indeed `True → False` is false, and `False → False` is true! The upshot of this is that use can treat `a ≠ b` in exactly the same way as you treat any implication `P → Q`. For example, if your *goal* is of the form `a ≠ b` then you can make progress with `intro h`, and if you have a hypothesis `h` of the form `a ≠ b` then you can `apply h at h1` if `h1` is a proof of `a = b`.
it: `a ≠ b` è *notazione* per `(a = b) → False`. Questa interpretazione è valida in matematica perché se `P` è una proposizione vero-falso allora `P → False` è la negazione logica di `P`. Infatti `True → False` è falso, e `False → False` è vero! Il vantaggio di questa notazione è che possiamo trattare una disuguaglianza `a ≠ b` come se fosse un implicazione `P → Q`, che sappiamo già come manipolare. Ad esempio, se il tuo *goal* è una disuguaglianza `a ≠ b`, puoi fare progresso con `intro h`, e se un'ipotesi `h` è una disuguaglianza `a ≠ b` allora puoi fare `apply h at h1` se `h1` è la prova di di `a = b`.
