Repository: leanprover-community/NNG4
Catalog: .i18n/*/Game.po
Languages: fr, it, uk, zh

source: Did you use induction on `y`? Here's a two-line proof of `add_left_eq_self` which uses `add_right_cancel`. If you want to inspect it, you can go into editor mode by clicking `</>` in the top right and then just cut and paste the proof and move your cursor around it to see the hypotheses and goal at any given point (although you'll lose your own proof this way). Click `>_` to get back to command line mode. ``` nth_rewrite 2 [← zero_add y] exact add_right_cancel x 0 y ```
fr: Avez-vous utilisé l'induction sur `y` ? Voici une preuve en deux lignes de `add_left_eq_self` qui utilise `add_right_cancel`. Si vous voulez l'inspecter, vous pouvez passer en mode éditeur en cliquant sur `</>` en haut à droite puis copier et coller la preuve et déplacer votre curseur autour pour voir les hypothèses et le but à n'importe quel point (bien que vous perdiez ainsi votre propre preuve). Cliquez sur `>_` pour revenir en mode ligne de commande. ``` nth_rewrite 2 [← zero_add y] exact add_right_cancel x 0 y ```
it: Per caso hai fatto induzione su `y`? Ecco una dimostrazione in due righe `add_left_eq_self` che sfrutta `add_right_cancel`. Se vuoi vedere come funziona, vai in editor mode cliccando su `</>` in alto a destra, copia e incolla la mia dimostrazione e muoviti tra le linee con il cursore per vedere le ipotesi e il goal in ogni punto (prima salva la tua dimostrazione però, altrimenti la perdi). Premi su `>_` per tornare alla modalità command line. ``` nth_rewrite 2 [← zero_add y] exact add_right_cancel x 0 y ```
uk: Ви використовували індукцію на `y`? Ось дворядковий доказ `add_left_eq_self`, який використовує `add_right_cancel`. Якщо ви хочете перевірити його, ви можете перейти в режим редактора, натиснувши `</>` у верхньому правому куті а потім просто виріжте та вставте доказ і перемістіть курсор навколо нього щоб побачити гіпотези та мету в будь-якій точці (хоча таким чином ви втратите свій власний доказ). Натисніть `>_`, щоб повернутися назад до режиму командного рядка. ``` nth_rewrite 2 [← zero_add y] exact add_right_cancel x 0 y ```
zh: 你是否对 `y` 使用了归纳法？ 这里有一个使用 `add_right_cancel` 证明 `add_left_eq_self`的两行证明。如果你想查看它，你可以通过点击右上角的 `</>` 进入编辑器模式，然后只需剪切和粘贴证明，并在其周围移动你的光标，以查看在任何给定点的假设和目标（尽管这样做你会失去自己的证明）。点击 `>_` 返回命令行模式。 ``` nth_rewrite 2 [← zero_add y] exact add_right_cancel x 0 y ```

source: `add_right_eq_self x y` is the theorem that $x + y = x \implies y=0.$
fr: `add_right_eq_self x y` est le théorème que $x + y = x \implies y=0.$
it: `add_right_eq_self x y` è il teorema $x + y = x \implies y=0.$
uk: `add_right_eq_self x y` це теорема про те, що $x + y = x \implies y=0.$
zh: `add_right_eq_self x y` 是表示 $x + y = x\implies y=0$ 的定理。

source: `add_right_eq_self x y` is the theorem that $x + y = x\implies y=0.$ Two ways to do it spring to mind; I'll mention them when you've solved it.
fr: `add_right_eq_self x y` est le théorème que $x + y = x\implies y=0$. Deux façons de le faire me viennent à l'esprit ; je les mentionnerai quand vous l'aurez résolu.
it: `add_right_eq_self x y` è il teorema $x + y = x\implies y=0.$ Mi vengono in mente due modi per dimostrarlo, ma te li dirò una volta che lo dimostri.
uk: `add_right_eq_self x y` це теорема про те, що $x + y = x\implies y=0.$ Два способи довести це спадають на думку; Я згадаю їх, коли ви її розв’яжете.
zh: `add_right_eq_self x y` 是 $x + y = x\implies y=0$ 的定理。我想到了两种方法，等你解出来了我再提。

source: This state is not provable! Did you maybe use `rw [add_left_eq_self] at h` instead of `apply [add_left_eq_self] at h`? You can complare the two in the inventory.
fr: Cet état n'est pas prouvable ! Avez-vous peut-être utilisé `rw [add_left_eq_self] at h` au lieu de `apply [add_left_eq_self] at h` ? Vous pouvez comparer les deux dans l'inventaire.
it: Questo stato non è dimostrabile! Per caso hai usato `rw [add_left_eq_self] at h` anziché `apply [add_left_eq_self] at h`? Puoi confrontare il loro effetto nell'inventario.
uk: Цей стан не піддається доведенню! Можливо, ви використали `rw [add_left_eq_self] у h` замість `apply [add_left_eq_self] at h`? Ви можете порівняти це дві штуки в інвентарі.

source: Here's a proof using `add_left_eq_self`: ``` rw [add_comm] intro h apply add_left_eq_self at h exact h ``` and here's an even shorter one using the same idea: ``` rw [add_comm] exact add_left_eq_self y x ``` Alternatively you can just prove it by induction on `x`: ``` induction x with d hd intro h rw [zero_add] at h exact h intro h rw [succ_add] at h apply succ_inj at h apply hd at h exact h ```
fr: Voici une preuve utilisant `add_left_eq_self` : ``` rw [add_comm] intro h apply add_left_eq_self at h exact h ``` et en voici une encore plus courte utilisant la même idée : ``` rw [add_comm] exact add_left_eq_self y x ``` Alternativement, vous pouvez simplement le prouver par induction sur `x` : ``` induction x with d hd intro h rw [zero_add] at h exact h intro h rw [succ_add] at h apply succ_inj at h apply hd at h exact h ```
uk: Ось доказ за допомогою `add_left_eq_self`: ``` rw [add_comm] intro h apply add_left_eq_self at h exact h ``` а ось ще коротший із використанням тієї ж ідеї: ``` rw [add_comm] exact add_left_eq_self y x ``` Крім того, ви можете просто довести це індукцією по `x`: ``` induction x with d hd intro h rw [zero_add] at h exact h intro h rw [succ_add] at h apply succ_inj at h apply hd at h exact h ```

source: The next result we'll need in `≤` World is that if `a + b = 0` then `a = 0` and `b = 0`. Let's prove one of these facts in this level, and the other in the next. ## A new tactic: `cases` The `cases` tactic will split an object or hypothesis up into the possible ways that it could have been created. For example, sometimes you want to deal with the two cases `b = 0` and `b = succ d` separately, but don't need the inductive hypothesis `hd` that comes with `induction b with d hd`. In this situation you can use `cases b with d` instead. There are two ways to make a number: it's either zero or a successor. So you will end up with two goals, one with `b = 0` and one with `b = succ d`. Another example: if you have a hypothesis `h : False` then you are done, because a false statement implies any statement. Here `cases h` will close the goal, because there are *no* ways to make a proof of `False`! So you will end up with no goals, meaning you have proved everything.
fr: Le prochain résultat dont nous aurons besoin dans le monde `≤` est que si `a + b = 0` alors `a = 0` et `b = 0`. Prouvons l'un de ces faits dans ce niveau, et l'autre dans le prochain. ## Une nouvelle tactique : `cases` La tactique `cases` divisera un objet ou une hypothèse selon les façons possibles dont il aurait pu être créé. Par exemple, parfois vous voulez traiter les deux cas `b = 0` et `b = succ d` séparément, mais n'avez pas besoin de l'hypothèse d'induction `hd` qui vient avec `induction b with d hd`. Dans cette situation, vous pouvez utiliser `cases b with d` à la place. Il y a deux façons de créer un nombre : soit zéro, soit un successeur. Vous vous retrouverez donc avec deux buts, un avec `b = 0` et un avec `b = succ d`. Autre exemple : si vous avez une hypothèse `h : False`, alors vous avez terminé, car un énoncé faux implique n'importe quel énoncé. Ici, `cases h` fermera le but, car il n'y a *aucune* façon de faire une preuve de `False` ! Vous vous retrouverez donc sans buts, ce qui signifie que vous avez tout prouvé.
it: Il prossimo risultato di cui abbiamo bisogno per il Mondo `≤` è: se `a + b = 0` allora `a = 0` e `b = 0`. In questo livello dimostriamo solo la prima parte della conclusione, la seconda nel livello successivo. ## Nuova tattica: `cases` La tattica `cases` scompone un oggetto o un'ipotesi in tutti i modi possibili in cui può essere stato creato. Ad esempio, su un numero naturale a volte è sufficiente ragionare con i due casi `b = 0` e `b = succ d` separatamente, tralasciando l'ipotesi induttiva `hd` prodotta da `induction b with d hd`. In questa situazione puoi usare `cases b with d`. Ci sono due modi per creare un numero: come zero o come successore di qualcosa. `case` riprodurrà proprio queste due alternative, spezzando la dimostrazione in due sotto-goal, uno con l'ipotesi `b = 0` e un'altro con l'ipotesi `b = succ d`. Chiariamo con un altro esempio: se hai l'ipotesi `h : False` allora hai finito, perché un'affermazione falsa implica qualsiasi cosa. Qua `cases h` chiuderà la dimostrazione, perché *non* vi è alcun modo di costruire una dimostrazione di `False`! Quindi rimarrai con zero sotto-goal da dimostrare, ossia hai dimostrato tutto.
uk: Наступним результатом, який нам знадобиться в Світі `≤`, буде те, що якщо `a + b = 0`, то `a = 0` і `b = 0`. Давайте доведемо один із цих фактів на цьому рівні, а інший – на наступному. ## Нова тактика: `cases`. Тактика `cases` розбиває об’єкт або гіпотезу на можливі шляхи якими його можна було створити. Наприклад, іноді ви хочете мати справу з двома випадками `b = 0` і `b = succ d` окремо, але не потрібна індуктивна гіпотеза `hd`, яка постачається з `induction b with d hd`. У цій ситуації замість цього можна використовувати `cases b with d`. Є два способи зробити число: або нуль, або наступник. Таким чином, ви матимете дві мети, одну з `b = 0` і одну з `b = succ d`. Інший приклад: якщо у вас є гіпотеза `h : False`, тоді ви закінчили, оскільки хибне твердження передбачає будь-яке твердження. Тут `cases h` закриють мету, тому що *немає* способів зробіть доказ `False`! Таким чином, ви залишитеся без цілей, тобто ви все довели.
zh: 在这一关中，让我们证明其中一个事实，而在下一关证明另一个。 ## 一种新的策略：`cases` `cases` 策略会将一个对象或假设分解为可能的创建方式。 例如，有时你想分别处理 `b = 0` 和 `b = succ d` 这两种情况，但不需要与 `induction b with d hd` 一起来的归纳假设 `hd`。在这种情况下，你可以使用 `cases b with d`。制造一个数字有两种方式：它要么是零，要么是后继者。所以你最终会得到两个目标，一个是 `b = 0`，另一个是 `b = succ d`。 另一个例子：如果你有一个假设 `h : False`，那么你就完成证明了，因为从 `False` 可以推出任何证明。这里 `cases h` 将证明目标，因为没有 *任何* 方法可以证明 `False`！所以你最终会没有目标，意味着你已经证明了一切。

source: ## Summary If `n` is a number, then `cases n with d` will break the goal into two goals, one with `n = 0` and the other with `n = succ d`. If `h` is a proof (for example a hypothesis), then `cases h with...` will break the proof up into the pieces used to prove it. ## Example If `n : ℕ` is a number, then `cases n with d` will break the goal into two goals, one with `n` replaced by 0 and the other with `n` replaced by `succ d`. This corresponds to the mathematical idea that every natural number is either `0` or a successor. ## Example If `h : P ∨ Q` is a hypothesis, then `cases h with hp hq` will turn one goal into two goals, one with a hypothesis `hp : P` and the other with a hypothesis `hq : Q`. ## Example If `h : False` is a hypothesis, then `cases h` will turn one goal into no goals, because there are no ways to make a proof of `False`! And if you have no goals left, you have finished the level. ## Example If `h : a ≤ b` is a hypothesis, then `cases h with c hc` will create a new number `c` and a proof `hc : b = a + c`. This is because the *definition* of `a ≤ b` is `∃ c, b = a + c`.
fr: ## Résumé Si `n` est un nombre, `cases n with d` scindera le but en deux sous-buts : un avec `n = 0` et l'autre avec `n = succ d`. Si `h` est une preuve (par exemple une hypothèse), `cases h with...` décomposera la preuve en ses éléments constitutifs. ## Exemple Si `n : ℕ` est un nombre, `cases n with d` scindera le but en deux sous-buts : un où `n` est remplacé par 0 et l'autre où `n` est remplacé par `succ d`. Cela correspond à l'idée mathématique que tout nombre naturel est soit `0` soit un successeur. ## Exemple Si `h : P ∨ Q` est une hypothèse, `cases h with hp hq` transformera un but en deux buts : un avec l'hypothèse `hp : P` et l'autre avec l'hypothèse `hq : Q`. ## Exemple Si `h : False` est une hypothèse, `cases h` fera disparaître le but actuel, car il n'existe aucun moyen de construire une preuve de `False` ! Et s'il ne reste aucun but, vous avez terminé le niveau. ## Exemple Si `h : a ≤ b` est une hypothèse, `cases h with c hc` créera un nouveau nombre `c` et une preuve `hc : b = a + c`. Ceci parce que la *définition* de `a ≤ b` est `∃ c, b = a + c`.
it: ## Descrizione Se `n` è un numero, allora `cases n with d` spezzerà il goal in due goal, uno dove `n = 0` e un altro dove `n = succ d`. Se `h` è una dimostrazione (per esempio tra le ipotesi), allora `cases h with...` spezzerà la dimostrazione in tante parti quante quanti i modi di derivare `h`. ## Esempio Se `n : ℕ` è un numero, allora `cases n with d` spezzerà il goal in due subgoal, uno dove `n` è stato rimpiazzato da 0 e l'altro dove `n` è stato rimpiazzato da `succ d`. Questo corrisponde all'intuizione matematica che ogni numero naturale è o `0` oppure un successore. ## Esempio Se `h : P ∨ Q` è un'ipotesi, allora `cases h with hp hq` trasformerà il goal in due goal, uno con l'ipotesi `hp : P` e l'altro con l'ipotesi `hq : Q`. ## Esempio Se `h : False` è un'ipotesi, allora `cases h` trasformerà il goal in zero goal, perché non vi è alcun modo di dimostrare `False`! E se rimani con zero cose da dimostrare vuol dire che hai completato il livello. ## Esempio Se `h : a ≤ b` è un'ipotesi, allora `cases h with c hc` istanzierà un nuovo numero `c` e una dimostrazione di `hc : b = a + c`. Questo deriva dalla *definizione* di `a ≤ b`, che è `∃ c, b = a + c`.
uk: ## Резюме Якщо `n` є числом, тоді `cases n with d` розділять мету на дві, одна із `n = 0`, а інша з `n = succ d`. Якщо `h` є доказом (наприклад, гіпотезою), то `cases h with...` розіб'є докази на частини, які будуть використовуватися для доказу. ## Приклад Якщо `n : ℕ` є числом, тоді `cases n with d` розділять мету на дві мети, одна із `n`, заміненим на 0, а інша із `n`, заміненим на `succ d`. Це відповідає математичній ідеї, що кожне натуральне число дорівнює або `0` або наступнику. ## Приклад Якщо `h : P ∨ Q` є гіпотезою, то `cases h with hp hq` перетворять одну мету на дві мети, одна з гіпотезою `hp : P`, а інша з a гіпотезою `hq : Q`. ## Приклад Якщо `h : False` є гіпотезою, то `cases h` перетворять одну мету на відсутність мети, тому що немає способів зробити доказ `False`! І якщо у вас не залишилося мети, ви закінчили рівень. ## Приклад Якщо `h : a ≤ b` є гіпотезою, то `cases h with c hc` створять нове число `c` і доказ `hc : b = a + c`. Це тому, що *визначення* `a ≤ b` таке `∃ c, b = a + c`.
zh: ## 概述 如果 `n` 是一个数字，那么 `cases n with d` 会将目标分解成两个目标，一个是 `n = 0`，另一个是 `n = succ d`。 如果 `h` 是一个证明（例如一个假设），那么 `cases h with...` 会将证明分解成用来证明它的各个部分。 ## 示例 如果 `n : ℕ` 是一个数字，那么 `cases n with d` 会将目标分解成两个目标，一个是 `n` 被替换为 0，另一个是 `n` 被替换为 `succ d`。这对应于数学上的观点，即每个自然数要么是 `0`，要么是一个后继数。 ## 示例 如果 `h : P ∨ Q` 是一个假设，那么 `cases h with hp hq` 会将一个目标变成两个目标，一个有假设 `hp : P`，另一个有假设 `hq : Q`。 ## 示例 如果 `h : False` 是一个假设，那么 `cases h` 会将一个目标变成没有目标，因为没有方法可以证明 `False`！如果你没有剩余的目标，你就完成了这个关卡。 ## 示例 如果 `h : a ≤ b` 是一个假设，那么 `cases h with c hc` 会创建一个新的数字 `c` 和一个证明 `hc : b = a + c`。这是因为 `a ≤ b` 的*定义*是 `∃ c, b = a + c`。

source: A proof that $a+b=0 \implies a=0$.
fr: Une preuve que $a+b=0 \implies a=0$.
it: Una dimostrazione di $a+b=0 \implies a=0$.
uk: Доказ того, що $a+b=0 \implies a=0$.
zh: 一个 $a+b=0 \implies a=0$ 的证明。

source: If $a+b=0$ then $a=0$.
fr: Si $a+b=0$ alors $a=0$.
it: Se $a+b=0$ allora $a=0$.
uk: Якщо $a+b=0$, тоді $a=0$.
zh: 如果 $a+b=0$ 那么 $a=0$。

source: Here we want to deal with the cases `b = 0` and `b ≠ 0` separately, so start with `cases b with d`.
fr: Ici, nous voulons traiter les cas `b = 0` et `b ≠ 0` séparément, donc commencez par `cases b with d`.
it: Qui vogliamo ragionare separatamente con i due casi `b = 0` e `b ≠ 0`, quindi parti con `cases b with d`.
uk: Тут ми хочемо розглянути випадки `b = 0` і `b ≠ 0` окремо, тому почніть із `cases b with d`.
zh: 在这里，我们想要分别处理 `b = 0` 和 `b ≠ 0` 的情况， 所以从 `cases b with d` 开始。

source: Well done!
fr: Bien joué !
it: Ottimo lavoro!
uk: Гарна робота!
zh: 做得好！

source: You can just mimic the previous proof to do this one -- or you can figure out a way of using it.
fr: Vous pouvez simplement imiter la preuve précédente pour celui-ci -- ou trouver un moyen de l'utiliser.
it: Puoi imitare la dimostrazione precedente per risolvere questa qua -- oppure potresti cercare un modo di applicarla.
uk: Ви можете просто імітувати попередній доказ, щоб виконати це завдання -- або ви можете знайти спосіб використати його.
zh: 你可以模仿之前的证明来完成这个——或者你可以想出一种方法 使用之前的证明。

source: A proof that $a+b=0 \implies b=0$.
fr: Une preuve que $a+b=0 \implies b=0$.
it: Una dimostrazione di $a+b=0 \implies b=0$.
uk: Доказ того, що $a+b=0 \implies b=0$.
zh: 一个$a+b=0 \implies b=0$的证明。

source: If $a+b=0$ then $b=0$.
fr: Si $a+b=0$ alors $b=0$.
it: Se $a+b=0$ allora $b=0$.
uk: Якщо $a+b=0$, то $b=0$.
zh: 如果 $a+b=0$ 那么 $b=0$。

source: How about this for a proof: ``` rw [add_comm] exact add_right_eq_zero b a ``` That's the end of Advanced Addition World! You'll need these theorems for the next world, `≤` World. Click on "Leave World" to access it.
fr: Que pensez-vous de cette preuve : ``` rw [add_comm] exact add_right_eq_zero b a ``` C'est la fin du monde de l'Addition Avancée ! Vous aurez besoin de ces théorèmes pour le prochain monde, le monde `≤`. Cliquez sur "Quitter le monde" pour y accéder.
it: Come ti sembra questa dimostrazione: ``` rw [add_comm] exact add_right_eq_zero b a ``` Questo è tutto per il Mondo Addizione Avanzata! I teoremi di questo mondo ti torneranno utili nel prossimo mondo, il Mondo `≤`. Clicca su "Abbandona mondo" per navigarci.
uk: Як щодо цього доказу: ``` rw [add_comm] exact add_right_eq_zero b a ``` Ось і кінець Світу розширеного додавання! Вам знадобляться ці теореми для наступного світу, Світу `≤`. Натисніть «Залишити світ», щоб отримати до нього доступ.
zh: 这个证明怎么样： ``` rw [add_comm] exact add_right_eq_zero b a ``` 这里就是高级加法世界的结尾了！你将带着这些定理 进入下一个世界，`≤` 世界。点击“离开世界”来访问它。

source: Advanced Addition World
fr: Monde de l'Addition Avancée
it: Mondo Addizione Avanzata
uk: Світ розширеного додавання
zh: 高级加法世界

source: In Advanced Addition World we will prove some basic addition facts such as $x+y=x\implies y=0$. The theorems proved in this world will be used to build a theory of inequalities in `≤` World. Click on "Start" to proceed.
fr: Dans le monde de l'Addition Avancée, nous prouverons des faits de base sur l'addition comme $x+y=x\implies y=0$. Les théorèmes prouvés dans ce monde seront utilisés pour construire une théorie des inégalités dans le monde `≤`. Cliquez sur "Commencer" pour continuer.
it: Nel Mondo Addizione Avanzata dimostreremo delle proprietà basilari dell'addizione come $x+y=x\implies y=0$. I teoremi dimostrati in questo mondo servono da mattoncini teorici con cui costruiremo la teoria delle disuguaglianze nel Mondo `≤`. Premi su "Via" per iniziare.
uk: У Світі розширеного додавання ми доведемо деякі базові факти додавання, як $x+y=x\implies y=0$. Теореми доведені в цьому світі будуть використані для будівництва теорія нерівностей у Світі `≤`. Натисніть «Почати», щоб продовжити.
zh: 在高级加法世界中，我们将证明一些基本的加法事实，如 $x+y=x\implies y=0$。在这个世界中证明的定理将被用来在 `≤` 世界中构建不等式理论。 点击“开始”继续。

source: The `use` tactic
fr: La tactique `use`
it: La tattica `use`
uk: Тактика `use`
zh: `use` 策略

source: ## Summary The `use` tactic makes progress with goals which claim something *exists*. If the goal claims that some `x` exists with some property, and you know that `x = 37` will work, then `use 37` will make progress. Because `a ≤ b` is notation for \"there exists `c` such that `b = a + c`\", you can make progress on goals of the form `a ≤ b` by `use`ing the number which is morally `b - a` (i.e. `use b - a`) Any of the following examples is possible assuming the type of the argument passed to the `use` function is accurate: - `use 37` - `use a` - `use a * a + 1`
fr: ## Résumé La tactique `use` fait progresser les buts qui affirement que quelque chose *existe*. Si le but affirme qu'un certain `x` existe avec une certaine propriété, et que vous savez que `x = 37` fonctionnera, alors `use 37` fera progresser. Comme `a ≤ b` est une notation pour "il existe `c` tel que `b = a + c`", vous pouvez faire progresser les buts de la forme `a ≤ b` en utilisant `use` avec le nombre qui moralement est `b - a` (c'est-à-dire `use b - a`) Tous les exemples suivants sont possibles en supposant que le type de l'argument passé à la fonction `use` est correct : - `use 37` - `use a` - `use a * a + 1`
uk: ## Резюме Тактика `use` сприяє досягненню тієї мети, яка стверджують, що щось *існує*. Якщо мета стверджує, що деякий `x` існує з певною властивістю, і ви знаєте що `x = 37` буде працювати, тоді `use 37` досягне успіху. Оскільки `a ≤ b` є записом для \"існує `c` таке, що `b = a + c`\", ви можете прогресувати у досягненні цілей виду `a ≤ b`, `use`-аючи` число, яке морально є `b - a` (тобто `use b - a`) Будь-який із наведених нижче прикладів можливий за умови, що тип аргументу, переданого функції `use`, правильний: - `use 37` - `use a` - `use a * a + 1`

source: `a ≤ b` is *notation* for `∃ c, b = a + c`. Because this game doesn't have negative numbers, this definition is mathematically valid. This means that if you have a goal of the form `a ≤ b` you can make progress with the `use` tactic, and if you have a hypothesis `h : a ≤ b`, you can make progress with `cases h with c hc`.
fr: `a ≤ b` est une *notation* pour `∃ c, b = a + c`. Comme ce jeu n'a pas de nombres négatifs, cette définition est mathématiquement valide. Cela signifie que si vous avez un but de la forme `a ≤ b`, vous pouvez progresser avec la tactique `use`, et si vous avez une hypothèse `h : a ≤ b`, vous pouvez progresser avec `cases h with c hc`.
it: `a ≤ b` è *notazione* per `∃ c, b = a + c`. Dato che in questo gioco non abbiamo i numeri negativi, questa definizione è matematicamente valida. Una conseguenza pratica di tale definizione è che se hai un goal della forma `a ≤ b` puoi scomporlo con la tattica `use`, e se hai un'ipotesi `h : a ≤ b`, puoi scomporla tramite `cases h with c hc`.
uk: `a ≤ b` є *нотацією* для `∃ c, b = a + c`. Томущо ця гра не має від’ємних чисел, це визначення є математично дійсним. Це означає, що якщо у вас є ціль у формі `a ≤ b`, ви можете просунутися за допомогою тактики `use`, а також якщо у вас є гіпотеза `h : a ≤ b`, ви можете досягти прогресу з `cases h with c hc`.
zh: `a ≤ b` 是 `∃ c, b = a + c` 的*符号表示*。 因为这个游戏没有负数，这个定义在数学上是有效的。 这意味着如果你有一个形式为 `a ≤ b` 的目标，你可以用 `use` 策略来取得进展，如果你有一个假设 `h : a ≤ b`，你可以用 `cases h with c hc` 来取得进展。

source: `a ≤ b` is *notation* for `∃ c, b = a + c`. This "backwards E" means "there exists". So `a ≤ b` means that there exists a number `c` such that `b = a + c`. This definition works because there are no negative numbers in this game. To *prove* an "exists" statement, use the `use` tactic. Let's see an example.
fr: `a ≤ b` est une *notation* pour `∃ c, b = a + c`. Ce "E à l'envers" signifie "il existe". Ainsi, `a ≤ b` signifie qu'il existe un nombre `c` tel que `b = a + c`. Cette définition fonctionne car il n'y a pas de nombres négatifs dans ce jeu. Pour *prouver* une affirmation "il existe", utilisez la tactique `use`. Voyons un exemple.
it: `a ≤ b` è *notazione* per `∃ c, b = a + c`. La "E rovesciata" si legge "esiste". Quindi `a ≤ b` vuol dire che esiste un numero `c` tale che `b = a + c`. Questa definizione è valida perché non abbiamo i numeri negativi in questo gioco. Per *dimostrare* un "esiste", puoi usare la tattica `use`. Vediamo un esempio.
uk: `a ≤ b` є *нотацією* для `∃ c, b = a + c`. Це "записне у зворотньому напрямку E" означає «існує». Отже, `a ≤ b` означає, що існує число `c` таке, що `b = a + c`. Це визначення працює тому що в цій грі немає від'ємних чисел. Щоб *довести* твердження «існує», використовуйте тактику `use`. Давайте розглянемо приклад.
zh: `a ≤ b` 是 `∃ c, b = a + c` 的*符号表示*。这个“倒 E”代表“存在”。所以 `a ≤ b` 意味着存在一个数字 `c` 使得 `b = a + c`。这个定义有效是因为在这个游戏中没有负数。 要*证明*一个“存在性”定理，可以使用 `use` 策略。 让我们看一个例子。
