Repository: leanprover-community/NNG4
Catalog: .i18n/*/Game.po
Languages: fr, it, uk, zh

source: In the "base case" we have a hypothesis `ha : 0 ≠ 0`, and you can deduce anything from a false statement. The `tauto` tactic will close this goal.
fr: Dans le "cas de base", nous avons une hypothèse `ha : 0 ≠ 0`, et vous pouvez déduire n'importe quoi d'un énoncé faux. La tactique `tauto` fermera ce but.
it: Nel "caso base" abbiamo un'ipotesi `ha : 0 ≠ 0`, e sappiamo che puoi dedurre qualsiasi cosa da una proposizione falsa. La tattica `tauto` chiuderà il goal.
uk: У «базовому випадку» ми маємо гіпотезу `ha : 0 ≠ 0`, і ви можете вивести будь-що із хибного твердження. Тактика `tauto` закриє цю мету.
zh: 在“基础情形”中，我们有一个假设 `ha : 0 ≠ 0`，你可以从一个假命题中推导出任何东西。`tauto` 策略将证明这个目标。

source: `one_le_of_ne_zero a` is a proof that `a ≠ 0 → 1 ≤ a`.
fr: `one_le_of_ne_zero a` est une preuve que `a ≠ 0 → 1 ≤ a`.
it: `one_le_of_ne_zero a` è la dimostrazione che `a ≠ 0 → 1 ≤ a`.
uk: `one_le_of_ne_zero a` це доказ того, що `a ≠ 0 → 1 ≤ a`.
zh: `one_le_of_ne_zero a` 是 `a≠0 → 1≤a` 的证明。

source: The previous lemma can be used to prove this one.
fr: Le lemme précédent peut être utilisé pour prouver celui-ci.
it: Il lemma precedente può essere usato per dimostrare questo.
uk: Можна використати попередню лему для доведення цієї.
zh: 先前的引理可以用来证明这个引理。

source: Use the previous lemma with `apply eq_succ_of_ne_zero at ha`.
fr: Utilisez le lemme précédent avec `apply eq_succ_of_ne_zero at ha`.
it: Usa il lemma precedente con `apply eq_succ_of_ne_zero at ha`.
uk: Використовуйте попередню лему з `apply eq_succ_of_ne_zero at ha`.
zh: 通过`apply eq_succ_of_ne_zero at ha`来使用前面的引理。

source: Now take apart the existence statement with `cases ha with n hn`.
fr: Maintenant, décomposez l'énoncé d'existence avec `cases ha with n hn`.
it: Ora scomponi l'ipotesi esistenziale con `cases ha with n hn`.
uk: Тепер розберіть твердження існування за допомогою `cases ha with n hn`.
zh: 现在用 `cases ha with n hn` 分类讨论存在性定理。

source: `le_mul_right a b` is a proof that `a * b ≠ 0 → a ≤ a * b`. It's one way of saying that a divisor of a positive number has to be at most that number.
fr: `le_mul_right a b` est une preuve que `a * b ≠ 0 → a ≤ a * b`. C'est une façon de dire qu'un diviseur d'un nombre positif doit être au plus égal à ce nombre.
it: `le_mul_right a b` è la dimostrazione che `a * b ≠ 0 → a ≤ a * b`. È un modo di dire che un divisore di un numero positivo dev'essere per forza al massimo il numero stesso.
uk: `le_mul_right a b` є доказом того, що `a * b ≠ 0 → a ≤ a * b`. Це один із способів сказати, що дільник додатного числа має бути не більше цього числа.
zh: `le_mul_right a b` 是 `a * b ≠ 0 → a ≤ a * b` 的证明。 这是表达一个正数的除数不会大于这个数的一种方式。

source: One day this game will have a Prime Number World, with a final boss of proving that $2$ is prime. To do this, we will have to rule out things like $2 = 37 × 42.$ We will do this by proving that any factor of $2$ is at most $2$, which we will do using this lemma. The proof I have in mind manipulates the hypothesis until it becomes the goal, using `mul_left_ne_zero`, `one_le_of_ne_zero` and `mul_le_mul_right`.
fr: Un jour, ce jeu aura un monde des Nombres Premiers, avec un boss final prouvant que $2$ est premier. Pour cela, nous devrons exclure des choses comme $2 = 37 × 42$. Nous ferons cela en prouvant que tout facteur de $2$ est au plus $2$, en utilisant ce lemme. La preuve que j'ai en tête manipule l'hypothèse jusqu'à ce qu'elle devienne le but, en utilisant `mul_left_ne_zero`, `one_le_of_ne_zero` et `mul_le_mul_right`.
uk: Одного разу в цій грі з’явиться світ простих чисел із останнім босом доведення того, що $2$ є простим числом. Для цього нам доведеться виключити такі речі, як $2 = 37 × 42.$ Ми зробимо це, довівши, що будь-який множник $2$ не перевищує $2$, що ми зробимо, використовуючи цю лему. Доказ, який я маю на увазі, маніпулює гіпотезою поки це не стане метою, використовуючи `mul_left_ne_zero`, `one_le_of_ne_zero` та `mul_le_mul_right`.

source: Here's what I was thinking of: ``` apply mul_left_ne_zero at h apply one_le_of_ne_zero at h apply mul_le_mul_right 1 b a at h rw [one_mul, mul_comm] at h exact h ```
fr: Voici ce que j'avais en tête : ``` apply mul_left_ne_zero at h apply one_le_of_ne_zero at h apply mul_le_mul_right 1 b a at h rw [one_mul, mul_comm] at h exact h ```
it: Ecco quello che avevo in mente: ``` apply mul_left_ne_zero at h apply one_le_of_ne_zero at h apply mul_le_mul_right 1 b a at h rw [one_mul, mul_comm] at h exact h ```
uk: Ось про що я думав: ``` apply mul_left_ne_zero at h apply one_le_of_ne_zero at h apply mul_le_mul_right 1 b a at h rw [one_mul, mul_comm] at h exact h ```
zh: 我是这么想的： ``` apply mul_left_ne_zero at h apply one_le_of_ne_zero at h apply mul_le_mul_right 1 b a at h rw [one_mul, mul_comm] at h exact h ```

source: # Summary The `have` tactic can be used to add new hypotheses to a level, but of course you have to prove them. ## Example The simplest usage is like this. If you have `a` in your context and you execute `have ha : a = 0` then you will get a new goal `a = 0` to prove, and after you've proved it you will have a new hypothesis `ha : a = 0` in your original goal. ## Example If you already have a proof of what you want to `have`, you can just create it immediately. For example, if you have `a` and `b` number objects, then `have h2 : succ a = succ b → a = b := succ_inj a b` will directly add a new hypothesis `h2 : succ a = succ b → a = b` to the context, because you just supplied the proof of it (`succ_inj a b`). ## Example If you have a proof to hand, then you don't even need to state what you are proving. For example `have h2 := succ_inj a b` will add `h2 : succ a = succ b → a = b` as a hypothesis.
fr: # Résumé La tactique `have` permet d'ajouter de nouvelles hypothèses à un niveau, mais vous devez bien sûr les prouver. ## Exemple L'utilisation la plus simple est la suivante. Si vous avez `a` dans votre contexte et que vous exécutez `have ha : a = 0` alors vous obtiendrez un nouveau but `a = 0` à prouver, et après l'avoir prouvé vous aurez une nouvelle hypothèse `ha : a = 0` dans votre but initial. ## Exemple Si vous avez déjà une preuve de ce que vous voulez obtenir avec `have`, vous pouvez la créer immédiatement. Par exemple, si vous avez des objets numériques `a` et `b`, alors `have h2 : succ a = succ b → a = b := succ_inj a b` ajoutera directement une nouvelle hypothèse `h2 : succ a = succ b → a = b` dans le contexte, car vous avez fourni sa preuve (`succ_inj a b`). ## Exemple Si vous avez une preuve sous la main, vous n'avez même pas besoin d'énoncer ce que vous prouvez. Par exemple `have h2 := succ_inj a b` ajoutera `h2 : succ a = succ b → a = b` comme hypothèse.
uk: # Резюме Тактику `have` можна використовувати для додавання нових гіпотез до рівня, але звичайно ви повинні довести їх. ## Приклад Найпростіше використання таке. Якщо у вашому контексті є `a` і ви виконуєте `have ha : a = 0` тоді ви отримаєте нову ціль `a = 0`, щоб довести, і після того, як ви доведете її ви матимете нову гіпотезу `ha : a = 0` у вашій початковій меті. ## Приклад Якщо у вас уже є доказ того, що ви хочете "мати", ви можна просто створити його негайно. Наприклад, якщо у вас є `a` і `b` число предметів, то `have h2 : succ a = succ b → a = b := succ_inj a b` безпосередньо додасть нову гіпотезу `h2 : succ a = succ b → a = b` до контексту, оскільки ви щойно надали доказ цього (`succ_inj a b`). ## Приклад Якщо у вас під рукою є докази, то вам навіть не потрібно вказувати, що ви доводите. Наприклад `have h2 := succ_inj a b` додасть `h2 : succ a = succ b → a = b` як гіпотезу.

source: `mul_right_eq_one a b` is a proof that `a * b = 1 → a = 1`.
fr: `mul_right_eq_one a b` est une preuve que `a * b = 1 → a = 1`.
it: `mul_right_eq_one a b` è la dimostrazione che `a * b = 1 → a = 1`.
uk: `mul_right_eq_one a b` є доказом того, що `a * b = 1 → a = 1`.
zh: `mul_right_eq_one a b`证明了`a * b = 1 → a = 1`。

source: This level proves `x * y = 1 → x = 1`, the multiplicative analogue of Advanced Addition World's `x + y = 0 → x = 0`. The strategy is to prove that `x ≤ 1` and then use the lemma `le_one` from `≤` world. We'll prove it using a new and very useful tactic called `have`.
fr: Ce niveau prouve `x * y = 1 → x = 1`, c'est l'analogue multiplicatif de `x + y = 0 → x = 0` du Monde de l'Addition Avancée. La stratégie consiste à prouver que `x ≤ 1` puis à utiliser le lemme `le_one` du monde `≤`. Nous le prouverons en utilisant une nouvelle tactique très utile appelée `have`.
it: Questo livello dimostra `x * y = 1 → x = 1`, l'analogo moltiplicativo del lemma `x + y = 0 → x = 0` incontrato del Mondo Addizione Avanzata. La strategia è dimostrare prima che `x ≤ 1` e poi usare il lemma `le_one` del Mondo `≤`. Lo dimostreremo con una nuova tattica assai utile, `have`.
uk: Цей рівень доводить `x * y = 1 → x = 1`, мультиплікативний аналог для `x + y = 0 → x = 0` із Світу розширеного додавання. Стратегія полягає в тому, щоб довести, що `x ≤ 1`, а потім використати лема `le_one` зі світу `≤`. Ми доведемо це за допомогою нової та дуже корисної тактики під назвою `have`.
zh: 在这个关卡，我们证明了 `x * y = 1 → x = 1`，这是高级加法世界中 `x + y = 0 → x = 0` 的乘法类比。策略是证明 `x ≤ 1`，然后使用来自 `≤` 世界的引理 `le_one`。 我们将使用一个新的非常有用的策略叫做 `have` 来证明它。

source: We want to use `le_mul_right`, but we need a hypothesis `x * y ≠ 0` which we don't have. Yet. Execute `have h2 : x * y ≠ 0` (you can type `≠` with `\ne`). You'll be asked to prove it, and then you'll have a new hypothesis which you can apply `le_mul_right` to.
fr: Nous voulons utiliser `le_mul_right`, mais nous avons besoin d'une hypothèse `x * y ≠ 0` que nous n'avons pas encore. Exécutez `have h2 : x * y ≠ 0` (vous pouvez taper `≠` avec `\ne`). Vous devrez prouver cette hypothèse, puis vous disposerez d'une nouvelle hypothèse à laquelle appliquer `le_mul_right`.
it: Il piano è applicare `le_mul_right`, ma per farlo abbiamo bisogno dell'ipotesi `x * y ≠ 0` che non è presente tra le ipotesi, per ora. Esegui `have h2 : x * y ≠ 0` (digita `≠` tramite `\ne`). Lean ti chiederà di dimostrarlo, e dopo avrai un'ipotesi nuova di zecca a cui puoi applicare `le_mul_right`.
uk: Ми хочемо використовувати `le_mul_right`, але нам потрібна гіпотеза `x * y ≠ 0` якої у нас ще немає. Виконайте `have h2 : x * y ≠ 0` (ви можете ввести `≠` як `\ne`). Вас попросять доведіть це, і тоді у вас буде нова гіпотеза, яку ви зможете застосувати до `le_mul_right`.
zh: 我们想使用 `le_mul_right`，但我们需要一个我们还没有的假设 `x * y ≠ 0`。 现在执行 `have h2 : x * y ≠ 0`（你可以用 `\ne` 输入 `≠`）。 你将被要求证明它，然后你将有一个新的假设，你可以应用 `le_mul_right` 到这个假设上。

source: Now you can `apply le_mul_right at h2`.
fr: Maintenant vous pouvez utiliser `apply le_mul_right at h2`.
it: Ora puoi eseguire `apply le_mul_right at h2`.
uk: Тепер ви можете `apply le_mul_right at h2`.
zh: 现在，您可以`apply le_mul_right at h2`。

source: Now `rw [«{h}»] at «{h2}»` so you can `apply le_one at «{h2}»`.
fr: Maintenant `rw [«{h}»] at «{h2}»` pour pouvoir `apply le_one at «{h2}»`.
uk: Тепер `rw [«{h}»] at «{h2}»», щоб ви могли `apply le_one at «{h2}»`.

source: Now `cases h2 with h0 h1` and deal with the two cases separately.
fr: Maintenant `cases h2 with h0 h1` et traitez les deux cas séparément.
it: Ora `cases h2 with h0 h1` e lavora sui due casi separatamente.
uk: Тепер `cases h2 with h0 h1` і розберемося з двома випадками окремо.
zh: 现在使用 `cases h2 with h0 h1` a，并分类讨论这两种情况。

source: `tauto` is good enough to solve this goal.
fr: `tauto` est suffisant pour résoudre ce but.
it: `tauto` è in grado di risolvere questo goal.
uk: `tauto` достатньо хорош для вирішення цієї мети.
zh: `tauto` 足以证明这一目标。

source: `mul_ne_zero a b` is a proof that if `a ≠ 0` and `b ≠ 0` then `a * b ≠ 0`.
fr: `mul_ne_zero a b` est une preuve que si `a ≠ 0` et `b ≠ 0` alors `a * b ≠ 0`.
it: `mul_ne_zero a b` è la dimostrazione che se `a ≠ 0` e `b ≠ 0` allora `a * b ≠ 0`.
uk: `mul_ne_zero a b` є доказом того, що якщо `a ≠ 0` і `b ≠ 0`, то `a * b ≠ 0`.
zh: `mul_ne_zero a b` 是如果 `a ≠ 0` 且 `b ≠ 0`，那么 `a * b ≠ 0`证明。

source: This level proves that if `a ≠ 0` and `b ≠ 0` then `a * b ≠ 0`. One strategy is to write both `a` and `b` as `succ` of something, deduce that `a * b` is also `succ` of something, and then `apply zero_ne_succ`.
fr: Ce niveau prouve que si `a ≠ 0` et `b ≠ 0` alors `a * b ≠ 0`. Une stratégie consiste à écrire `a` et `b` comme `succ` de quelque chose, à déduire que `a * b` est aussi `succ` de quelque chose, puis à `apply zero_ne_succ`.
it: Questo livello dimostra che se `a ≠ 0` e `b ≠ 0` allora `a * b ≠ 0`. Una strategia vincente è riscrivere sia `a` che `b` come `succ` di qualcosa, dedurre che `a * b` è anche lui `succ` di qualcosa, e infine fare `apply zero_ne_succ`.
uk: Цей рівень доводить, що якщо `a ≠ 0` і `b ≠ 0`, то `a * b ≠ 0`. Одна стратегія це записати як `a`, так і `b` як `succ` чогось, зробити висновок, що `a * b` є також `succ` чогось, а потім `apply zero_ne_succ`.
zh: 这个关卡要证明如果 `a ≠ 0` 且 `b ≠ 0`，那么 `a * b ≠ 0`。 一种策略是将 `a` 和 `b` 都写成某物的 `succ`（后继），推断出 `a * b` 也是某物的 `succ`，然后应用 `zero_ne_succ`。

source: Start with `apply eq_succ_of_ne_zero at ha` and `... at hb`
fr: Commencez par `apply eq_succ_of_ne_zero at ha` et `... at hb`
it: Inizia con `apply eq_succ_of_ne_zero at ha` e `... at hb`
uk: Почніть із `apply eq_succ_of_ne_zero at ha` і `... at hb`
zh: 以`在 ha 处应用 eq_succ_of_ne_zero` 和`......在 hb` 开头

source: `mul_eq_zero a b` is a proof that if `a * b = 0` then `a = 0` or `b = 0`.
fr: `mul_eq_zero a b` est une preuve que si `a * b = 0` alors `a = 0` ou `b = 0`.
it: `mul_eq_zero a b` è la dimostrazione che se `a * b = 0` allora `a = 0` or `b = 0`.
uk: `mul_eq_zero a b` є доказом того, що якщо `a * b = 0`, то `a = 0` або `b = 0`.
zh: `mul_eq_zero a b` 证明如果 `a * b = 0` 则 `a = 0` 或 `b = 0`。

source: This level proves that if `a * b = 0` then `a = 0` or `b = 0`. It is logically equivalent to the last level, so there is a very short proof.
fr: Ce niveau prouve que si `a * b = 0` alors `a = 0` ou `b = 0`. C'est logiquement équivalent au niveau précédent, il existe donc une preuve très courte.
it: Questo livello dimostra che se `a * b = 0` allora `a = 0` or `b = 0`. È logicamente equivalente allo scorso livello, quindi puoi dare una dimostrazione veramente corta.
uk: Цей рівень доводить, що якщо `a * b = 0`, то `a = 0` або `b = 0`. Це логічно еквівалентно попередньому рівню, тому дуже короткий доказ.
zh: 这个关卡要证明如果 `a * b = 0` 那么 `a = 0` 或者 `b = 0`。这在逻辑上等同上一个关卡，所以有一个非常简短的证明。

source: Start with `have h2 := mul_ne_zero a b`.
fr: Commencez par `have h2 := mul_ne_zero a b`.
it: Inizia con `have h2 := mul_ne_zero a b`.
uk: Почніть із `have h2 := mul_ne_zero a b`.
zh: 从 `have h2 := mul_ne_zero a b` 开始。

source: Now the goal can be deduced from `h2` by pure logic, so use the `tauto` tactic.
fr: Maintenant le but peut être déduit de `h2` par pure logique, utilisez donc la tactique `tauto`.
it: Adesso il goal può essere dedotto da `h2` tramite pura logica, dunque usa la tattica `tauto`.
uk: Тепер мету можна вивести з `h2` чистою логікою, тому використовуйте тактику `tauto`.
zh: 现在，目标可以通过纯粹的逻辑从 `h2` 推导出来，所以使用 `tauto` 策略。

source: Here's the short proof: ``` have h2 := mul_ne_zero a b tauto ``` This works because, given `mul_ne_zero a b`, the argument is reduced to pure logic.
fr: Voici la preuve courte : ``` have h2 := mul_ne_zero a b tauto ``` Cela fonctionne car, étant donné `mul_ne_zero a b`, l'argument se réduit à de la pure logique.
uk: Ось короткий доказ: ``` have h2 := mul_ne_zero a b tauto ``` Це працює, тому що, маючи `mul_ne_zero a b`, аргументація зводиться до чистої логіки.

source: `mul_left_cancel a b c` is a proof that if `a ≠ 0` and `a * b = a * c` then `b = c`.
fr: `mul_left_cancel a b c` est une preuve que si `a ≠ 0` et `a * b = a * c` alors `b = c`.
it: `mul_left_cancel a b c` è la dimostrazione che se `a ≠ 0` e `a * b = a * c` allora `b = c`.
uk: `mul_left_cancel a b c` є доказом того, що якщо `a ≠ 0` і `a * b = a * c`, то `b = c`.
zh: `mul_left_cancel a b c` 证明了如果 `a ≠ 0` 且 `a * b = a * c` 则 `b = c` 。

source: In this level we prove that if `a * b = a * c` and `a ≠ 0` then `b = c`. It is tricky, for several reasons. One of these is that we need to introduce a new idea: we will need to understand the concept of mathematical induction a little better. Starting with `induction b with d hd` is too naive, because in the inductive step the hypothesis is `a * d = a * c → d = c` but what we know is `a * succ d = a * c`, so the induction hypothesis does not apply! Assume `a ≠ 0` is fixed. The actual statement we want to prove by induction on `b` is "for all `c`, if `a * b = a * c` then `b = c`". This *can* be proved by induction, because we now have the flexibility to change `c`.
fr: Dans ce niveau, nous prouvons que si `a * b = a * c` et `a ≠ 0` alors `b = c`. C'est difficile pour plusieurs raisons. L'une d'elles est que nous devons introduire une nouvelle idée : nous devons mieux comprendre le concept d'induction mathématique. Commencer par `induction b with d hd` est trop naïf, car à l'étape inductive l'hypothèse est `a * d = a * c → d = c` mais ce que nous savons est `a * succ d = a * c`, donc l'hypothèse d'induction ne s'applique pas ! Supposons `a ≠ 0` fixé. L'énoncé réel que nous voulons prouver par induction sur `b` est "pour tout `c`, si `a * b = a * c` alors `b = c`". Ceci *peut* être prouvé par induction, car nous avons maintenant la flexibilité de changer `c`.
uk: На цьому рівні ми доведемо, що якщо `a * b = a * c` і `a ≠ 0`, то `b = c`. Це складно, через кілька причин. Одна з них це що нам потрібно представити нову ідею: нам потрібно буде зрозуміти концепцію математична індукція трохи краще. Починати з `induction b with d hd` надто наївно, тому що в індуктивному кроці гіпотеза `a * d = a * c → d = c`, але те, що ми знаємо, це `a * succ d = a * c`, тому індуктивна гіпотеза не діє! Припустимо, що `a ≠ 0` фіксовано. Справжнє твердження, яке ми хочемо довести індукцією по `b`, таке "для всіх `c`, якщо `a * b = a * c`, тоді `b = c`". Це *можна* довести індукцією, тому що ми тепер маємо можливість змінити `c`.

source: The way to start this proof is `induction b with d hd generalizing c`.
fr: La façon de commencer cette preuve est `induction b with d hd generalizing c`.
it: Il modo giusto di aprire questa dimostrazione è `induction b with d hd generalizing c`.
uk: Спосіб розпочати це доведення – `induction b with d hd generalizing c`.
zh: 开始证明的方法是 `induction b with d hd generalizing c`。

source: Use `mul_eq_zero` and remember that `tauto` will solve a goal if there are hypotheses `a = 0` and `a ≠ 0`.
fr: Utilisez `mul_eq_zero` et souvenez-vous que `tauto` résoudra un but s'il y a des hypothèses `a = 0` et `a ≠ 0`.
it: Usa `mul_eq_zero` e ricorda che `tauto` risolve qualsiasi goal se hai le ipotesi contraddittorie `a = 0` e `a ≠ 0`.
uk: Використовуйте `mul_eq_zero` і пам’ятайте, що `tauto` вирішить ціль якщо є гіпотези `a = 0` і `a ≠ 0`.
zh: 使用 `mul_eq_zero` 并记住，如果存在假设 `a = 0` 和 `a ≠ 0`，那么 `tauto` 将解决一个目标。

source: The inductive hypothesis `hd` is "For all natural numbers `c`, `a * d = a * c → d = c`". You can `apply` it `at` any hypothesis of the form `a * d = a * ?`.
fr: L'hypothèse d'induction `hd` est "Pour tous les entiers naturels `c`, `a * d = a * c → d = c`". Vous pouvez l'utiliser avec `apply at` à toute hypothèse de la forme `a * d = a * ?`.
it: L'ipotesi induttiva `hd` è "Per tutti i numeri naturali `c`, `a * d = a * c → d = c`". Puoi sfruttarla con `apply` e `at` su un'ipotesi della forma `a * d = a * ?`.
uk: Індуктивна гіпотеза `hd` така: «Для всіх натуральних чисел `c`, `a * d = a * c → d = c`». Ви можете `apply` її `at` будь-якої гіпотези у вигляді `a * d = a * ?`.
zh: 归纳假设 `hd` 是“对于所有自然数 `c`，`a * d = a * c → d = c`”的证明。你可以在任何形式为 `a * d = a * ?` 的假设上应用（`apply`）它。

source: Split into cases `c = 0` and `c = succ e` with `cases c with e`.
fr: Séparez en cas `c = 0` et `c = succ e` avec `cases c with e`.
it: Suddividi la dimostrazione nei casi `c = 0` e `c = succ e` con `cases c with e`.
uk: Розділити на випадки `c = 0` і `c = succ e` з `cases c with e`.
zh: 用 `c cases c with e` 分成 `c = 0` 和 `c = succ e` 两种情况讨论。

source: `mul_right_eq_self a b` is a proof that if `a ≠ 0` and `a * b = a` then `b = 1`.
fr: `mul_right_eq_self a b` est une preuve que si `a ≠ 0` et `a * b = a` alors `b = 1`.
it: `mul_right_eq_self a b` è la dimostrazione che se `a ≠ 0` e `a * b = a` allora `b = 1`.
uk: `mul_right_eq_self a b` є доказом того, що якщо `a ≠ 0` і `a * b = a`, то `b = 1`.
zh: `mul_right_eq_self a b` 是命题如果 `a ≠ 0` 且 `a * b = a` 那么 `b = 1` 的证明。

source: The lemma proved in the final level of this world will be helpful in Divisibility World.
fr: Le lemme prouvé dans le niveau final de ce monde sera utile dans le Monde de la Divisibilité.
it: Il lemma dimostrato nel livello finale di questo mondo ci sarà d'aiuto nel Mondo Divisibilità.
uk: Лема, доведена на останньому рівні цього світу, буде корисною у Світі подільності.
zh: 在这个世界的最后一个关卡证明的引理将在可除性世界中很有帮助。

source: Reduce to the previous lemma with `nth_rewrite 2 [← mul_one a] at h`
fr: Réduisez au lemme précédent avec `nth_rewrite 2 [← mul_one a] at h`
it: Riduci al lemma precedente con `nth_rewrite 2 [← mul_one a] at h`
uk: Зведіть до попередньої леми за допомогою `nth_rewrite 2 [← mul_one a] at h`
zh: 使用 `nth_rewrite 2 [← mul_one a] at h` 将问题简化为之前的引理。

source: You can now `apply mul_left_cancel at h`
fr: Vous pouvez maintenant `apply mul_left_cancel at h`
it: Ora puoi fare `apply mul_left_cancel at h`
uk: Тепер ви можете виконати `apply mul_left_cancel at h`
zh: 现在您可以 `apply mul_left_cancel at h` 。

source: A two-line proof is ``` nth_rewrite 2 [← mul_one a] at h exact mul_left_cancel a b 1 ha h ``` We now have all the tools necessary to set up the basic theory of divisibility of naturals.
fr: Une preuve en deux lignes est : ``` nth_rewrite 2 [← mul_one a] at h exact mul_left_cancel a b 1 ha h ``` Nous avons maintenant tous les outils nécessaires pour établir la théorie de base sur la divisibilité des entiers naturels.
it: Una dimostrazione di due righe è la seguente ``` nth_rewrite 2 [← mul_one a] at h exact mul_left_cancel a b 1 ha h ``` Ora abbiamo tutti gli strumenti necessari per costruire la teoria basilare della divisibilità dei numeri naturali.
uk: Дворядковий доказ ``` nth_rewrite 2 [← mul_one a] at h exact mul_left_cancel a b 1 ha h ``` Тепер у нас є всі інструменти, необхідні для створення базової теорії подільності натуральних чисел.
zh: 这里有个两行的证明 ``` nth_rewrite 2 [← mul_one a] at h exact mul_left_cancel a b 1 ha h ``` 现在我们拥有了建立自然数可除性基本理论所需的所有工具。

source: Advanced Multiplication World
fr: Monde de la Multiplication Avancée
it: Mondo Moltiplicazione Avanzata
uk: Світ розширеного множення
zh: 高级乘法世界
