Repository: leanprover-community/NNG4
Catalog: .i18n/*/Game.po
Languages: fr, it, uk, zh

source: In this level we're going to prove that $0+n=n$, where $n$ is a secret natural number. Wait, don't we already know that? No! We know that $n+0=n$, but that's `add_zero`. This is `zero_add`, which is different. The difficulty with proving `0 + n = n` is that we do not have a *formula* for `0 + n` in general, we can only use `add_zero` and `add_succ` once we know whether `n` is `0` or a successor. The `induction` tactic splits into these two cases. The base case will require us to prove `0 + 0 = 0`, and the inductive step will ask us to show that if `0 + d = d` then `0 + succ d = succ d`. Because `0` and successor are the only way to make numbers, this will cover all the cases. See if you can do your first induction proof in Lean. (By the way, if you are still in the "Editor mode" from the last world, you can swap back to "Typewriter mode" by clicking the `>_` button in the top right.)
fr: Dans ce niveau, nous allons prouver que $0+n=n$, où $n$ est un nombre naturel secret. Attendez, ne le savons-nous pas déjà ? Non ! Nous savons que $n+0=n$, mais c'est `add_zero`. Ceci est `zero_add`, ce qui est différent. La difficulté pour prouver `0 + n = n` est que nous n'avons pas de *formule* pour `0 + n` en général, nous ne pouvons utiliser `add_zero` et `add_succ` que lorsque nous savons si `n` est `0` ou un successeur. La tactique `induction`, correspond à une récurrence et se divise en ces deux cas. Le cas de base nous demandera de prouver `0 + 0 = 0`, et l'étape inductive nous demandera de montrer que si `0 + d = d` alors `0 + succ d = succ d`. Parce que `0` et successeur sont les seules façons de créer des nombres, cela couvrira tous les cas. Voyons si vous pouvez faire votre première preuve par récurrence avec Lean. (Au fait, si vous êtes toujours en "Mode Éditeur" depuis le dernier monde, vous pouvez revenir en "Mode Machine à écrire" en cliquant sur le bouton `>_` en haut à droite.)
it: In questo livello dimostreremo l'enunciato $0+n=n$, dove $n$ è un numero naturale incognito. Ma come, non l'abbiamo già dimostrato? No! Abbiamo dimostrato $n+0=n$, che abbiamo chiamato `add_zero`. Questo è `zero_add`, un teorema diverso. Ciò che complica le cose nel dimostrare `0 + n = n` è che non abbiamo una *formula* per riscrivere `0 + n` in generale, possiamo solo applicare `add_zero` o `add_succ` una volta che sappiamo che `n` è `0` oppure un successore. La tattica `induction` spezza la dimostrazione in questi due casi. Nel caso base dovremo dimostrare `0 + 0 = 0`, e nel caso induttivo dovremo dimostrare che se `0 + d = d` allora `0 + succ d = succ d`. Dato che `0` e il successore sono i due soli modi per costruire i numeri naturali, la dimostrazione coprirà tutti i casi possibili. Ora prova a svolgere la tua prima dimostrazione per induzione su Lean. (Se sei ancora nella "Modalità editor" dallo scorso mondo, puoi rientrare nella "Modalità interattiva" cliccando sul pulsante `>_` in alto a destra.)
uk: На цьому рівні ми збираємося довести, що $0+n=n$, де $n$ це секретне натуральне число. Почекайте, хіба ми цього вже не знаємо? Ні! Ми знаємо, що $n+0=n$, але це `add_zero`. А це `zero_add`, вони відрізняються. Складність під час доведення `0 + n = n` полягає в тому, що ми не маємо *формули* для `0 + n` загалом, ми можемо використовувати `add_zero` і `add_succ` лише один раз ми знаємо, чи є `n` `0` чи наступником. Тактика `induction` поділяється на ці два випадки. Базовий варіант вимагатиме від нас доведення `0 + 0 = 0` та індуктивний крок попросить нас показати, що якщо `0 + d = d`, то `0 + succ d = succ d`. Тому що `0` і наступне значення є єдиним способом створення чисел, це охопить усі випадки. Подивіться, чи зможете ви виконати свій перший індукційний доказ в Lean. (До речі, якщо ви ще в «Режимі редактора» з минулого світу, ви можете поміняти місцями повернутися до «Режиму друку», натиснувши кнопку `>_` у верхньому правому куті.)
zh: 在这个关卡中，我们将证明 $0+n=n$，其中 $n$ 是一个未知的自然数。 等等，我们不是已经知道这个了吗？不！我们知道的是 $n+0=n$，但那是 `add_zero`。这里的 `zero_add` 是不同的。 证明 `0 + n = n` 的难点在于我们没有一个一般的*公式*来表示 `0 + n`，我们只能在知道 `n` 是 `0` 还是后继数后，使用 `add_zero` 和 `add_succ`。`induction` （归纳）策略会把目标分解成这两种情况。 基础情况将要求我们证明 `0 + 0 = 0`，归纳步骤将要求我们证明如果 `0 + d = d` 那么 `0 + succ d = succ d`。因为 `0` 和后继数是构造数字的唯一方式，这将涵盖所有情况。 看看你是否能在 Lean 中完成你的第一个归纳证明。 (顺便说一句，如果你还在上一个世界的 "编辑器模式 "下，你可以通过点击 "编辑器模式 "下的 点击右上角的 `>_` 按钮换回 "模式"）。

source: `zero_add x` is the proof of `0 + x = x`. `zero_add` is a `simp` lemma, because replacing `0 + x` by `x` is almost always what you want to do if you're simplifying an expression.
fr: `zero_add x` est la preuve que `0 + x = x`. `zero_add` est un lemme `simp`, car remplacer `0 + x` par `x` est presque toujours ce que vous voulez faire si vous simplifiez une expression.
it: `zero_add x` è la dimostrazione di `0 + x = x`. `zero_add` è un lemma del tipo `simp` (semplificazione), infatti sostituire `0 + x` con `x` è quasi sempre uno dei passi più ovvi della semplificazione di un'espressione.
uk: `zero_add x` є доказом що`0 + x = x`. `zero_add` є лемою `simp`, оскільки заміна `0 + x` на `x` майже завжди те, що ви хочете зробити, якщо ви спрощуєте вираз.
zh: `zero_add x` 是 `0 + x = x` 的证明。 `zero_add` 是一个有 `simp` 标记的引理，因为如果你正在简化一个表达式，几乎总是想要将 `0 + x` 替换为 `x`。

source: For all natural numbers $n$, we have $0 + n = n$.
fr: Pour tous les nombres naturels $n$, nous avons $0 + n = n$.
it: Per ogni numero naturale $n$, si ha che $0 + n = n$.
uk: Для всіх натуральних чисел $n$ маємо $0 + n = n$.
zh: 对于所有自然数 $n$，我们有 $0 + n = n$。

source: You can start a proof by induction on `n` by typing: `induction n with d hd`.
fr: Vous pouvez commencer une preuve par induction sur `n` en tapant : `induction n with d hd`.
it: Per avviare una dimostrazione per induzione su `n` digita: `induction n with d hd`.
uk: Ви можете почати доведення індукцією по `n`, ввівши: `induction n with d hd`.
zh: 你可以通过输入以下内容来开始对 `n` 进行归纳证明： `induction n with d hd`。

source: Now you have two goals. Once you proved the first, you will jump to the second one. This first goal is the base case $n = 0$. Recall that you can rewrite the proof of any lemma which is visible in your inventory, or of any assumption displayed above the goal, as long as it is of the form `X = Y`.
fr: Maintenant vous avez deux buts. Une fois que vous avez prouvé le premier, vous passerez au second. Ce premier but est le cas de base $n = 0$. Rappelez-vous que vous pouvez réécrire la preuve de tout lemme visible dans votre inventaire, ou de toute hypothèse affichée au-dessus du but, tant qu'elle est de la forme `X = Y`.
it: Ora hai due goal. Appena dimostrerai il primo, ti verrà dato il secondo goal da dimostrare. Questo primo goal rappresenta il caso base $n = 0$. Ricorda che puoi riscrivere la dimostrazione di qualsiasi lemma che è visibile nell'inventario, o una qualsiasi ipotesi presente al di sopra del goal, a patto che abbia la forma `X = Y`.
uk: Тепер у вас є дві мети. Довівши першу, ви переходите до другої. Ця перша мета є базовим варіантом $n = 0$. Пам’ятайте, що ви можете переписати доказ будь-якої видимої леми у вашому інвентарі чи будь-яке припущення, що відображається над метою, доки вони мають форму `X = Y`.
zh: 现在你有两个目标。一旦你证明了第一个，你会自动跳到第二个。 第一个目标是基础情形 $n = 0$。 回想一下，你可以使用任何在你的清单中可见的引理的证明，或者任何显示在目标上方的假设 （只要它是形如 `X = Y` 的形式）来重写目标。

source: try rewriting `add_zero`.
fr: essayez de réécrire avec `add_zero`.
it: prova a riscrivere `add_zero`.
uk: спробуйте переписати `add_zero`.
zh: 尝试重写 `add_zero`。

source: Now for to the second goal. Here you have the induction hypothesis `«{hd}» : 0 + «{d}» = «{d}»`, and you need to prove that `0 + succ «{d}» = succ «{d}»`.
fr: Passons maintenant au second but. Ici vous avez l'hypothèse d'induction `«{hd}» : 0 + «{d}» = «{d}»`, et vous devez prouver que `0 + succ «{d}» = succ «{d}»`.
it: Adesso viene il secondo goal. Qui hai l'ipotesi induttiva `«{hd}» : 0 + «{d}» = «{d}»`, e devi dimostrare che `0 + succ «{d}» = succ «{d}»`.
uk: Перейдемо до другої мети. Ось вам індукційна гіпотеза `«{hd}» : 0 + «{d}» = «{d}»`, і вам потрібно довести, що `0 + succ «{d}» = succ «{d}»`.
zh: 现在来到第二个目标。这里你有归纳假设 `«{hd}» : 0 + «{d}» = «{d}»`，你需要证明 `0 + succ «{d}» = succ «{d}»`。

source: Use `add_succ`.
fr: Utilisez `add_succ`.
it: Usa `add_succ`.
uk: Використайте `add_succ`.
zh: 使用 `add_succ`。

source: At this point you see the term `0 + «{d}»`, so you can use the induction hypothesis with `rw [«{hd}»]`.
fr: À ce stade, vous voyez le terme `0 + «{d}»`, donc vous pouvez utiliser l'hypothèse d'induction avec `rw [«{hd}»]`.
it: A questo punto hai davanti il termine `0 + «{d}»`, quindi puoi riscrivere l'ipotesi induttiva con `rw [«{hd}»]`.
uk: На цьому етапі ви бачите термін `0 + «{d}»`, тому ви можете використовувати індукційну гіпотезу із допомогою `rw [«{hd}»]`.
zh: 在这一点上，你看到了项 `0 + «{d}»`，所以你可以通过 `rw [«{hd}»]` 来使用归纳假设。

source: ## Summary If `n : ℕ` is an object, and the goal mentions `n`, then `induction n with d hd` attempts to prove the goal by induction on `n`, with the inductive variable in the successor case being `d`, and the inductive hypothesis being `hd`. ### Example: If the goal is ``` 0 + n = n ``` then `induction n with d hd` will turn it into two goals. The first is `0 + 0 = 0`; the second has an assumption `hd : 0 + d = d` and goal `0 + succ d = succ d`. Note that you must prove the first goal before you can access the second one.
fr: ## Résumé Si `n : ℕ` est un objet, et que le but mentionne `n`, alors `induction n with d hd` tente de prouver le but par induction sur `n` (c'est-à-dire par récurrence sur `n`). avec la variable inductive dans le cas successeur étant `d`, et l'hypothèse inductive étant `hd`. ### Exemple : Si le but est ``` 0 + n = n ``` alors `induction n with d hd` le transformera en deux buts. Le premier est `0 + 0 = 0` ; le second a une hypothèse `hd : 0 + d = d` et un but `0 + succ d = succ d`. Notez que vous devez prouver le premier but avant de pouvoir accéder au second.
it: ## Descrizione Se `n : ℕ` è un oggetto, e il goal fa il nome di `n`, allora `induction n with d hd` avvia la dimostrazione per induzione attorno alla variabile `n`, con la variabile induttiva nel caso del successore chiamata `d` e l'ipotesi induttiva chiamata`hd`. ### Esempio: Se il goal è ``` 0 + n = n ``` allora `induction n with d hd` lo spezzerà in sue sotto-goal. Il primo è `0 + 0 = 0`; il secondo porta ha con sé un ipotesi `hd : 0 + d = d` e il goal `0 + succ d = succ d`. Tieni presente che devi dimostrare il primo goal prima di avere accesso al secondo.
uk: ## Резюме Якщо `n : ℕ` є об'єктом, а мета згадує `n`, тоді `induction n with d hd` спробує довести мету індукцією по `n`, з індуктивною змінною у випадку наступника із іменем `d`, та індуктивною гіпотезою — `hd`. ### Приклад: Якщо є мета ``` 0 + n = n ``` тоді `induction n with d hd` перетворить твердження на дві мети. Перша: `0 + 0 = 0`; друга має припущення `hd : 0 + d = d` і мету `0 + succ d = succ d`. Зверніть увагу, що ви повинні спочатку довести першу мету, перед тим як ви зможете отримати доступ до другої.
zh: ## 概述 如果 `n : ℕ` 是一个对象，并且目标提到了 `n`，那么 `induction n with d hd` 尝试通过对 `n` 进行归纳来证明目标，其中后继数情况下的归纳变量是 `d`，归纳假设是 `hd`。 ### 例子: 如果目标是 ``` 0 + n = n ``` 那么 `induction n with d hd` 将把它变成两个目标。第一个是 `0 + 0 = 0`； 第二个有一个假设 `hd : 0 + d = d` 和目标 `0 + succ d = succ d` 。 注意你必须先证明第一个然后才能证第二个。

source: This lemma would have been easy if we had known that `x + y = y + x`. That theorem is called `add_comm` and it is *true*, but unfortunately its proof *uses* both `add_zero` and `zero_add`! Let's continue on our journey to `add_comm`, the proof of `x + y = y + x`.
fr: Ce lemme aurait été facile si nous avions su que `x + y = y + x`. Ce théorème s'appelle `add_comm` et il est *vrai*, mais malheureusement sa preuve *utilise* à la fois `add_zero` et `zero_add` ! Continuons notre voyage vers `add_comm`, la preuve de `x + y = y + x`.
it: Questo lemma sarebbe stato semplice se avessimo potuto usare `x + y = y + x`. Quel teorema si chiama `add_comm` e, sebbene sia *vero*, la sua dimostrazione *dipende* sia da `add_zero` che da `zero_add`! Proseguiamo la nostra avventura verso `add_comm`, la dimostrazione di `x + y = y + x`.
uk: Ця лема була б легкою, якби ми знали, що `x + y = y + x`. Ця теорема називається `add_comm` і вона є *істіною*, але, на жаль, її доказ *використовує* як `add_zero` так і `zero_add`! Давайте продовжимо нашу подорож до `add_comm`, доказу `x + y = y + x`.
zh: 如果我们知道 `x + y = y + x` ，那么证明这个引理就会很容易。那个定理 被称为 `add_comm` 并且它是 *成立的* ，但不幸的是它的证明 *用到了* `add_zero` 和 `zero_add`！ 让我们继续我们证明 `add_comm`，即 `x + y = y + x` 的旅程。

source: Oh no! On the way to `add_comm`, a wild `succ_add` appears. `succ_add a b` is the proof that `(succ a) + b = succ (a + b)` for `a` and `b` numbers. This result is what's standing in the way of `x + y = y + x`. Again we have the problem that we are adding `b` to things, so we need to use induction to split into the cases where `b = 0` and `b` is a successor.
fr: Oh non ! En chemin vers `add_comm`, un `succ_add` sauvage apparaît. `succ_add a b` est la preuve que `(succ a) + b = succ (a + b)` pour `a` et `b` des nombres. Ce résultat est ce qui bloque pour `x + y = y + x`. Encore une fois nous avons le problème que nous ajoutons `b` à des choses, donc nous devons utiliser l'induction pour diviser entre les cas où `b = 0` et où `b` est un successeur.
it: Oh no! Lungo la strada per `add_comm`, salta fuori un `succ_add` selvatico. `succ_add a b` è la dimostrazione dell'enunciato `(succ a) + b = succ (a + b)` per due numeri `a` e `b` qualsiasi. Questo risultato è ciò che ci manca per dimostrare `x + y = y + x`. E ancora una volta, abbiamo il problema di sommare una `b` generica a destra, dunque dobbiamo ricorrere all'induzione per spezzare questa `b` nei casi in cui `b = 0` e `b` è un successore.
uk: О ні! На шляху до `add_comm` з'являється дикий `succ_add`. `succ_add a b` це доказ того, що `(succ a) + b = succ (a + b)` для чисел `a` і `b`. Цей результат є тим, що стоїть на шляху до `x + y = y + x`. Знову у нас є проблема, що ми додаємо `b` до речей, тому нам потрібно використовувати індукцію для розбиття на випадки, коли `b = 0` і `b` є наступним значенням.
zh: 哦不！在前往 `add_comm` 的路上，一个野生的 `succ_add` 出现了。 `succ_add a b` 是 `(succ a) + b = succ (a + b)` 的证明，对于数字 `a` 和 `b`。 这个结果是证明 `x + y = y + x` 的中间步骤。这里我们再次遇到了向事物中加入 `b` 的问题， 所以我们需要使用归纳法来分解成 `b = 0` 和 `b` 是后继数的情况。

source: `succ_add a b` is a proof that `succ a + b = succ (a + b)`.
fr: `succ_add a b` est une preuve que `succ a + b = succ (a + b)`.
it: `succ_add a b` è la dimostrazione che `succ a + b = succ (a + b)`.
uk: `succ_add a b` є доказом того, що `succ a + b = succ (a + b)`.
zh: `succ_add a b` 是 `succ a + b = succ (a + b)` 的证明。

source: For all natural numbers $a, b$, we have $ \operatorname{succ}(a) + b = \operatorname{succ}(a + b)$.
fr: Pour tous les nombres naturels $a, b$, nous avons $ \operatorname{succ}(a) + b = \operatorname{succ}(a + b)$.
it: Per tutti i numeri naturali $a, b$, si ha che $ \operatorname{succ}(a) + b = \operatorname{succ}(a + b)$.
uk: Для всіх натуральних чисел $a, b$ маємо $ \operatorname{succ}(a) + b = \operatorname{succ}(a + b)$.
zh: 对于所有自然数 $a, b$，我们有 $ \operatorname{succ}(a) + b = \operatorname{succ}(a + b)$。

source: You might want to think about whether induction on `a` or `b` is the best idea.
fr: Vous pourriez réfléchir à savoir si l'induction sur `a` ou `b` est la meilleure idée.
it: Procedi per induzione: su cosa è meglio farla qua, su `a` o `b`?
uk: Ви можете подумати про те, яка індукція чи по `a` чи `b` буде кращою ідеєю.
zh: 你可能想考虑一下，对 `a` 还是 `b` 进行归纳证明才是最好的主意。

source: Induction on `a` will not work here. You are still stuck with an `+ b`. I suggest you delete this line and try a different approach.
fr: L'induction sur `a` ne fonctionnera pas ici. Vous êtes toujours bloqué avec un `+ b`. Je vous suggère de supprimer cette ligne et d'essayer une approche différente.
it: Fare induzione su `a` non aiuta: rimarrai bloccato con `+ b`. Cancella la linea e tenta un altro approccio.
uk: Індукція по `а` тут не працюватиме. Ви все ще застрягли із `+ b`. Я пропоную вам видалити цей рядок і спробувати інший підхід.
zh: 对 `a` 的归纳在这里不起作用。你仍然卡在 `+ b` 上。 我建议你删除这一行，换一种方法。

source: Note that `succ a + «{d}»` means `(succ a) + «{d}»`. Put your cursor on any `succ` in the goal or assumptions to see what exactly it's eating.
fr: Notez que `succ a + «{d}»` signifie `(succ a) + «{d}»`. Placez votre curseur sur n'importe quel `succ` dans le but ou les hypothèses pour voir exactement ce qu'il prend.
it: Attento che `succ a + «{d}»` sta per `(succ a) + «{d}»`. Sposta il mouse sopra `succ` o nel goal o nelle ipotesi per capire su cosa agisce esattamente.
uk: Зверніть увагу, що `succ a + «{d}»` означає `(succ a) + «{d}»`. Помістіть курсор на будь-якому `succ` у меті чи припущенні, щоб побачити, що саме він з'їдає.
zh: 请注意，`succ a + «{d}»` 的意思是 `(succ a) + «{d}»`。将你的光标放在目标或假设中的任何 `succ` 上，以查看它确切的含义。

source: Well done! You now have enough tools to tackle the main boss of this level.
fr: Bien joué ! Vous avez maintenant suffisamment d'outils pour affronter le boss principal de ce niveau.
it: Ottimo lavoro! Ora sei abbastanza pratico per affrontare il boss principale di questo mondo.
uk: Гарна робота! Тепер у вас достатньо інструментів, щоб боротися з головним босом цього рівня.
zh: 做得好！现在你有足够的工具来对付这个关卡的大Boss了。

source: add_comm (level boss)
fr: add_comm (boss du niveau)
it: add_comm (livello boss)
uk: add_comm (бос рівня)
zh: add_comm（关卡Boss）

source: [boss battle music] Look in your inventory to see the proofs you have available. These should be enough.
fr: [musique de combat de boss] Regardez dans votre inventaire les preuves dont vous disposez. Cela devrait suffire.
it: [musica da boss battle] Sfrutta le dimostrazioni disponibili nel tuo inventario. Dovrebbero bastarti.
uk: [музика битви із босом] Подивіться у свій інвентар, щоб побачити доступні докази. Цього має бути достатньо.
zh: 【Boss战音乐】 查看您的库存以查看您拥有的可用定理。 这些应该足够了。

source: `add_comm x y` is a proof of `x + y = y + x`.
fr: `add_comm x y` est une preuve de `x + y = y + x`.
it: `add_comm x y` è la dimostrazione di `x + y = y + x`.
uk: `add_comm x y` є доказом `x + y = y + x`.
zh: `add_comm x y` 是 `x + y = y + x` 的证明。

source: On the set of natural numbers, addition is commutative. In other words, if `a` and `b` are arbitrary natural numbers, then $a + b = b + a$.
fr: Sur l'ensemble des nombres naturels, l'addition est commutative. Autrement dit, si `a` et `b` sont des nombres naturels arbitraires, alors $a + b = b + a$.
it: L'addizione è commutativa sull'insieme dei naturali. Equivalentemente, se `a` e `b` sono due numeri naturali qualsiasi, allora $a + b = b + a$.
uk: На множині натуральних чисел додавання комутативне. Іншими словами, якщо `a` і `b` це довільні натуральні числа, то $a + b = b + a$.
zh: 在自然数集上，加法是可交换的。 换句话说，如果 `a` 和 `b` 是任意自然数，那么 $a + b = b + a$。

source: Induction on `a` or `b` -- it's all the same in this one.
fr: Induction sur `a` ou `b` -- c'est pareil dans ce cas.
it: Induzione su `a` o su `b` -- vanno entrambe bene qua.
uk: Індукція по `a` або `b` -- у цьому випадку буде різниці.
zh: 对 `a` 或 `b` 进行归纳证明 —— 它们都是相同的。

source: add_assoc (associativity of addition)
fr: add_assoc (associativité de l'addition)
it: add_assoc (proprietà associativa dell'addizione)
uk: add_assoc (асоціативність додавання)
zh: add_assoc（加法结合律）

source: We've been adding up two numbers; in this level we will add up three. What does $x+y+z$ *mean*? It could either mean $(x+y)+z$, or it could mean $x+(y+z)$. In Lean, $x+y+z$ means $(x+y)+z$. But why do we care which one it means; $(x+y)+z$ and $x+(y+z)$ are *equal*! That's true, but we didn't prove it yet. Let's prove it now by induction.
fr: Nous avons additionné deux nombres ; dans ce niveau, nous en additionnerons trois. Que signifie $x+y+z$ ? Cela pourrait signifier $(x+y)+z$, ou $x+(y+z)$. Dans Lean, $x+y+z$ signifie $(x+y)+z$. Mais pourquoi se soucier de ce que cela signifie, en fait $(x+y)+z$ et $x+(y+z)$ sont *égaux* ! C'est vrai, mais nous ne l'avons pas encore prouvé. Prouvons-le maintenant par induction.
it: Finora abbiamo sommato solo due numeri alla volta; in questo livello ne sommeremo tre. Ma per cosa sta $x+y+z$ *esattamente*? Può stare per $(x+y)+z$, oppure può stare per $x+(y+z)$. In Lean, $x+y+z$ sta per $(x+y)+z$. La posizione delle parentesi potrebbe sembrarti irrilevante; d'altronde $(x+y)+z$ e $x+(y+z)$ sono *uguali*! Hai ragione, ma non l'abbiamo ancora dimostrato. Dimostriamolo subito tramite induzione.
uk: Ми складали два числа; на цьому рівні ми будемо додавати три. Що $x+y+z$ *означає*? Це може означати або $(x+y)+z$, або це може означати $x+(y+z)$. У Lean $x+y+z$ означає $(x+y)+z$. Але чому нас хвилює, що це означає; $(x+y)+z$ і $x+(y+z)$ *рівні*! Це правда, але ми цього ще не довели. Доведемо це тепер індукцією.
zh: 我们已经学会了将两个数相加；在这个关卡中，我们将学习如何将三个数相加。 $x+y+z$ *意味*着什么？它可以意味着 $(x+y)+z$，也可以意味着 $x+(y+z)$。在 Lean 中，$x+y+z$ 意味着 $(x+y)+z$。 但我们为什么要在意它的含义呢；$(x+y)+z$ 和 $x+(y+z)$ 是*相等*的！ 确实如此，但我们还没有证明它。现在让我们通过归纳来证明它。

source: `add_assoc a b c` is a proof that `(a + b) + c = a + (b + c)`. Note that in Lean `(a + b) + c` prints as `a + b + c`, because the notation for addition is defined to be left associative.
fr: `add_assoc a b c` est une preuve que `(a + b) + c = a + (b + c)`. Notez que dans Lean `(a + b) + c` s'affiche comme `a + b + c`, car la notation pour l'addition est définie comme étant associative à gauche.
it: `add_assoc a b c` è la dimostrazione di `(a + b) + c = a + (b + c)`. Ricordati che in Lean `(a + b) + c` viene stampato come `a + b + c`, perché la notazione dell'addizione è left associative.
uk: `add_assoc a b c` є доказом що `(a + b) + c = a + (b + c)`. Зверніть увагу, що в Lean друкується `(a + b) + c` як `a + b + c`, тому що нотація для додавання визначена ліво- асоціативно.
zh: `add_assoc a b c` 是一个 `(a + b) + c = a + (b + c)` 的证明。 请注意，在 Lean `(a + b) + c` 中显示 为 `a + b + c`，因为加法符号被定义为左 结合的。

source: On the set of natural numbers, addition is associative. In other words, if $a, b$ and $c$ are arbitrary natural numbers, we have $ (a + b) + c = a + (b + c). $
it: Sull'insieme dei numeri naturali, l'addizione è associativa. Ovvero, se $a, b$ sono $c$ due numeri naturali qualsiasi, si ha che $ (a + b) + c = a + (b + c). $
uk: На множині натуральних чисел додавання є асоціативним. Іншими словами, якщо $a, b$ і $c$ це довільні натуральні числа, ми маємо що $ (a + b) + c = a + (b + c). $
zh: 在自然数集上，加法服从结合律。 换句话说，如果 $a, b$ 和 $c$ 是任意自然数，我们有 $ (a + b) + c = a + (b + c)$ 。
