Repository: leanprover-community/NNG4
Catalog: .i18n/*/Game.po
Languages: fr, it, uk, zh

source: Start with `contrapose! h`, to change the goal into its contrapositive, namely a hypothesis of `succ m = succ m` and a goal of `m = n`.
it: Inizia con `contrapose! h`, che ti fa dimostrare la contronominale del goal, cioè avrai tra le ipotesi la negazione del goal, `succ m = succ m`, e come nuovo goal avrai la negazione dell'ipotesi `h`, `m = n`.

source: Congratulations! You've finished Algorithm World. These algorithms will be helpful for you in Even-Odd World.
it: Congratulazioni! Hai finito il Mondo Algoritmi. Questi algoritmi ti saranno sicuramente utili per il Mondo Pari-Dispari.

source: Here's a proof using `add_left_eq_self`: ``` rw [add_comm] intro h apply add_left_eq_self at h exact h ``` and here's an even shorter one using the same idea: ``` rw [add_comm] exact add_left_eq_self y x ``` Alternatively you can just prove it by induction on `x` (the dots in the proof just indicate the two goals and can be omitted): ``` induction x with d hd · intro h rw [zero_add] at h assumption · intro h rw [succ_add] at h apply succ_inj at h apply hd at h assumption ```
it: Ecco una dimostrazione che usa `add_left_eq_self`: ``` rw [add_comm] intro h apply add_left_eq_self at h exact h ``` ed eccone una più breve che condensa le ultime tre righe in una sola: ``` rw [add_comm] exact add_left_eq_self y x ``` Volendo puoi anche dimostrarlo per induzione su `x` (i pallini nel codice qui sotto hanno solo funzione decorativa, assieme all'indentazione servono per riconoscere più facilmente i due sottogoal, ma possono essere omessi): ``` induction x with d hd · intro h rw [zero_add] at h assumption · intro h rw [succ_add] at h apply succ_inj at h apply hd at h assumption ```

source: ## Summary The `use` tactic makes progress with goals which claim something *exists*. If the goal claims that some `x` exists with some property, and you know that `x = 37` will work, then `use 37` will make progress. Because `a ≤ b` is notation for \"there exists `c` such that `b = a + c`\", you can make progress on goals of the form `a ≤ b` by `use`ing the number which is morally `b - a`.
it: ## Descrizione La tattica `use` permette di avanzare su goal che postulano l'*esistenza* di qualcosa. Se il goal afferma che esiste una certa `x`con qualche proprietà, e sei sicuro che `x = 37` la soddisfi, allora con `use 37` farai progresso nella dimostrazione. Dato che `a ≤ b` è notazione per \"there exists `c` such that `b = a + c`\", puoi fare progresso su goal della forma `a ≤ b` passando a `use` quel numero che corrisponde a `b - a`, la distanza tra `a` e `b`.

source: # Summary The `tauto` tactic will solve any goal which can be solved purely by logic (that is, by truth tables). ## Example If you have `False` as a hypothesis, then `tauto` will solve the goal. This is because a false hypothesis implies any hypothesis. ## Example If your goal is `True`, then `tauto` will solve the goal. ## Example If you have two hypotheses `h1 : a = 37` and `h2 : a ≠ 37` then `tauto` will solve the goal because it can prove `False` from your hypotheses, and thus prove the goal (as `False` implies anything). ## Example If you have one hypothesis `h : a ≠ a` then `tauto` will solve the goal because `tauto` is smart enough to know that `a = a` is true, which gives the contradiction we seek. ## Example If you have a hypothesis of the form `a = 0 → a * b = 0` and your goal is `a * b ≠ 0 → a ≠ 0`, then `tauto` will solve the goal, because the goal is logically equivalent to the hypothesis. If you switch the goal and hypothesis in this example, `tauto` would solve it too.
it: # Descrizione La tattica `tauto` risolverà qualsiasi goal che può essere tramite puro ragionamento logico (ossia, tramite le tavole di verità). ## Esempio Se hai `False` come ipotesi, allora `tauto` risolverà il goal. Questo perché un'ipotesi false implica qualsiasi cosa. ## Esempio Se hai il goal `True`, allora `tauto` risolverà il goal. ## Esempio Se hai due ipotesi `h1 : a = 37` e `h2 : a ≠ 37` allora `tauto` risolverà solve il goal perché può dedurre `False` dalle tue ipotesi, e quindi dimostrare il goal (dato che `False` implica qualsiasi cosa). ## Esempio Se hai un'ipotesi `h : a ≠ a` allora `tauto` risolverà il goal perché è abbastanza intelligente da capire che `a = a` è vero, arrivando alla contraddizione che cerchiamo. ## Esempio Se hai un'ipotesi della forma `a = 0 → a * b = 0` e hai il goal `a * b ≠ 0 → a ≠ 0`, allora `tauto` risolverà il goal, because esso è logicamente equivalente all'ipotesi. E se scambi il ruolo del goal e dell'ipotesi in questo esempio, `tauto` lo risolverebbe lo stesso.

source: Multiplication usually makes a number bigger, but multiplication by zero can make it smaller. Thus many lemmas about inequalities and multiplication need the hypothesis `a ≠ 0`. Here is a key lemma enables us to use this hypothesis. To help us with the proof, we can use the `tauto` tactic. Click on the tactic's name on the right to see what it does.
it: La moltiplicazione di norma fa crescere un numero, ma moltiplicare per zero lo rende più piccolo, o meglio, lo azzera. Ecco perché gran parte dei teoremi che mischiano le disuguaglianze con la moltiplicazione hanno l'ipotesi `a ≠ 0`. Questo livello è un lemma chiave che ci permette di mettere a frutto questa ipotesi. Per aiutarci nella dimostrazione, possiamo usare la tattica `tauto`. Clicca sul nome della tattica sulla destra per una descrizione dettagliata su cosa fa.

source: In Prime Number World we will be proving that $2$ is prime. To do this, we will have to rule out things like $2 ≠ 37 × 42.$ We will do this by proving that any factor of $2$ is at most $2$, which we will do using this lemma. The proof I have in mind manipulates the hypothesis until it becomes the goal, using pretty much everything which we've proved in this world so far.
it: Nel Mondo Numeri Primi dimostreremo che $2$ è primo. Ma per arrivarci, dobbiamo escludere falsità del tipo $2 ≠ 37 × 42.$ Lo faremo mostrando che ogni fattore di $2$ è al più $2$, che avremo gratis grazie a questo lemma. La dimostrazione che ho in mente io manipola l'ipotesi finché non diventa il goal, usando praticamente tutto ciò che abbiamo dimostrato in questo mondo finora.

source: # Summary The `have` tactic can be used to add new hypotheses to a level, but of course you have to prove them. ## Example The simplest usage is like this. If you have `a` in your context and you execute `have ha : a = 0` then you will get a new goal `a = 0` to prove, and after you've proved it you will have a new hypothesis `ha : a = 0` in your original goal. ## Example If you already have a proof of what you want to `have`, you can just create it immediately. For example, if you have `a` and `b` number objects, then `have h2 : succ a = succ b → a = b := succ_inj a b` will directly add a new hypothesis `h2 : succ a = succ b → a = b` to the context, because you just supplied the proof of it (`succ_inj a b`). ## Example If you have a proof to hand, then you don't even need to state what you are proving. example `have h2 := succ_inj a b` will add `h2 : succ a = succ b → a = b` as a hypothesis.
it: # Descrizione La tattica `have` può essere usata per aggiungere un'ipotesi a un livello, ma ovviamente ti chiede di dimostrarla. ## Esempio Il suo utilizzo più semplice e così. Se hai `a` nel contesto e vuoi eseguire `have ha : a = 0` allora otterrai un nuovo goal `a = 0` da dimostrare, e dopo che l'hai dimostrato avrai l'ipotesi `ha : a = 0` nel contesto originale. ## Esempio Se hai già pronta la dimostrazione di ciò che vuoi introdurre con `have`, puoi farlo in un unico comando. Ad esempio, se hai `a` e `b` come numeri, allora `have h2 : succ a = succ b → a = b := succ_inj a b` aggiungerà direttamente l'ipotesi `h2 : succ a = succ b → a = b` al contesto, dato che hai fornito assieme la sua dimostrazione (`succ_inj a b`). ## Esempio Se hai in mano una dimostrazione, puoi omettere il lemma che vuoi introdurre (quello tra i simboli `:` e `:=`). Ad esempio: `have h2 := succ_inj a b` aggiungerà `h2 : succ a = succ b → a = b` come ipotesi.

source: Now `rw [h] at h2` so you can `apply le_one at hx`.
it: Adesso `rw [h] at h2` così puoi fare `apply le_one at hx`.

source: In this level we prove that if `a * b = a * c` and `a ≠ 0` then `b = c`. It is tricky, for several reasons. One of these is that we need to introduce a new idea: we will need to understand the concept of mathematical induction a little better. Starting with `induction b with d hd` is too naive, because in the inductive step the hypothesis is `a * d = a * c → d = c` but what we know is `a * succ d = a * c`, so the induction hypothesis does not apply! Assume `a ≠ 0` is fixed. The actual statement we want to prove by induction on `b` is "for all `c`, if `a * b = a * c` then `b = c`. This *can* be proved by induction, because we now have the flexibility to change `c`."
it: In questo livello dimostriamo se `a * b = a * c` e `a ≠ 0` allora `b = c`. È un pò complicato, per diverse ragioni. Una di queste è che abbiamo bisogno di introdurre una nuova idea, approfondendo la nozione di induzione matematica. Sarebbe ingenuo partire con `induction b with d hd`, perché nel passo induttivo l'ipotesi è `a * d = a * c → d = c` ma quello che sappiamo è solo che `a * succ d = a * c`, dunque non possiamo applicare l'ipotesi ipotesi induttiva! Supponiamo di fissare la variabile `a ≠ 0`. Il vero enunciato che vogliamo dimostrare per induzione su `b` è "per tutte le `c`, se `a * b = a * c` allora `b = c`". Questo *può* essere dimostrato per induzione, perché abbiamo permesso alla `c` di variare.

source: # Welcome to the Natural Number Game #### An introduction to mathematical proof. In this game, we will build the basic theory of the natural numbers `{0,1,2,3,4,...}` from scratch. Our first goal is to prove that `2 + 2 = 4`. Next we'll prove that `x + y = y + x`. And at the end we'll see if we can prove Fermat's Last Theorem. We'll do this by solving levels of a computer puzzle game called Lean. # Read this. Learning how to use an interactive theorem prover takes time. Tests show that the people who get the most out of this game are those who read the help texts like this one. To start, click on "Tutorial World". Note: this is a new Lean 4 version of the game containing several worlds which were not present in the old Lean 3 version. A new version of Advanced Multiplication World is in preparation, and worlds such as Prime Number World and more will be appearing during October and November 2023. ## More Click on the three lines in the top right and select "Game Info" for resources, links, and ways to interact with the Lean community.
it: # Benvenuto nel Gioco dei Numeri Naturali! #### Un'introduzione alla dimostrazione matematica. In questo gioco costruiremo la teoria elementare dei numeri naturali `{0,1,2,3,4,...}` a partire da zero. Il nostro primo obiettivo è dimostrare `2 + 2 = 4`. Dopodiché dimostreremo `x + y = y + x`. Infine cercheremo di dimostrare l'Ultimo Teorema di Fermat. Risolveremo questi puzzle matematici in un ambiente interattivo chiamato Lean. # Leggi le istruzioni! Imparare a usare un *interactive theorem prover* richiede tempo e impegno. Le statistiche mostrano che le persone che imparano di più da questo gioco sono coloro che leggono attentamente il testo delle istruzioni, come questo. Per iniziare, clicca su "Mondo Tutorial". Nota: questa è la versione del gioco per Lean 4 contenente diversi mondi che non erano presenti nella versione per Lean 3. Stiamo lavorando a una nuova versione del Mondo Moltiplicazione Avanzata e nuovi mondi tra cui Mondo Numeri Primi arriveranno durante Ottobre e Novembre 2023. ## Altro Clicca sulle tree lineette in alto a destra e seleziona "Game Info" per risorse, link utili e vari modi per connetterti alla comunità di Lean.

source: *Game version: 4.2* *Recent additions: Inequality world, algorithm world* ## Progress saving The game stores your progress in your local browser storage. If you delete it, your progress will be lost! Warning: In most browsers, deleting cookies will also clear the local storage (or "local site data"). Make sure to download your game progress first! ## Credits * **Creators:** Kevin Buzzard, Jon Eugster * **Original Lean3-version:** Kevin Buzzard, Mohammad Pedramfar * **Game Engine:** Alexander Bentkamp, Jon Eugster, Patrick Massot * **Additional levels:** Sian Carey, Ivan Farabella, Archie Browne. * **Additional thanks:** All the student beta testers, all the schools who invited Kevin to speak, and all the schoolkids who asked him questions about the material. ## Resources * The [Lean Zulip chat](https://leanprover.zulipchat.com/) forum * [Original Lean3 version](https://www.ma.imperial.ac.uk/~buzzard/xena/natural_number_game/) (no longer maintained) ## Problems? Please ask any questions about this game in the [Lean Zulip chat](https://leanprover.zulipchat.com/) forum, for example in the stream "New Members". The community will happily help. Note that the Lean Zulip chat is a professional research forum. Please use your full real name there, stay on topic, and be nice. If you're looking for somewhere less formal (e.g. you want to post natural number game memes) then head on over to the [Lean Discord](https://discord.gg/WZ9bs9UCvx). Alternatively, if you experience issues / bugs you can also open github issues: * For issues with the game engine, please open an [issue at the lean4game](https://github.com/leanprover-community/lean4game/issues) repo. * For issues about the game's content, please open an [issue at the NNG](https://github.com/hhu-adam/NNG4/issues) repo.
it: *Versione del gioco: 4.2* *Aggiunti di recente: Mondo Disequazioni, Mondo Algoritmi* ## Salvataggio del gioco Il gioco salva il tuo progresso nella memoria locale del browser. Se cancelli la memoria, perderai anche i dati del gioco! (le tue preziose dimostrazioni!) Attenzione: nella maggior parte dei browser, cancellare i cookies cancella anche la memoria di un sito (o "i dati locali del sito"). In ogni caso, assicurati di esportare il tuo progresso del gioco! ## Riconoscimenti * **Autori:** Kevin Buzzard, Jon Eugster * **Versione originale per Lean3:** Kevin Buzzard, Mohammad Pedramfar * **Game Engine:** Alexander Bentkamp, Jon Eugster, Patrick Massot * **Livelli extra:** Sian Carey, Ivan Farabella, Archie Browne. * **Traduzione italiana**: Federico Dal Pio Luogo * **Grazie anche a:** Gli studenti che si sono offerti come beta testers, tutte le scuole che hanno invitato Kevin a parlare, e gli studenti che gli hanno fatto domande sul materiale. ## Risorse * La [chat di Lean su Zulip](https://leanprover.zulipchat.com/) * Il [gioco originale per Lean3](https://www.ma.imperial.ac.uk/~buzzard/xena/natural_number_game/) (no longer maintained) ## Problemi? Rivolgi le tue domande sul gioco nella [chat di Lean su Zulip](https://leanprover.zulipchat.com/), utilizzando lo stream "New Members". I membri della comunità sono felici di aiutare. Nota che la chat di Lean su Zulip è un forum professionale di ricerca. Perciò usa il tuo nome reale e per intero, rimani in tema, e sii cortese. Se cerchi un forum più informale (dove puoi ad esempio postare i meme sui numeri naturali) allora il [server Discord di Lean](https://discord.gg/WZ9bs9UCvx) fa per te. In alternativa, se il gioco funziona male o dovessi trovare un bug puoi aprire una issue su github: * Per problemi relativi al game engine, apri una [issue sul repo lean4game](https://github.com/leanprover-community/lean4game/issues). * Per problemi relativi ai contenuti del the gioco, apri una [issue sul repo NNG](https://github.com/hhu-adam/NNG4/issues).
