Repository: leanprover-community/NNG4
Catalog: .i18n/*/Game.po
Languages: fr, it, uk, zh

source: `le_total x y` is a proof that `x ≤ y` or `y ≤ x`.
fr: `le_total x y` est une preuve que `x ≤ y` ou `y ≤ x`.
it: `le_total x y` è la dimostrazione che `x ≤ y` or `y ≤ x`.
uk: `le_total x y` є доказом того, що `x ≤ y` або `y ≤ x`.
zh: `le_total x y` 是 `x ≤ y` 或 `y ≤ x` 的证明。

source: This is I think the toughest level yet. Tips: if `a` is a number then `cases a with b` will split into cases `a = 0` and `a = succ b`. And don't go left or right until your hypotheses guarantee that you can prove the resulting goal! I've left hidden hints; if you need them, retry from the beginning and click on "Show more help!"
fr: C'est je pense le niveau le plus difficile jusqu'à présent. Conseils : si `a` est un nombre alors `cases a with b` divisera en cas `a = 0` et `a = succ b`. Et n'allez pas à gauche ou à droite tant que vos hypothèses ne garantissent pas que vous pouvez prouver le but résultant ! J'ai laissé des indices cachés ; si vous en avez besoin, réessayez depuis le début et cliquez sur "Afficher plus d'aide !"
it: Questo è a mio parere il livello più tosto. Due consigli: se `a` è un numero naturale allora `cases a with b` lo scomporrà nei casi `a = 0` e `a = succ b`. Non andare a sinistra o a destra fin quando le tue ipotesi non ti garantiscono che puoi dimostrare quel ramo! Ti ho lasciato alcuni indizi nascosti; quando ne hai bisogno, riavvia il livello e clicca su "Aiutami!"
uk: Я вважаю, що це найскладніший рівень. Підказки: якщо `a` є числом тоді `cases a with b` розділяться на випадки `a = 0` і `a = succ b`. І не йдіть ні вліво, ні вправо, доки ваші гіпотези не підтвердять що ви можете довести кінцеву мету! Я залишив приховані підказки; якщо вони вам потрібні, повторіть спробу з самого початку і натисніть «Показати додаткову допомогу!»
zh: 我认为这是迄今为止最难的关卡。提示：如果 `a` 是一个数字，那么 `cases a with b` 会分解为 `a = 0` 和 `a = succ b` 两种情况。不要在你的假设不能保证你能证明最终目标之前选择证明左边或右边！ 我留下了一些隐藏的提示；如果你需要，请从头开始重试并点击“显示更多帮助”！

source: If $x$ and $y$ are numbers, then either $x \leq y$ or $y \leq x$.
fr: Si $x$ et $y$ sont des nombres, alors soit $x \leq y$ soit $y \leq x$.
it: Se $x$ e $y$ sono numeri, allora vale $x \leq y$ oppure $y \leq x$.
uk: Якщо $x$ і $y$ є числами, то або $x \leq y$, або $y \leq x$.
zh: 如果 $x$ 和 $y$ 是自然数，则 $x \leq y$ 或 $y \leq x$。

source: Start with `induction «{y}» with d hd`.
fr: Commencez par `induction «{y}» with d hd`.
it: Inizia con `induction «{y}» with d hd`.
uk: Почніть з `induction «{y}» with d hd`.
zh: 从`induction «{y}» with d hd`开始。

source: Try `cases «{hd}» with h1 h2`.
fr: Essayez `cases «{hd}» with h1 h2`.
it: Prova `cases «{hd}» with h1 h2`.
uk: Спробуйте `cases «{hd}» with h1 h2`.
zh: 尝试 `cases «{hd}» with h1 h2`。

source: Now `cases «{h2}» with e he`.
fr: Maintenant `cases «{h2}» with e he`.
it: Ora `cases «{h2}» with e he`.
uk: Тепер `cases «{h2}» with e he`.
zh: 现在使用 `cases «{h2}» with e he`。

source: You still don't know which way to go, so do `cases «{e}» with a`.
fr: Vous ne savez toujours pas quelle direction prendre, donc faites `cases «{e}» with a`.
it: Non sai ancora che direzione intraprendere, quindi esegui `cases «{e}» with a`.
uk: Ви все ще не знаєте, що робити, тому `cases «{e}» with a`.
zh: 你仍然不知道该走哪个分支，所以要做 `cases «{e}» with a`。

source: Very well done. A passing mathematician remarks that with you've just proved that `ℕ` is totally ordered. The final few levels in this world are much easier.
fr: Très bien joué. Un mathématicien de passage remarque que vous venez de prouver que `ℕ` est totalement ordonné. Les derniers niveaux de ce monde sont beaucoup plus faciles.
it: Ben fatto. Un matematico di passaggio ti fa notare che hai appena dimostrato che `ℕ` è ordinato totalmente. Il resto dei livelli di questo mondo sono tutti in discesa.
uk: Дуже добре зроблено. Перехожий математик зауважує, що ви щойно довели, що `ℕ` тотально впорядковане. Кілька останніх рівнів у цьому світі набагато легші.
zh: 太棒了！ 一位路过的数学家评论说，您刚刚证明了自然数集 `ℕ` 是全序的。 剩下的关卡会更容易一些。

source: `succ_le_succ x y` is a proof that if `succ x ≤ succ y` then `x ≤ y`.
fr: `succ_le_succ x y` est une preuve que si `succ x ≤ succ y` alors `x ≤ y`.
it: `succ_le_succ x y` è la dimostrazione che se `succ x ≤ succ y`, allora `x ≤ y`.
uk: `succ_le_succ x y` є доказом того, що якщо `succ x ≤ succ y`, то `x ≤ y`.
zh: `succ_le_succ x y` 是如果 `succ x ≤ succ y` 那么 `x ≤ y` 的证明。

source: We've proved that `x ≤ 0` implies `x = 0`. The last two levels in this world will prove which numbers are `≤ 1` and `≤ 2`. This lemma will be helpful for them.
fr: Nous avons prouvé que `x ≤ 0` implique `x = 0`. Les deux derniers niveaux de ce monde prouveront quels nombres sont `≤ 1` et `≤ 2`. Ce lemme nous sera utile.
it: Abbiamo dimostrato che `x ≤ 0` implica `x = 0`. Gli ultimi due livelli di questo mondo ci mostreranno quali sono i numeri `≤ 1` e `≤ 2`. Questo lemma è propedeutico alle loro dimostrazioni.
uk: Ми довели, що `x ≤ 0` означає `x = 0`. Останні два рівні у цьому світі доведуть, які числа є `≤ 1` і `≤ 2`. Ця лема буде там у нагоді.
zh: 我们已经证明 `x ≤ 0` 蕴涵 `x = 0`。 在这个世界的最后两关将证明哪些数字是 `≤ 1` 和 `≤ 2` 的。 这个引理对证明它们将是有帮助的。

source: If $\operatorname{succ}(x) \leq \operatorname{succ}(y)$ then $x \leq y$.
fr: Si $\operatorname{succ}(x) \leq \operatorname{succ}(y)$ alors $x \leq y$.
it: Se $\operatorname{succ}(x) \leq \operatorname{succ}(y)$ allora $x \leq y$.
uk: Якщо $\operatorname{succ}(x) \leq \operatorname{succ}(y)$, тоді $x \leq y$.
zh: 如果 $\operatorname{succ}(x) \leq \operatorname{succ}(y)$ 那么 $x \leq y$。

source: Here's my proof: ``` cases hx with d hd use d rw [succ_add] at hd apply succ_inj at hd exact hd ```
fr: Voici ma preuve : ``` cases hx with d hd use d rw [succ_add] at hd apply succ_inj at hd exact hd ```
it: Ecco la mia dimostrazione: ``` cases hx with d hd use d rw [succ_add] at hd apply succ_inj at hd exact hd ```
uk: Ось мій доказ: ``` cases hx with d hd use d rw [succ_add] at hd apply succ_inj at hd exact hd ```
zh: 这是一个证明（不唯一）： ``` cases hx with d hd use d rw [succ_add] at hd apply succ_inj at hd exact hd ```

source: `le_one x` is a proof that if `x ≤ 1` then `x = 0` or `x = 1`.
fr: `le_one x` est une preuve que si `x ≤ 1` alors `x = 0` ou `x = 1`.
it: `le_one x` è la dimostrazione che se `x ≤ 1` allora `x = 0` or `x = 1`.
uk: `le_one x` є доказом того, що якщо `x ≤ 1`, тоді `x = 0` або `x = 1`.
zh: `le_one x` 是“如果 `x ≤ 1` 那么 `x = 0` 或 `x = 1` ”的证明。

source: We've seen `le_zero`, the proof that if `x ≤ 0` then `x = 0`. Now we'll prove that if `x ≤ 1` then `x = 0` or `x = 1`.
fr: Nous avons vu `le_zero`, la preuve que si `x ≤ 0` alors `x = 0`. Maintenant, nous prouverons que si `x ≤ 1` alors `x = 0` ou `x = 1`.
it: Abbiamo già visto `le_zero`, la prova di `x ≤ 0` implica `x = 0`. Adesso dimostreremo che `x ≤ 1` implica `x = 0` o `x = 1`.
uk: Ми зробили `le_zero`, доказ того, що якщо `x ≤ 0`, тоді `x = 0`. Тепер ми доведемо, що якщо `x ≤ 1`, тоді `x = 0` або `x = 1`.
zh: 我们已经看到了 `le_zero`，这是如果 `x ≤ 0` 那么 `x = 0` 的证明。 现在我们将证明如果 `x ≤ 1` 那么 `x = 0` 或 `x = 1`。

source: If $x \leq 1$ then either $x = 0$ or $x = 1$.
fr: Si $x \leq 1$ alors soit $x = 0$ soit $x = 1$.
it: Se $x \leq 1$ allora vale $x = 0$ oppure $x = 1$.
uk: Якщо $x \leq 1$, то $x = 0$ або $x = 1$.
zh: 如果 $x \leq 1$ 那么 $x = 0$ 或 $x = 1$。

source: Here's my proof: ``` cases x with y left rfl rw [one_eq_succ_zero] at hx ⊢ apply succ_le_succ at hx apply le_zero at hx rw [hx] right rfl ``` If you solved this level then you should be fine with the next level!
fr: Voici ma preuve : ``` cases x with y left rfl rw [one_eq_succ_zero] at hx ⊢ apply succ_le_succ at hx apply le_zero at hx rw [hx] right rfl ``` Si vous avez résolu ce niveau, vous devriez vous en sortir avec le niveau suivant !
it: Ecco la mia dimostrazione: ``` cases x with y left rfl rw [one_eq_succ_zero] at hx ⊢ apply succ_le_succ at hx apply le_zero at hx rw [hx] right rfl ``` Se hai risolto questo livello allora puoi risolvere tranquillamente anche il successivo!
uk: Ось мій доказ: ``` cases x with y left rfl rw [one_eq_succ_zero] at hx ⊢ apply succ_le_succ at hx apply le_zero at hx rw [hx] right rfl ``` Якщо ви вирішите цей рівень, то у вас буде все добре з наступним рівнем!
zh: 这是我的证明： ``` cases x with y left rfl rw [one_eq_succ_zero] at hx ⊢ apply succ_le_succ at hx apply le_zero at hx rw [hx] right rfl ``` 如果你解决了这个关卡，那么你应该可以顺利进入下一个关卡！

source: `le_two x` is a proof that if `x ≤ 2` then `x = 0` or `x = 1` or `x = 2`.
fr: `le_two x` est une preuve que si `x ≤ 2` alors `x = 0` ou `x = 1` ou `x = 2`.
it: `le_two x` è la dimostrazione che se `x ≤ 2` allora `x = 0` o `x = 1` or `x = 2`.
uk: `le_two x` є доказом того, що якщо `x ≤ 2`, то `x = 0` або `x = 1` або `x = 2`.
zh: `le_two x` 证明了如果 `x ≤ 2` 则 `x = 0` 或 `x = 1` 或 `x = 2`。

source: We'll need this lemma to prove that two is prime! You'll need to know that `∨` is right associative. This means that `x = 0 ∨ x = 1 ∨ x = 2` actually means `x = 0 ∨ (x = 1 ∨ x = 2)`. This affects how `left` and `right` work.
fr: Nous aurons besoin de ce lemme pour prouver que deux est premier ! Vous devrez savoir que `∨` est associatif à droite. Cela veut dire que `x = 0 ∨ x = 1 ∨ x = 2` signifie en fait `x = 0 ∨ (x = 1 ∨ x = 2)`. C'est important à comprendre pour le fonctionnement de `left` et `right`.
it: Questo lemma ci aiuterà a dimostrare che due è un numero primo! Qui ti serve sapere che `∨` associa a destra. Significa che `x = 0 ∨ x = 1 ∨ x = 2` sta in realtà per `x = 0 ∨ (x = 1 ∨ x = 2)`. L'associatività influisce sul comportamento di `left` e `right`.
uk: Нам знадобиться ця лема, щоб довести, що два є простим числом! Вам потрібно знати, що `∨` є право-асоціативно. Це означає, що `x = 0 ∨ x = 1 ∨ x = 2` насправді означає `x = 0 ∨ (x = 1 ∨ x = 2)`. Це впливає на роботу `left` та `right`.
zh: 我们需要这个引理来证明二是质数！ 你需要知道 `∨` 是右结合的。这意味着 `x = 0 ∨ x = 1 ∨ x = 2` 实际上意味着 `x = 0 ∨ (x = 1 ∨ x = 2)`。这会影响 `left` 和 `right` 的工作方式。

source: If $x \leq 2$ then $x = 0$ or $1$ or $2$.
fr: Si $x \leq 2$ alors $x = 0$ ou $1$ ou $2$.
it: Se $x \leq 2$ allora $x = 0$ o $1$ o $2$.
uk: Якщо $x \leq 2$, то $x = 0$ або $1$ або $2$.
zh: 如果是 $x \leq 2$，那么 $x = 0$ 或 $1$ 或 $2$。

source: Nice! The next step in the development of order theory is to develop the theory of the interplay between `≤` and multiplication. If you've already done Multiplication World, you're now ready for Advanced Multiplication World. Click on "Leave World" to access it.
fr: Bien ! La prochaine étape dans le développement de la théorie de l'ordre est de développer la théorie de l'interaction entre `≤` et la multiplication. Si vous avez déjà fait le monde de la Multiplication, vous êtes maintenant prêt pour le monde de la Multiplication Avancée. Cliquez sur "Quitter le monde" pour y accéder.
it: Bene! Il passo successivo nello sviluppo della teoria degli ordini è sviluppare la teoria dell'interazione tra `≤` e la moltiplicazione. Se hai già fatto il Mondo Moltiplicazione, sei pronto per ascendere al Mondo Moltiplicazione Avanzata. Clicca su "Abbandona mondo" per accedervi.
uk: Гарно! Наступним кроком у розвитку теорії порядку є розробка теорія взаємодії між `≤` і множенням. Якщо ви вже працювали зі Світом множення, тепер ви готові до Розширеного світу множення. Натисніть «Залишити світ», щоб отримати до нього доступ.
zh: 很棒！ 发展序理论的下一步是发展 `≤` 与乘法之间相互作用的理论。 如果你已经完成了乘法世界，那么就可以进入高级乘法世界。点击 "离开世界 "进入。

source: ≤ World
fr: Monde ≤
it: Mondo ≤
uk: Світ ≤
zh: ≤ 世界

source: In this world we define `a ≤ b` and prove standard facts about it, such as "if `a ≤ b` and `b ≤ c` then `a ≤ c`." The definition of `a ≤ b` is "there exists a number `c` such that `b = a + c`. " So we're going to have to learn a tactic to prove "exists" theorems, and another one to use "exists" hypotheses. Click on "Start" to proceed.
fr: Dans ce monde, nous définissons `a ≤ b` et prouvons des faits classiques à ce sujet, comme "si `a ≤ b` et `b ≤ c` alors `a ≤ c`." La définition de `a ≤ b` est "il existe un nombre `c` tel que `b = a + c`". Nous allons donc devoir apprendre une tactique pour prouver des théorèmes "existentiels", et une autre pour utiliser des hypothèses "existentielles". Cliquez sur "Commencer" pour continuer.
it: In questo mondo diamo la definizione `a ≤ b` e dimostreremo qualche fatto comune sulle diseguaglianze, come "se ho `a ≤ b` e `b ≤ c`, allora `a ≤ c`". La definizione di `a ≤ b` è "esiste un numero `c` tale che `b = a + c`". Dunque avremo bisogno di imparare una tattica che dimostri i teoremi con "esiste", e un'altra tattica per utilizzare gli "esiste" nelle ipotesi. Premi su "Via" per procedere.
uk: У цьому світі ми визначаємо `a ≤ b` і доводимо стандартні факти про нерівність, наприклад «якщо `a ≤ b` і `b ≤ c`, то `a ≤ c`». Визначення `a ≤ b` таке: «існує число `c` таке, що `b = a + c`. «Тож нам доведеться навчитися тактик доведення теорем «існування» та інших використовуючи гіпотези «існує». Натисніть «Почати», щоб продовжити.
zh: 在这个世界中，我们定义 `a ≤ b` 并证明关于它的一些事实，例如“如果 `a ≤ b` 且 `b ≤ c` 那么 `a ≤ c`。” `a ≤ b` 的定义是“存在一个数字 `c` 使得 `b = a + c`。”所以我们将不得不学习一种策略来证明“存在”定理，以及另一种策略来使用“存在”假设。 点击“开始”继续。

source: `mul_le_mul_right a b t` is a proof that `a ≤ b → a * t ≤ b * t`.
fr: `mul_le_mul_right a b t` est une preuve que `a ≤ b → a * t ≤ b * t`.
it: `mul_le_mul_right a b t` è la dimostrazione che `a ≤ b → a * t ≤ b * t`.
uk: `mul_le_mul_right a b t` є доказом того, що `a ≤ b → a * t ≤ b * t`.
zh: `mul_le_mul_right a b t` 是 `a ≤ b → a * t ≤ b * t` 的证明。

source: Let's warm up with an easy one, which works even if `t = 0`.
fr: Échauffons-nous avec un exercice facile, qui fonctionne même si `t = 0`.
it: Riscaldiamoci le dita con un teorema facile, che vale anche per `t = 0`.
uk: Давайте розігріємося із легкою задачею, яка працює, навіть якщо `t = 0`.
zh: 让我们用一个简单的问题来热热身，即使 `t = 0` 也可以。

source: My proof: ``` cases h with d hd use d * t rw [hd, add_mul] rfl ```
fr: Ma preuve : ``` cases h with d hd use d * t rw [hd, add_mul] rfl ```
it: La mia dimostrazione: ``` cases h with d hd use d * t rw [hd, add_mul] rfl ```
uk: Мій доказ: ``` cases h with d hd use d * t rw [hd, add_mul] rfl ```
zh: 我的证明： ``` cases h with d hd use d * t rw [hd, add_mul] rfl ```

source: mul_left_ne_zero
uk: mul_left_not_zero

source: `mul_left_ne_zero a b` is a proof that `a * b ≠ 0 → b ≠ 0`.
fr: `mul_left_ne_zero a b` est une preuve que `a * b ≠ 0 → b ≠ 0`.
it: `mul_left_ne_zero a b` è la dimostrazione che `a * b ≠ 0 → b ≠ 0`.
uk: `mul_left_ne_zero a b` є доказом того, що `a * b ≠ 0 → b ≠ 0`.
zh: `mul_left_ne_zero a b` 是`a * b ≠ 0 → b ≠ 0` 的证明。

source: If you have completed Algorithm World then you can use the `contrapose!` tactic here. If not then I'll talk you through a manual approach.
fr: Si vous avez terminé le monde Algorithmique, vous pouvez utiliser la tactique `contrapose!` ici. Sinon, je vais vous guider à travers une approche manuelle.
it: Se hai già completato il Mondo Algoritmi puoi usare la tattica `contrapose!` qui. Altrimenti ti farò vedere un approccio manuale.
uk: Якщо ви завершили Світ алгоритмів, ви можете використовувати тактику `contrapose!` тут. Якщо ні, я покажу вам ручний підхід.
zh: 如果你已经完成了算法世界，那么你可以在这里使用 `contrapose!` 策略。 如果没有，那么我会指导你使用一种手动方法。

source: We want to reduce this to a hypothesis `b = 0` and a goal `a * b = 0`, which is logically equivalent but much easier to prove. Remember that `X ≠ 0` is notation for `X = 0 → False`. Click on `Show more help!` if you need hints.
fr: Nous voulons réduire cela à une hypothèse `b = 0` et un but `a * b = 0`, ce qui est logiquement équivalent mais beaucoup plus facile à prouver. Rappelez-vous que `X ≠ 0` est une notation pour `X = 0 → False`. Cliquez sur `Afficher plus d'aide !` si vous avez besoin d'indices.
it: Vogliamo ridurre questo teorema a un'ipotesi `b = 0` e a un goal `a * b = 0`, che insieme sono logicamente equivalenti all'originale ma più facili da dimostrare. Ricorda che `X ≠ 0` è zucchero sintattico per `X = 0 → False`. Clicca su `Aiutami!` se hai bisogno di un indizio.
uk: Ми хочемо звести це до гіпотези `b = 0` і мети `a * b = 0`, що логічно еквівалентно, але набагато легше довести. Пам’ятайте, що `X ≠ 0` це позначення для `X = 0 → False`. Натисніть `Показати більше допомоги!`, якщо вам потрібні підказки.
zh: 我们想将这个问题简化为假设 `b = 0` 和目标 `a * b = 0`，这在逻辑上是等价的，但更容易证明。 记住，`x ≠ 0` 是 `x = 0 → False` 的符号表示。如果你需要提示，请点击`显示更多帮助！`。

source: Start with `intro hb`.
fr: Commencez par `intro hb`.
it: Inizia con `intro hb`.
uk: Почніть із `intro hb`.
zh: 从 `intro hb` 开始。

source: Now `apply h` and you can probably take it from here.
fr: Maintenant `apply h` et vous pouvez probablement continuer à partir d'ici.
it: Ora fai `apply h` e credo che puoi proseguire da solo.
uk: Тепер `apply h`, і ви, ймовірно, зможете продовжити звідси.
zh: 现在使用 `apply h`，你也许可以从这里开始证明。

source: # Summary The `tauto` tactic will solve any goal which can be solved purely by logic (that is, by truth tables). ## Details `tauto` *does not do magic*! It doesn't know *anything* about addition or multiplication, it doesn't even know `add_zero`. The only things that `tauto` knows about numbers are firstly that `a = a` and secondly that `0 ≠ 1`, `0 ≠ 2`, `1 ≠ 2` and so on. What `tauto`'s strength is, is *logic*. If you have a hypothesis `x < 37` and another hypothesis `x < 37 → y + z = 42` and your goal is `y + z = 42` then `tauto` will solve this goal, because to solve that goal you don't need to know any facts about inequalities or addition, all you need to know is the rules of logic. ## Example If you have `False` as a hypothesis, then `tauto` will solve the goal. This is because a false hypothesis implies any hypothesis. ## Example If your goal is `True`, then `tauto` will solve the goal. ## Example If you have two hypotheses `h1 : a = 37` and `h2 : a ≠ 37` then `tauto` will solve the goal because it can prove `False` from your hypotheses, and thus prove the goal (as `False` implies anything). ## Example If you have one hypothesis `h : a ≠ a` then `tauto` will solve the goal because `tauto` is smart enough to know that `a = a` is true, which gives the contradiction we seek. ## Example If you have a hypothesis `h : 0 = 1` then `tauto` will solve the goal, because `tauto` knows `0 ≠ 1` and this is enough to prove `False`, which implies any goal. ## Example If you have a hypothesis of the form `a = 0 → a * b = 0` and your goal is `a * b ≠ 0 → a ≠ 0`, then `tauto` will solve the goal, because the goal is logically equivalent to the hypothesis. If you switch the goal and hypothesis in this example, `tauto` would solve it too.
fr: # Résumé La tactique `tauto` résoudra tout but qui peut être résolu purement par logique (c'est-à-dire par tables de vérité). ## Détails `tauto` *ne fait pas de magie* ! Il ne sait *rien* sur l'addition ou la multiplication, il ne connaît même pas `add_zero`. Les seules choses que `tauto` sait sur les nombres sont premièrement que `a = a` et deuxièmement que `0 ≠ 1`, `0 ≠ 2`, `1 ≠ 2`, etc. La force de `tauto` est la *logique*. Si vous avez une hypothèse `x < 37` et une autre hypothèse `x < 37 → y + z = 42` et que votre but est `y + z = 42`, alors `tauto` résoudra ce but, car pour résoudre ce but, vous n'avez pas besoin de connaître des faits sur les inégalités ou l'addition, tout ce que vous devez savoir ce sont les règles de la logique. ## Exemple Si vous avez `False` comme hypothèse, alors `tauto` résoudra le but. C'est parce qu'une hypothèse fausse implique n'importe quelle hypothèse. ## Exemple Si votre but est `True`, alors `tauto` résoudra le but. ## Exemple Si vous avez deux hypothèses `h1 : a = 37` et `h2 : a ≠ 37` alors `tauto` résoudra le but car il peut prouver `False` à partir de vos hypothèses, et ainsi prouver le but (car `False` implique n'importe quoi). ## Exemple Si vous avez une hypothèse `h : a ≠ a` alors `tauto` résoudra le but car `tauto` est assez intelligent pour savoir que `a = a` est vrai, ce qui donne la contradiction que nous cherchons. ## Exemple Si vous avez une hypothèse `h : 0 = 1` alors `tauto` résoudra le but, car `tauto` sait que `0 ≠ 1` et cela suffit à prouver `False`, ce qui implique n'importe quel but. ## Exemple Si vous avez une hypothèse de la forme `a = 0 → a * b = 0` et que votre but est `a * b ≠ 0 → a ≠ 0`, alors `tauto` résoudra le but, car le but est logiquement équivalent à l'hypothèse. Si vous échangez le but et l'hypothèse dans cet exemple, `tauto` le résoudrait aussi.
uk: # Резюме Тактика `tauto` вирішить будь-яку мету, яка може бути розв’язана чисто логічно (тобто через таблиці істинності). ## Подробиці `tauto` *не робить магії*! Він не знає *нічого* про додавання чи множення, він навіть не знає `add_zero`. Єдине, що `tauto` знає про числа по-перше, що `a = a`, а по-друге, `0 ≠ 1`, `0 ≠ 2`, `1 ≠ 2` і так далі. Сила `tauto` полягає в *логіці*. Якщо у вас є гіпотеза `x < 37` і інша гіпотеза `x < 37 → y + z = 42` і ваша мета `y + z = 42` тоді `tauto` вирішить цю мету, тому що для вирішення цієї мети вам не потрібно знати жодних фактів про нерівності чи додавання все, що вам потрібно знати, це правила логіки. ## Приклад Якщо у вас є `False` як гіпотеза, `tauto` вирішить мету. Це тому, що хибна гіпотеза передбачає будь-яку гіпотезу. ## Приклад Якщо ваша мета `True`, тоді `tauto` вирішить мету. ## Приклад Якщо у вас є дві гіпотези `h1 : a = 37` і `h2 : a ≠ 37`, тоді `tauto` розв’яже ціль, тому що він може вивести `False` із вашої гіпотези, і таким чином доведе мету (оскільки `False` означає будь-що). ## Приклад Якщо у вас є одна гіпотеза `h : a ≠ a`, тоді `tauto` вирішить мету, оскільки `tauto` достатньо розумний, щоб знати, що `a = a` є істинним, що створює суперечність, яку ми шукаємо. ## Приклад Якщо у вас є гіпотеза `h : 0 = 1`, то `tauto` вирішить мету, оскільки `tauto` знає `0 ≠ 1`, і цього достатньо, щоб довести `False`, що передбачає будь-яку мету. ## Приклад Якщо у вас є гіпотеза у вигляді `a = 0 → a * b = 0` і ваша мета `a * b ≠ 0 → a ≠ 0`, то `tauto` вирішить мету, оскільки мета логічно еквівалентна гіпотезі. Якщо ви поміняєте мету і гіпотезу в цьому прикладі, `tauto` також вирішить це.

source: `eq_succ_of_ne_zero a` is a proof that `a ≠ 0 → ∃ n, a = succ n`.
fr: `eq_succ_of_ne_zero a` est une preuve que `a ≠ 0 → ∃ n, a = succ n`.
it: `eq_succ_of_ne_zero a` è la dimostrazione che `a ≠ 0 → ∃ n, a = succ n`.
uk: `eq_succ_of_ne_zero a` є доказом того, що `a ≠ 0 → ∃ n, a = succ n`.
zh: `eq_succ_of_ne_zero a` 是 `a≠0 → ∃ n, a = succ n` 的证明。

source: Multiplication usually makes a number bigger, but multiplication by zero can make it smaller. Thus many lemmas about inequalities and multiplication need the hypothesis `a ≠ 0`. Here is a key lemma that enables us to use this hypothesis. To help us with the proof, we can use the `tauto` tactic. Click on the tactic's name on the right to see what it does.
fr: La multiplication transforme généralement un nombre en un noùmbre plus grand, mais la multiplication par zéro peut le rendre plus petit. Ainsi, de nombreux lemmes sur les inégalités et la multiplication nécessitent l' hypothèse `a ≠ 0`. Voici un lemme clé qui nous permet d'utiliser cette hypothèse. Pour la preuve, nous pouvons utiliser la tactique `tauto`. Cliquez sur le nom de la tactique à droite pour voir ce qu'elle fait.
uk: Множення зазвичай збільшує число, але множення на нуль може зробити його меншим. Тому багато лем про нерівності та множення потребують гіпотези `a ≠ 0`. Ось ключова лема, яка дозволяє нам використовувати цю гіпотезу. Щоб допомогти нам із доказом, ми можемо використати тактику `tauto`. Натисніть на назву тактики праворуч, щоб побачити, що вона робить.

source: Start with `cases a with d` to do a case split on `a = 0` and `a = succ d`.
fr: Commencez par `cases a with d` pour faire une division de cas sur `a = 0` et `a = succ d`.
it: Inizia con `cases a with d` per spezzare il numero nei casi `a = 0` e `a = succ d`.
uk: Почніть із `cases a with d`, щоб розділити випадки на `a = 0` і `a = succ d`.
zh: 从用 `cases a with d` 开始，对 `a = 0` 和 `a = succ d` 进行类讨论。
