Repository: leanprover-community/NNG4
Catalog: .i18n/*/Game.po
Languages: fr, it, uk, zh

source: In this level the *goal* is $2y=2(x+7)$ but to help us we have an *assumption* `h` saying that $y = x + 7$. Check that you can see `h` in your list of assumptions. Lean thinks of `h` as being a secret proof of the assumption, rather like `x` is a secret number. Before we can use `rfl`, we have to "substitute in for $y$". We do this in Lean by *rewriting* the proof `h`, using the `rw` tactic.
fr: Dans ce niveau, le *but* est $2y=2(x+7)$ mais pour nous aider, nous avons une *hypothèse* `h` disant que $y = x + 7$. Vérifiez que vous pouvez voir `h` dans votre liste d'hypothèses. Lean considère `h` comme une preuve secrète de l'hypothèse, un peu comme `x` est un nombre secret. Avant de pouvoir utiliser `rfl`, nous devons "substituer $y$". Nous faisons cela dans Lean en *réécrivant* la preuve `h`, en utilisant la tactique `rw`.
it: In questo livello il *goal* è $2y=2(x+7)$ e l'unica informazione che può aiutarci a dimostrarlo è l'*ipotesi* `h` che dice $y = x + 7$. Verifica di avere `h` sotto la voce "Ipotesi". Lean vede `h` come una dimostrazione segreta dell'ipotesi, un po' come il valore della variabile `x` è un'incognita. Prima di poter usare la tattica `rfl`, dobbiamo "sostituire per la variabile $y$". In Lean possiamo *riscrivere* la dimostrazione `h` attraverso la tattica `rw`.
uk: На цьому рівні *мета* це $2y=2(x+7)$, але щоб допомогти нам, ми маємо *припущення* `h`, що $y = x + 7$. Переконайтеся, що ви бачите `h` в вашому списку припущень. Lean вважає `h` секретним доказом припущення, схожим на те, як `x` є секретним числом. Перш ніж ми зможемо використовувати `rfl`, ми повинні "замінити всередині $y$". Ми робимо це в Lean, *переписуючи* доказ `h`, використовуючи тактику `rw`.
zh: 在这个关卡里，*目标*是证明 $2y=2(x+7)$。现在我们有一条*假设* `h`，它指出 $y = x + 7$。请检查假设列表中是否包含了 `h`。在 Lean 中，`h` 被视为一种假设存在的证据，这有点像 `x` 是一个未知的具体数值。 要想使用 `rfl` 完成证明，我们首先需要对 $y$ 进行替换。在 Lean 中，我们可以通过*重写*证明 `h` 来实现这一点，即使用 `rw` 策略。

source: If $x$ and $y$ are natural numbers, and $y = x + 7$, then $2y = 2(x + 7)$.
fr: Si $x$ et $y$ sont des nombres naturels, et $y = x + 7$, alors $2y = 2(x + 7)$.
it: Se $x$ e $y$ sono numeri naturali, e $y = x + 7$, allora $2y = 2(x + 7)$.
uk: Якщо $x$ і $y$ це натуральні числа, а $y = x + 7$, тоді $2y = 2(x + 7)$.
zh: 如果 $x$ 和 $y$ 是自然数，并且 $y = x + 7$，那么 $2y = 2(x + 7)$。

source: First execute `rw [h]` to replace the `y` with `x + 7`.
fr: Commencez par exécuter `rw [h]` pour remplacer `y` par `x + 7`.
it: Innanzitutto, esegui `rw [h]` per sostituire `y` con `x + 7`.
uk: Спочатку виконайте `rw [h]`, щоб замінити `y` на `x + 7`.
zh: 首先执行 `rw [h]` 将 `y` 替换为 `x + 7`。

source: Can you take it from here? Click on "Show more help!" if you need a hint.
fr: Pouvez-vous continuer ? Cliquez sur "Afficher plus d'aide !" si vous avez besoin d'un indice.
it: Riesci a finire la dimostrazione da solo? Clicca su "Aiutami!" se hai bisogno di un indizio.
uk: Чи можете ви продовжити доказ звідси? Натисніть «Показати додаткову довідку!» якщо вам потрібна підказка.
zh: 你能从这里开始吗？如果您需要提示，请点击 "显示更多帮助！"。

source: Now `rfl` will work.
fr: Maintenant `rfl` fonctionnera.
it: Adesso `rfl` funzionerà.
uk: Тепер `rfl` запрацює.
zh: 现在可以用 `rfl` 了。

source: You now know enough tactics to prove `2 + 2 = 4`! Let's begin the journey.
fr: Vous connaissez maintenant assez de tactiques pour prouver `2 + 2 = 4` ! Commençons le voyage.
it: Ora conosci abbastanza tattiche per dimostrare `2 + 2 = 4`! Proseguiamo l'avventura.
uk: Тепер ви знаєте достатньо тактик, щоб довести `2 + 2 = 4`! Почнемо подорож.
zh: 你现在已经学会了足够的策略来证明 `2 + 2 = 4`！让我们开始这段旅程吧。

source: Numbers
fr: Nombres
it: Numeri
uk: Числа
zh: 数字

source: `ℕ` is the natural numbers, just called \"numbers\" in this game. It's defined via two rules: * `0 : ℕ` (zero is a number) * `succ (n : ℕ) : ℕ` (the successor of a number is a number) ## Game Implementation *The game uses its own copy of the natural numbers, called `MyNat` with notation `ℕ`. It is distinct from the Lean natural numbers `Nat`, which should hopefully never leak into the natural number game.*
fr: `ℕ` représente les nombres naturels, simplement appelés "nombres" dans ce jeu. Ils sont définis par deux règles : * `0 : ℕ` (zéro est un nombre) * `succ (n : ℕ) : ℕ` (le successeur d'un nombre est un nombre) ## Implémentation dans le jeu *Le jeu utilise sa propre copie des nombres naturels, appelée `MyNat` avec la notation `ℕ`. Elle est distincte des nombres naturels de Lean `Nat`, qui ne devraient normalement jamais apparaître dans le jeu des nombres naturels.*
it: `ℕ` denota l'insieme dei numeri naturali, che chiameremo semplicemente \"numeri \" nel resto del gioco. Questo insieme è definito tramite due regole: * `0 : ℕ` (zero è un numero) * `succ (n: ℕ): ℕ` (il successore di un numero è un numero) ## Implementazione del gioco *Il gioco usa una versione propria dei numeri naturali - chiamata `Mynat` con notazione` ℕ` - diversa dal tipo primitivo dei numeri naturali di Lean `Nat`; quest'ultimo non dovrebbe venire utilizzato nel contesto del gioco.*
uk: `ℕ` — це натуральні числа, які в цій грі просто називаються \"числа\". Вони визначається двома правилами: * `0 : ℕ` (нуль - це число) * `succ (n : ℕ) : ℕ` (наступник числа є числом) ## Реалізація у гри *У грі використовується власна копія натуральних чисел, яка називається `MyNat` з позначенням `ℕ`. Вона відрізняється від натуральних чисел Lean `Nat`, які, сподіваємося, не повинні ніколи просочуйтеся в гру натуральних чисел.*
zh: `ℕ` 是自然数，在这个游戏中简称为“数字”。它通过两条规则定义： * `0 : ℕ`（零是自然数） * `succ (n : ℕ) : ℕ`（自然数的后继数是自然数） ## 游戏实现 *游戏使用自己重新定义的自然数，称为 `MyNat`，标记为 `ℕ`。它不同于 Lean 自然数 `Nat`，后者不应泄露到自然数游戏中。*

source: `one_eq_succ_zero` is a proof of `1 = succ 0`."
fr: `one_eq_succ_zero` est une preuve que `1 = succ 0`.
it: `one_eq_succ_zero` è la dimostrazione di `1 = succ 0`."
uk: `one_eq_succ_zero` є доказом `1 = succ 0`."
zh: `one_eq_succ_zero` 是 `1 = succ 0`的证明。

source: `two_eq_succ_one` is a proof of `2 = succ 1`.
fr: `two_eq_succ_one` est une preuve que `2 = succ 1`.
it: `two_eq_succ_one` è la dimostrazione di `2 = succ 1`.
uk: `two_eq_succ_one` є доказом `2 = succ 1`.
zh: `two_eq_succ_one` 是 `2 = succ 1` 的证明。

source: `three_eq_succ_two` is a proof of `3 = succ 2`.
fr: `three_eq_succ_two` est une preuve que `3 = succ 2`.
it: `three_eq_succ_two` è la dimostrazione di `3 = succ 2`.
uk: `three_eq_succ_two` є доказом `3 = succ 2`.
zh: `three_eq_succ_two` 是 `3 = succ 2` 的证明。

source: `four_eq_succ_three` is a proof of `4 = succ 3`.
fr: `four_eq_succ_three` est une preuve que `4 = succ 3`.
it: `four_eq_succ_three` è la dimostrazione di `4 = succ 3`.
uk: `four_eq_succ_three` є доказом `4 = succ 3`.
zh: `four_eq_succ_three` 是 `4 = succ 3` 的证明。

source: ## The birth of number. Numbers in Lean are defined by two rules. * `0` is a number. * If `n` is a number, then the *successor* `succ n` of `n` is a number. The successor of `n` means the number after `n`. Let's learn to count, and name a few small numbers. ## Counting to four. `0` is a number, so `succ 0` is a number. Let's call this new number `1`. Similarly let's define `2 = succ 1`, `3 = succ 2` and `4 = succ 3`. This gives us plenty of numbers to be getting along with. The *proof* that `2 = succ 1` is called `two_eq_succ_one`. Check out the "012" tab in the list of lemmas on the right for this and other proofs. Let's prove that $2$ is the number after the number after zero.
fr: ## La naissance des nombres. Les nombres dans Lean sont définis par deux règles. * `0` est un nombre. * Si `n` est un nombre, alors le *successeur* `succ n` de `n` est un nombre. Le successeur de `n` signifie le nombre après `n`. Apprenons à compter et nommons quelques petits nombres. ## Compter jusqu'à quatre. `0` est un nombre, donc `succ 0` est un nombre. Appelons ce nouveau nombre `1`. De même, définissons `2 = succ 1`, `3 = succ 2` et `4 = succ 3`. Cela nous donne suffisamment de nombres pour commencer. La *preuve* que `2 = succ 1` s'appelle `two_eq_succ_one`. Consultez l'onglet "012" dans la liste des lemmes à droite pour cette preuve et d'autres. Prouvons que $2$ est le nombre après le nombre après zéro.
it: ## La nascita dei numeri I numeri in Lean sono definiti da due regole: * `0` è un numero. * Se `n` è un numero, allora il *successore* `succ n` di `n` è un numero. Il successore di `n` è il numero che viene dopo `n`. Impariamo a contare in questo sistema, provando a scrivere alcuni numeri piccoli. ## Contiamo fino a quattro `0` è un numero, e `succ 0` è un numero. Diamo a quest'ultimo numero il nome `1`. In modo simile, definiamo `2 = succ 1`, `3 = succ 2` e `4 = succ 3`. Questi primi quattro numeri sono più che sufficienti per proseguire il nostro ragionamento. La *dimostrazione* di `2 = succ 1` si chiama `two_eq_succ_one`. Puoi trovarla cliccando sul tab "012" nella lista di lemmi a destra nell'interfaccia, dove vedrai lei e altre dimostrazioni. Ora dimostriamo che $2$ è il numero che viene dopo il numero che viene dopo zero.
uk: ## Народження числа. Числа в Lean визначаються двома правилами. * `0` - це число. * Якщо `n` є числом, то *наступник* `succ n` числа `n` також є числом. Наступник `n` означає число після `n`. Давайте навчимося рахувати і дамо назви декільком маленьким числам. ## Порахувати до чотирьох. `0` є числом, тому `succ 0` є числом. Назвемо це нове число `1`. Подібним чином визначимо `2 = succ 1`, `3 = succ 2` і `4 = succ 3`. Це дає нам багато чисел, з якими можна мати справи. *Доказ* того, що `2 = succ 1` називається `two_eq_succ_one`. Перегляньте вкладку "012" у списку лем праворуч для цього та інших доказів. Доведемо, що $2$ — це число після числа після нуля.
zh: ## 自然数的定义 在 Lean 中，自然数的定义基于两个简单的规则： * `0` 被认为是一个自然数。 * 如果 `n` 是一个自然数，那么 `n` 的*后继数* `succ n` 也是一个自然数。 这里，`n`的后继数指的是紧跟在 `n` 之后的自然数。让我们通过这种方式来计数，并为一些小数字命名。 ## 计数至四 由于 `0` 是自然数，因此 `succ 0`（`0`的后继数）也是自然数。我们将这个新的自然数命名为 `1`。 同样的逻辑，我们定义 `2 = succ 1`、`3 = succ 2` 和 `4 = succ 3`。 这样，我们就拥有了足够的数字去应对接下来的挑战。 证明 `2 = succ 1` 的定理被称为 `two_eq_succ_one`。 请查阅右侧定理列表中的“012”标签，以了解这个证明及其他相关的证明。 现在，让我们来证明 $2$ 是从零开始后的第二个数字。

source: $2$ is the number after the number after $0$.
fr: $2$ est le nombre après le nombre après $0$.
it: $2$ è il numero che viene dopo il numero che viene dopo $0$.
uk: $2$ – це число після числа після $0$.
zh: $2$ 是 $0$ 之后再之后的数字。

source: Start with `rw [two_eq_succ_one]` to begin to break `2` down into its definition.
fr: Commencez par `rw [two_eq_succ_one]` pour commencer à décomposer `2` selon sa définition.
it: Inizia eseguendo `rw [two_eq_succ_one]` per sostituire `2` con la sua definizione.
uk: Почніть із `rw [two_eq_succ_one]`, щоб розділити `2` згідно його визначення.
zh: 从使用 `rw [two_eq_succ_one]` 开始，将 `2` 分解为它的定义。

source: Can you take it from here?
fr: Pouvez-vous continuer ?
it: Sai proseguire da solo?
uk: Ви можете продовжити рішення звідси?
zh: 你能从这里接手吗？

source: Next turn `1` into `succ 0` with `rw [one_eq_succ_zero]`.
fr: Ensuite, transformez `1` en `succ 0` avec `rw [one_eq_succ_zero]`.
it: Adesso rendi `1` in uno `succ 0` con `rw [one_eq_succ_zero]`.
uk: Потім перетворіть `1` на `succ 0` за допомогою `rw [one_eq_succ_zero]`.
zh: 接下来用 `rw [one_eq_succ_zero]` 把 `1` 变成 `succ 0'。

source: Now finish the job with `rfl`.
fr: Terminez maintenant avec `rfl`.
it: Concludi la dimostrazione con `rfl`.
uk: Тепер завершіть роботу за допомогою `rfl`.
zh: 现在用 `rfl` 完成证明。

source: Note that you can do `rw [two_eq_succ_one, one_eq_succ_zero]` and then `rfl` to solve this level in two lines.
fr: Notez que vous pouvez faire `rw [two_eq_succ_one, one_eq_succ_zero]` puis `rfl` pour résoudre ce niveau en deux lignes.
it: Puoi anche fare `rw [two_eq_succ_one, one_eq_succ_zero]` e poi `rfl` per risolvere questo livello in due sole righe.
uk: Зауважте, що ви можете зробити `rw [two_eq_succ_one, one_eq_succ_zero]` а потім `rfl`, щоб вирішити цей рівень у два рядки.
zh: 请注意，您可以先使用 `rw [two_eq_succ_one, one_eq_succ_zero]` 然后再用 `rfl` 来快速通过这关。

source: rewriting backwards
fr: réécriture à l'envers
it: riscrivere all'indietro
uk: переписуючи задом наперед
zh: 逆向重写

source: If `h` is a proof of `X = Y` then `rw [h]` will turn `X`s into `Y`s. But what if we want to turn `Y`s into `X`s? To tell the `rw` tactic we want this, we use a left arrow `←`. Type `\l` and then hit the space bar to get this arrow. Let's prove that $2$ is the number after the number after $0$ again, this time by changing `succ (succ 0)` into `2`.
fr: Si `h` est une preuve de `X = Y` alors `rw [h]` transformera les `X` en `Y`. Mais que faire si nous voulons transformer les `Y` en `X` ? Pour indiquer à la tactique `rw` que nous voulons cela, nous utilisons une flèche gauche `←`. Tapez `\l` puis appuyez sur la barre d'espace pour obtenir cette flèche. Prouvons à nouveau que $2$ est le nombre après le nombre après $0$, cette fois en changeant `succ (succ 0)` en `2`.
it: Se `h` è una prova di `X = Y` allora `rw [h]` riscriverà le `X` in `Y`. E se volessimo invece riscrive le `Y` in `X`? Per dire alla tattica `rw` che vogliamo riscrivere nell'altro verso, usiamo una freccetta a sinistra `←`. Per ottenere questa freccetta, digita `\l` e premi la barra spaziatrice. Dimostriamo che $2$ è il numero che viene dopo il numero che viene dopo $0$ di nuovo, però questa volta procediamo nel senso opposto, trasformando `succ (succ 0)` in `2`.
uk: Якщо `h` є доказом `X = Y`, тоді `rw [h]` буде перетворювати `X` на `Y`. Але що, якщо ми хочемо перетворити `Y` на `X`? Шоб сказати тактиці `rw` що ми хочемо цього, ми використовуємо стрілку вліво `←`. Напечатайте `\l`, а потім натисніть пробіл, щоб отримати цю стрілку. Давайте доведемо, що $2$ є числом після числа після $0$, цього разу змінивши `succ (succ 0)` на "2".
zh: 如果 `h` 是 `X = Y` 的证明，那么 `rw [h]` 将 `X` 转换为 `Y`s。但如果我们想要 将 `Y`s 转换为 `X`s怎么办？我们使用左箭头 `←` 来告诉`rw`策略 我们想要这个。输入 `\l` 然后按空格键来输入这个箭头。 我们来证明一下 $2$ 就是 $0$ 之后再之后的数字。请将`succ (succ 0)` 重写为 `2`。

source: Try `rw [← one_eq_succ_zero]` to change `succ 0` into `1`.
fr: Essayez `rw [← one_eq_succ_zero]` pour changer `succ 0` en `1`.
it: Scrivi `rw [← one_eq_succ_zero]` per trasformare `succ 0` in `1`.
uk: Спробуйте `rw [← one_eq_succ_zero]`, щоб змінити `succ 0` на `1`.
zh: 尝试用 `rw [← one_eq_succ_zero]` 将 `succ 0` 改为 `1`。

source: Can you now change the goal into `2 = 2`?
fr: Pouvez-vous maintenant changer le but en `2 = 2` ?
it: Puoi trasformare il goal in `2 = 2`?
uk: Чи можете ви тепер перетворити мету на `2 = 2`?
zh: 你现在能将目标改为 "2 = 2 "吗？

source: Now `rw [← two_eq_succ_one]` will change `succ 1` into `2`.
fr: Maintenant `rw [← two_eq_succ_one]` changera `succ 1` en `2`.
it: Ora con `rw [← two_eq_succ_one]` `succ 1` diventa `2`.
uk: Тепер `rw [← two_eq_succ_one]` змінить `succ 1` на `2`.
zh: 现在 `rw [← two_eq_succ_one]` 会把 `succ 1` 改为 `2`。

source: Why did we not just define `succ n` to be `n + 1`? Because we have not even *defined* addition yet! We'll do that in the next level.
fr: Pourquoi n'avons-nous pas simplement défini `succ n` comme `n + 1` ? Parce que nous n'avons pas encore *défini* l'addition ! Nous ferons cela au niveau suivant.
it: Come mai non abbiamo definito `succ n` semplicemente come `n + 1`? Perché non abbiamo ancora *definito* il concetto di addizione! Provvederemo nel prossimo livello.
uk: Чому ми просто не визначили `succ n` як `n + 1`? Тому що ми не маємо ще навіть *визначення* додаванню! Ми зробимо це на наступному рівні.
zh: 为什么我们不直接将 `succ n` 定义为 `n + 1`？因为我们还没有 *定义* 加法！我们将在下一关做到这一点。

source: Adding zero
fr: Ajouter zéro
it: Sommare zero
uk: Додавання нуля
zh: 加零

source: `Add a b`, with notation `a + b`, is the usual sum of natural numbers. Internally it is defined via the following two hypotheses: * `add_zero a : a + 0 = a` * `add_succ a b : a + succ b = succ (a + b)` Other theorems about naturals, such as `zero_add a : 0 + a = a`, are proved by induction using these two basic theorems."
fr: `Add a b`, avec la notation `a + b`, est la somme habituelle des nombres naturels. En interne, elle est définie par les deux hypothèses suivantes : * `add_zero a : a + 0 = a` * `add_succ a b : a + succ b = succ (a + b)` D'autres théorèmes sur les naturels, comme `zero_add a : 0 + a = a`, sont prouvés par induction en utilisant ces deux théorèmes de base."
it: `Add a b`, con la notazione `a + b`, è l'operazione di addizione sui numeri naturali. Dentro Lean è definita tramite due ipotesi: * `add_zero a : a + 0 = a` * `add_succ a b : a + succ b = succ (a + b)` Gli altri teoremi sui numeri naturali e l'addizione, come `zero_add a : 0 + a = a`, si dimostrano per induzione usando questi due teoremi fondamentali."
uk: `Add a b` із нотацією `a + b` є звичайною сумою натуральних чисел. Внутрішньо це визначається через такі дві гіпотези: * `add_zero a : a + 0 = a` * `add_succ a b : a + succ b = succ (a + b)` Інші теореми про натуральні числа, такі як `zero_add a : 0 + a = a`, доводяться шляхом індукції із використанням цих двох основних теорем».
zh: `Add a b`，符号为 `a + b`，是 自然数之和。 通过以下两个假设定义： * `add_zero a : a + 0 = a` * `add_succ a b : a + succ b = succ (a + b)` 其他关于自然数的定理，例如 `zero_add a : 0 + a = a`，也 通过数学归纳法使用这两个基本定义进行证明。

source: `add_zero a` is a proof that `a + 0 = a`. ## Summary `add_zero` is really a function, which eats a number, and returns a proof of a theorem about that number. For example `add_zero 37` is a proof that `37 + 0 = 37`. The `rw` tactic will accept `rw [add_zero]` and will try to figure out which number you omitted to input. ## Details A mathematician sometimes thinks of `add_zero` as \"one thing\", namely a proof of $\forall n ∈ ℕ, n + 0 = n$. This is just another way of saying that it's a function which can eat any number n and will return a proof that `n + 0 = n`.
fr: `add_zero a` est une preuve que `a + 0 = a`. ## Résumé `add_zero` est en fait une fonction qui prend un nombre et renvoie une preuve d'un théorème sur ce nombre. Par exemple, `add_zero 37` est une preuve que `37 + 0 = 37`. La tactique `rw` acceptera `rw [add_zero]` et essaiera de déterminer quel nombre vous avez omis de spécifier. ## Détails Un mathématicien considère parfois `add_zero` comme "une seule chose", à savoir une preuve de $\forall n ∈ ℕ, n + 0 = n$. C'est juste une autre façon de dire que c'est une fonction qui peut prendre n'importe quel nombre n et renvoyer une preuve que `n + 0 = n`.
it: `add_zero a` è una prova della proposizione `a + 0 = a`. ## Descrizione `add_zero` in realtà è una funzione, che prende un numero, e restituisce una dimostrazione di un teorema che riguarda proprio quel numero. Ad esempio `add_zero 37` è una dimostrazione che `37 + 0 = 37`. La tattica `rw`, se usata come in `rw [add_zero]`, tenterà di capire da sola quale sia il numero da passare a `add_zero`. ## Dettagli Ai matematici piace pensare a `add_zero` come un'\"unica cosa\", ossia la dimostrazione che $\forall n ∈ ℕ, n + 0 = n$. Questa è un'altra notazione per dire che è una funzione che prende un qualsiasi numero n e restituisce una dimostrazione che `n + 0 = n`.
uk: `add_zero a` є доказом того, що `a + 0 = a`. ## Резюме `add_zero` насправді є функцією, яка з’їдає число та повертає доказ теореми про це число. Наприклад, `add_zero 37` є доказом того, що `37 + 0 = 37`. Тактика `rw` приймає `rw [add_zero]` і пробує з’ясувати, яке число ви пропустили як параметр. ## Деталі Математик іноді думає про `add_zero` як \"одну річ\", а саме доказ $\forall n ∈ ℕ, n + 0 = n$. Це просто інший спосіб сказати, що це функція, яка може з’їсти будь-яке число n і поверне доказ того, що `n + 0 = n`.
zh: `add_zero a` 是 `a + 0 = a` 的证明。 ## 小结 `add_zero` 实际上是一个函数，它接受一个数字，并返回关于那个数字的定理的证明。例如，`add_zero 37` 是 `37 + 0 = 37` 的证明。 `rw` 策略会接受 `rw [add_zero]` 并尝试推断出你省略输入的数字。 ## 细节 数学家有时将 `add_zero` 视为“一个东西”，即 $∀ n ∈ ℕ, n + 0 = n$ 的证明。这只是另一种说法，它是一个函数，可以接受任何数字 n 并返回 `n + 0 = n` 的证明。

source: ## Summary `repeat t` repeatedly applies the tactic `t` to the goal. You don't need to use this tactic, it just speeds things up sometimes. ## Example `repeat rw [add_zero]` will turn the goal `a + 0 + (0 + (0 + 0)) = b + 0 + 0` into the goal `a = b`.
fr: ## Résumé `repeat t` applique répétitivement la tactique `t` au but. Vous n'avez pas besoin d'utiliser cette tactique, elle accélère simplement les choses parfois. ## Exemple `repeat rw [add_zero]` transformera le but `a + 0 + (0 + (0 + 0)) = b + 0 + 0` en le but `a = b`.
it: ## Descrizione `repeat t` applica la tattica `t` nel goal ripetitivamente. Non è strettamente necessaria al fine di completare il gioco, ma a volte è utile per velocizzare le dimostrazioni. ## Esempio `repeat rw [add_zero]` trasformerà il goal `a + 0 + (0 + (0 + 0)) = b + 0 + 0` nel nuovo goal `a = b`.
uk: ## Резюме `repeat t` неодноразово застосовує тактику `t` до мети. Вам не потрібно використовувати цю тактику, іноді вона просто прискорює речі. ## Приклад `repeat rw [add_zero]` перетворить мету `a + 0 + (0 + (0 + 0)) = b + 0 + 0` в мету `a = b`.
zh: ## 小结 `repeat t` 会重复应用策略 `t` 到目标上。你不一定要使用这个策略，它有时只是加快了速度。 ## 示例 `repeat rw [add_zero]` 会将目标 `a + 0 + (0 + (0 + 0)) = b + 0 + 0` 转变为目标 `a = b`。
