Repository: leanprover-community/NNG4
Catalog: .i18n/*/Game.po
Languages: fr, it, uk, zh

source: We define a function `is_zero` thus: ``` is_zero 0 := True is_zero (succ n) := False ``` We also create two lemmas, `is_zero_zero` and `is_zero_succ n`, saying that `is_zero 0 = True` and `is_zero (succ n) = False`. Let's use these lemmas to prove `succ_ne_zero`, Peano's Last Axiom. Actually, we have been using `zero_ne_succ` before, but it's handy to have this opposite version too, which can be proved in the same way. Note: you can cheat here by using `zero_ne_succ` but the point of this world is to show you how to *prove* results like that. If you can turn your goal into `True`, then the `trivial` tactic will solve it.
fr: Nous définissons une fonction `is_zero` ainsi : ``` is_zero 0 := True is_zero (succ n) := False ``` Nous créons également deux lemmes, `is_zero_zero` et `is_zero_succ n`, disant que `is_zero 0 = True` et `is_zero (succ n) = False`. Utilisons ces lemmes pour prouver `succ_ne_zero`, le dernier axiome de Peano. En fait, nous avons déjà utilisé `zero_ne_succ` auparavant, mais il est utile d'avoir cette version opposée aussi, qui peut être prouvée de la même manière. Note : vous pouvez tricher ici en utilisant `zero_ne_succ` mais l'objectif de ce monde est de vous montrer comment *prouver* des résultats comme celui-ci. Si vous pouvez transformer votre but en `True`, alors la tactique `trivial` le résoudra.
it: Definiamo la funzione `is_zero` così: ``` is_zero 0 := True is_zero (succ n) := False ``` E creiamo due lemmi associati, `is_zero_zero` e `is_zero_succ n`, che dicono che `is_zero 0 = True` e `is_zero (succ n) = False`. Usiamo questi due lemmi per dimostrare `succ_ne_zero`, l'ultimo assioma di Peano. Può sembrare ripetitivo perché abbiamo già `zero_ne_succ` nel nostro arsenale, ma è comodo avere anche la versione opposta, la cui dimostrazione è identica. Nota: ora potresti barare usando `zero_ne_succ`, ma l'obiettivo di questo mondo è proprio insegnarti a *dimostrare* tali risultati. Se riesci a riscrivere il goal a `True`, potrai risolverlo con la tattica `trivial`.
uk: Ми визначаємо функцію `is_zero` так: ``` is_zero 0 := True is_zero (succ n) := False ``` Ми також створюємо дві леми, `is_zero_zero` і `is_zero_succ n`, кажучи, що `is_zero 0 = True` і `is_zero (succ n) = False`. Давайте використаємо ці леми, щоб довести `succ_ne_zero`, Останню аксіому Пеано. Фактично, ми використовували `zero_ne_succ` раніше, але зручно мати цю протилежна версія також, яку можна довести таким же чином. Примітка: можна схитрити тут, використовуючи `zero_ne_succ`, але сенс цього світу - показати вам як *доводити* такі результати. Якщо ви можете перетворити свою мету на `True`, тоді тактика `trivial` її вирішить.
zh: 我们这样定义一个函数 `is_zero` ： ``` is_zero 0 := True is_zero (succ n) := False ``` 我们还创建两个引理 `is_zero_zero` 和 `is_zero_succ n`，表示 `is_zero 0 = True` 和 `is_zero (succ n) = False`。让我们使用这些引理来证明 `succ_ne_zero`，Peano 的 最后的公理。实际上，我们之前一直在使用 `zero_ne_succ`，但是有一个逆向的版本会很方便。 它可以用同样的方式证明。注意：你可以 通过使用 `zero_ne_succ` 在这里作弊，但这个世界的重点是展示 你如何 *证明* 这样的结果。 如果你能把你的目标变成`True`，那么`trivial` 策略（tactic）就能解决它。

source: `is_zero_zero` is a proof of `is_zero 0 = True`.
fr: `is_zero_zero` est une preuve de `is_zero 0 = True`.
it: `is_zero_zero` è la dimostrazione di `is_zero 0 = True`.
uk: `is_zero_zero` є доказом `is_zero 0 = True`.
zh: `is_zero_zero` 是 `is_zero 0 = True` 的证明。

source: `is_zero_succ a` is a proof of `is_zero (succ a) = False`.
fr: `is_zero_succ a` est une preuve de `is_zero (succ a) = False`.
it: `is_zero_succ a` è la dimostrazione di `is_zero (succ a) = False`.
uk: `is_zero_succ a` є доказом `is_zero (succ a) = False`.
zh: `is_zero_succ a` 是 `is_zero (succ a) = False` 的证明。

source: `succ_ne_zero a` is a proof of `succ a ≠ 0`.
fr: `succ_ne_zero a` est une preuve de `succ a ≠ 0`.
it: `succ_ne_zero a` è la dimostrazione di `succ a ≠ 0`.
uk: `succ_ne_zero a` є доказом `succ a ≠ 0`.
zh: `succ_ne_zero a` 是 `succ a ≠ 0` 的证明。

source: # Summary `trivial` will solve the goal `True`.
fr: # Résumé `trivial` résoudra le but `True`.
it: # Descrizione `trivial` risolve il goal `True`.
uk: # Резюме `trivial` вирішить мету `True`.
zh: ## 概述 `trivial` 将解决目标 `True`。

source: Start with `intro h` (remembering that `X ≠ Y` is just notation for `X = Y → False`).
fr: Commencez par `intro h` (en rappelant que `X ≠ Y` est juste une notation pour `X = Y → False`).
it: Parti con `intro h` (ricordandoti che `X ≠ Y` è notazione per `X = Y → False`).
uk: Почніть із `intro h` (пам’ятаючи, що `X ≠ Y` це лише позначення для `X = Y → False`).
zh: 从 `intro h` 开始（记住 `X ≠ Y` 只是 `X = Y → False` 的符号表示）。

source: We're going to change that `False` into `True`. Start by changing it into `is_zero (succ a)` by executing `rw [← is_zero_succ a]`.
fr: Nous allons changer ce `False` en `True`. Commencez par le changer en `is_zero (succ a)` en exécutant `rw [← is_zero_succ a]`.
it: Vogliamo trasformare quel `False` in un `True`. Inizia a trasformarlo in `is_zero (succ a)` eseguendo `rw [← is_zero_succ a]`.
uk: Ми збираємося змінити це `False` на `True`. Почніть із зміни його на `is_zero (succ a)`, виконавши `rw [← is_zero_succ a]`.
zh: 我们将要把那个 `False` 变成 `True`。首先通过执行 `rw [← is_zero_succ a]` 把它变成 `is_zero (succ a)`。

source: See if you can take it from here. Look at the new lemmas and tactic available on the right.
fr: Voyez si vous pouvez continuer. Regardez les nouveaux lemmes et la tactique disponibles à droite.
it: Lascio il resto a te. Sfrutta i nuovi lemmi e tattiche disponibili nell'inventario a destra.
uk: Подивіться, чи можете ви продовжити звідси. Подивіться на нові леми та тактику доступні праворуч.
zh: 看看你是否可以从这里开始。查看右侧可用的新引理和策略。

source: An algorithm for equality
fr: Un algorithme pour l'égalité
it: Un algoritmo per l'uguaglianza
uk: Алгоритм рівності
zh: 用于证明等价的算法

source: Here we begin to develop an algorithm which, given two naturals `a` and `b`, returns the answer to "does `a = b`?" Here is the algorithm. First note that `a` and `b` are numbers, and hence are either `0` or successors. *) If `a` and `b` are both `0`, return "yes". *) If one is `0` and the other is `succ n`, return "no". *) If `a = succ m` and `b = succ n`, then return the answer to "does `m = n`?" Our job now is to *prove* that this algorithm always gives the correct answer. The proof that `0 = 0` is `rfl`. The proof that `0 ≠ succ n` is `zero_ne_succ n`, and the proof that `succ m ≠ 0` is `succ_ne_zero m`. The proof that if `h : m = n` then `succ m = succ n` is `rw [h]` and then `rfl`. This level is a proof of the one remaining job we have to do: if `a ≠ b` then `succ a ≠ succ b`.
fr: Ici, nous commençons à développer un algorithme qui, étant donnés deux naturels `a` et `b`, renvoie la réponse à "`a = b` ?" Voici l'algorithme. D'abord, notez que `a` et `b` sont des nombres, et donc sont soit `0` soit des successeurs. *) Si `a` et `b` sont tous deux `0`, renvoyer "oui". *) Si l'un est `0` et l'autre est `succ n`, renvoyer "non". *) Si `a = succ m` et `b = succ n`, alors renvoyer la réponse à "`m = n` ?" Notre travail maintenant est de *prouver* que cet algorithme donne toujours la bonne réponse. La preuve de `0 = 0` est `rfl`. La preuve que `0 ≠ succ n` est `zero_ne_succ n`, et la preuve que `succ m ≠ 0` est `succ_ne_zero m`. La preuve que si `h : m = n` alors `succ m = succ n` est `rw [h]` puis `rfl`. Ce niveau est une preuve de la seule tâche restante que nous devons faire : si `a ≠ b` alors `succ a ≠ succ b`.
it: Cominciamo lo sviluppo di un algoritmo che, dati due naturali `a` e`b`, restituisce la risposta alla domanda "does `a = b`?" Presentiamo l'algoritmo. Nota prima che `a` e `b` sono entrambi numeri, e dunque sono `0` oppure dei successori. *) Se `a` e `b` sono entrambi `0`, restituiamo "sì". *) Se uno dei due è `0` e l'altro è `succ n`, restituiamo "no". *) Se `a = succ m` e `b = succ n`, restituiamo la risposta a "`m = n`?" Non ci rimane che *dimostrare* che questo algoritmo ci dà sempre la risposta corretta. Procediamo per casi. La dimostrazione di `0 = 0` è `rfl`. La dimostrazione di `0 ≠ succ n` è `zero_ne_succ n`, e la dimostrazione di `succ m ≠ 0` è `succ_ne_zero m`. La dimostrazione di "se `h : m = n` allora `succ m = succ n`" è `rw [h]` e infine `rfl`. Questo livello ci salva una parte di lavoro per dimostrare: se `a ≠ b` allora `succ a ≠ succ b`.
uk: Ось ми і починаємо розробити алгоритм, який, маючи два натуральних числа `a` і `b`, повертає відповідь на "чи `a = b`?" Ось алгоритм. Спочатку зауважте, що `a` і `b` є числами, а отже вони або `0`, або наступники. *) Якщо `a` і `b` обидва є `0`, поверніть "yes". *) Якщо один це `0`, а інший це `succ n`, поверніть "ні". *) Якщо `a = succ m` і `b = succ n`, тоді повертається відповідь на питання "чи `m = n`?" Зараз наше завдання - *довести*, що цей алгоритм завжди дає правильну відповідь. Доказ що `0 = 0` це `rfl`. Доказом того, що `0 ≠ succ n` є `zero_ne_succ n`, і доказом що `succ m ≠ 0` є `succ_ne_zero m`. Доказ того, що якщо `h : m = n`, то `succ m = succ n` — це `rw [h]`, а потім `rfl`. Цей рівень є доказом єдиної залишившийся роботи, яку ми маємо виконати: якщо `a ≠ b`, тоді `succ a ≠ succ b`.
zh: 我们开始开发一个算法，给定两个自然数 `a` 和 `b`，返回对“`a = b`？”的回答。 这是算法。首先注意到 `a` 和 `b` 是数字，因此要么是 `0` 要么是后继者。 * 如果 `a` 和 `b` 都是 `0`，返回“是”。 * 如果一个是 `0` 而另一个是 `succ n`，返回“否”。 * 如果 `a = succ m` 且 `b = succ n`，那么返回对“`m = n`？”的答案。 现在我们的任务是*证明*这个算法总能给出正确的答案。证明 `0 = 0` 是 `rfl`。证明 `0 ≠ succ n` 的是 `zero_ne_succ n`，证明 `succ m ≠ 0` 的是 `succ_ne_zero m`。如果有假设 `h : m = n`，那么证明 `succ m = succ n` 可以使用 `rw [h]` 然后 `rfl`。这一关是证明我们要做的剩余工作之一：如果 `a ≠ b`，那么 `succ a ≠ succ b`。

source: # Summary If you have a hypothesis `h : a ≠ b` and goal `c ≠ d` then `contrapose! h` replaces the set-up with its so-called \"contrapositive\": a hypothesis `h : c = d` and goal `a = b`.
fr: # Résumé Si vous avez une hypothèse `h : a ≠ b` et un but `c ≠ d` alors `contrapose! h` remplace la proposition par sa dénommée "contraposée" : c'est-à-dire une hypothèse `h : c = d` et un but `a = b`.
it: # Descrizione Se hai un'ipotesi `h : a ≠ b` e il goal `c ≠ d` allora `contrapose! h` cambierà l'impostazione con la cosiddetta \"contronominale\": un ipotesi `h : c = d` e il goal `a = b`.
uk: # Резюме Якщо у вас є гіпотеза `h : a ≠ b` і мета `c ≠ d` тоді `contrapose! h` замінює налаштування на так звану \"контрапозитивну\": гіпотезу `h : c = d` і мету `a = b`.
zh: ## 概述 如果你有一个假设 `h : a ≠ b` 和目标 `c ≠ d` 那么 `contrapose! h` 将这个命题替换为所谓的“逆否命题”： 一个假设 `h : c = d` 和目标 `a = b`。

source: `succ_ne_succ m n` is the proof that `m ≠ n → succ m ≠ succ n`.
fr: `succ_ne_succ m n` est la preuve que `m ≠ n → succ m ≠ succ n`.
it: `succ_ne_succ m n` è la dimostrazione di `m ≠ n → succ m ≠ succ n`.
uk: `succ_ne_succ m n` є доказом того, що `m ≠ n → succ m ≠ succ n`.
zh: `succ_ne_succ m n` 是 `m ≠ n → succ m ≠ succ n` 的证明。

source: If $a \neq b$ then $\operatorname{succ}(a) \neq\operatorname{succ}(b)$.
fr: Si $a \neq b$ alors $\operatorname{succ}(a) \neq\operatorname{succ}(b)$.
it: Se $a \neq b$ allora $\operatorname{succ}(a) \neq\operatorname{succ}(b)$.
uk: Якщо $a \neq b$, тоді $\operatorname{succ}(a) \neq\operatorname{succ}(b)$.
zh: 如果 $a \neq b$，那么 $\operatorname{succ}(a) \neq\operatorname{succ}(b)$。

source: Start with `contrapose! h`, to change the goal into its contrapositive, namely a hypothesis of `succ m = succ n` and a goal of `m = n`.
fr: Commencez par `contrapose! h`, pour changer le but en sa contraposée, c'est-à-dire une hypothèse `succ m = succ n` et un but `m = n`.
uk: Почніть із `contrapose! h`, щоб змінити мету на її контрапозицію, а саме гіпотезу `succ m = succ n` і мету `m = n`.

source: Can you take it from here? (note: if you try `contrapose! h` again, it will take you back to where you started!)
fr: Pouvez-vous continuer ? (note : si vous essayez `contrapose! h` à nouveau, cela vous ramènera à votre point de départ !)
it: Sai proseguire da solo? (nota: se rifai `contrapose! h` ritornerai allo stato originale della dimostrazione!)
uk: Чи ви можете продовжити звідси? (примітка: якщо ви знову спробуєте `contrapose! h`, це поверне вас туди, звідки ви починали!)
zh: 你能处理接下来的证明吗？（注意：如果你再次尝试 `contrapose! h`，它会把你带回到开始的地方！）

source: # Summary `decide` will attempt to solve a goal if it can find an algorithm which it can run to solve it. ## Example A term of type `DecidableEq ℕ` is an algorithm to decide whether two naturals are equal or different. Hence, once this term is made and made into an `instance`, the `decide` tactic can use it to solve goals of the form `a = b` or `a ≠ b`.
fr: # Résumé `decide` essaiera de résoudre un but s'il peut trouver un algorithme qu'il peut exécuter pour le résoudre. ## Exemple Un terme de type `DecidableEq ℕ` est un algorithme pour décider si deux entiers naturels sont égaux ou différents. Ainsi, une fois ce terme créé et transformé en `instance`, la tactique `decide` peut l'utiliser pour résoudre des buts de la forme `a = b` ou `a ≠ b`.
it: # Descrizione La tattica `decide` cercherà di risolvere il goal se esiste un algoritmo che possiamo eseguire per risolverlo. ## Esempio Un termine di tipo `DecidableEq ℕ` è un algoritmo che decide se due naturali sono uguali o diversi. Dunque, se abbiamo un'istanza di questo tipo, la tattica `decide` può usare la sua implementazione per risolvere i goal della forma `a = b` or `a ≠ b`.
uk: # Резюме `decide` спробує розв’язати мету, якщо зможе знайти алгоритм який вона може виконати, щоб вирішити її. ## Приклад Термін типу `DecidableEq ℕ` є алгоритмом для визначення того, чи два натуральні числа рівні або різні. Отже, щойно цей термін створено та перетворено на `instance`, тактика `decide` може використовувати його для вирішення цілей у формі `a = b` або `a ≠ b`.
zh: ## 概述 如果 `decide` 可以找到一种算法来解决目标，它将尝试解决该目标。 ### 示例 类型为 `DecidableEq ℕ` 的项是用于判断两个自然数是否相等或不同的算法（的实现函数）。 因此，一旦这个项被创建并成为一个 `instance`，`decide` 策略就可以使用它来解决形式为 `a = b` 或 `a ≠ b` 的目标。

source: Implementing the algorithm for equality of naturals, and the proof that it is correct, looks like this: ``` instance instDecidableEq : DecidableEq ℕ | 0, 0 => isTrue <| by show 0 = 0 rfl | succ m, 0 => isFalse <| by show succ m ≠ 0 exact succ_ne_zero m | 0, succ n => isFalse <| by show 0 ≠ succ n exact zero_ne_succ n | succ m, succ n => match instDecidableEq m n with | isTrue (h : m = n) => isTrue <| by show succ m = succ n rw [h] rfl | isFalse (h : m ≠ n) => isFalse <| by show succ m ≠ succ n exact succ_ne_succ m n h ``` This Lean code is a formally verified algorithm for deciding equality between two naturals. I've typed it in already, behind the scenes. Because the algorithm is formally verified to be correct, we can use it in Lean proofs. You can run the algorithm with the `decide` tactic.
fr: L'implémentation de l'algorithme pour l'égalité des naturels, et la preuve qu'il est correct, ressemble à ceci : ``` instance instDecidableEq : DecidableEq ℕ | 0, 0 => isTrue <| by show 0 = 0 rfl | succ m, 0 => isFalse <| by show succ m ≠ 0 exact succ_ne_zero m | 0, succ n => isFalse <| by show 0 ≠ succ n exact zero_ne_succ n | succ m, succ n => match instDecidableEq m n with | isTrue (h : m = n) => isTrue <| by show succ m = succ n rw [h] rfl | isFalse (h : m ≠ n) => isFalse <| by show succ m ≠ succ n exact succ_ne_succ m n h ``` Ce code Lean est un algorithme formellement vérifié pour décider de l'égalité entre deux naturels. Je l'ai déjà tapé, en coulisses. Comme l'algorithme est formellement vérifié comme correct, nous pouvons l'utiliser dans les preuves Lean. Vous pouvez exécuter l'algorithme avec la tactique `decide`.
it: L'implementazione dell'algoritmo di uguaglianza tra naturali, e la sua dimostrazione di correttezza, somigliano a questo: ``` instance instDecidableEq : DecidableEq ℕ | 0, 0 => isTrue <| by show 0 = 0 rfl | succ m, 0 => isFalse <| by show succ m ≠ 0 exact succ_ne_zero m | 0, succ n => isFalse <| by show 0 ≠ succ n exact zero_ne_succ n | succ m, succ n => match instDecidableEq m n with | isTrue (h : m = n) => isTrue <| by show succ m = succ n rw [h] rfl | isFalse (h : m ≠ n) => isFalse <| by show succ m ≠ succ n exact succ_ne_succ m n h ``` Questo codice Lean è un algoritmo formalmente verificato che risolve il problema decisionale dell'uguaglianza di due numeri naturali. L'ho già inserito dietro le quinte nel gioco. Dato che abbiamo prova formale della correttezza dell'algoritmo, possiamo impiegarlo nelle dimostrazioni di Lean. Puoi eseguire l'algoritmo all'interno di una dimostrazione con la tattica `decide`.
uk: Реалізація алгоритму рівності натуральних і доказ його правильності, виглядає так: ``` instance instDecidableEq : DecidableEq ℕ | 0, 0 => isTrue <| by show 0 = 0 rfl | succ m, 0 => isFalse <| by show succ m ≠ 0 exact succ_ne_zero m | 0, succ n => isFalse <| by show 0 ≠ succ n exact zero_ne_succ n | succ m, succ n => match instDecidableEq m n with | isTrue (h : m = n) => isTrue <| by show succ m = succ n rw [h] rfl | isFalse (h : m ≠ n) => isFalse <| by show succ m ≠ succ n exact succ_ne_succ m n h ``` Цей код Lean є формально веріфікованим алгоритмом для визначення рівності між двома натуральними. Я вже ввів це, за кадром. Оскільки формально перевірено правильність алгоритму, ми можемо використовуйте його в доказах Lean. Ви можете запустити алгоритм за допомогою тактики `decide`.
zh: 实现自然数等式的算法，以及证明它是正确的，看起来像这样： ``` instance instDecidableEq : DecidableEq ℕ | 0, 0 => isTrue <| by show 0 = 0 rfl | succ m, 0 => isFalse <| by show succ m ≠ 0 exact succ_ne_zero m | 0, succ n => isFalse <| by show 0 ≠ succ n exact zero_ne_succ n | succ m, succ n => match instDecidableEq m n with | isTrue (h : m = n) => isTrue <| by show succ m = succ n rw [h] rfl | isFalse (h : m ≠ n) => isFalse <| by show succ m ≠ succ n exact succ_ne_succ m n h ``` 这段 Lean 代码是一个用于判断两个自然数之间等式的正式验证算法。 我已经在游戏幕后输入了它。因为这个算法已经正式验证为正确，我们可以在 Lean 证明中使用它。 你可以用 `decide` 策略运行这个算法。

source: You can read more about the `decide` tactic by clicking on it in the top right.
fr: Vous pouvez en savoir plus sur la tactique `decide` en cliquant dessus en haut à droite.
it: Puoi leggere di più sulla tattica `decide` cliccando sul suo nome in alto a destra.
uk: Ви можете прочитати більше про тактику `decide`, натиснувши на неї вгорі праворуч.
zh: 你可以通过点击右上角的 `decide` 来了解更多关于 `decide` 策略的信息。

source: decide again
fr: decide à nouveau
it: decide, ancora
uk: decide ще раз
zh: 还是`decide`

source: We gave a pretty unsatisfactory proof of `2 + 2 ≠ 5` earlier on; now give a nicer one.
fr: Nous avons donné une preuve assez peu satisfaisante de `2 + 2 ≠ 5` plus tôt ; maintenant donnez-en une meilleure.
it: La dimostrazione che abbiamo dato prima per `2 + 2 ≠ 5` non è stata molto elegante; danne una più carina.
uk: Раніше ми надали досить незадовільний доказ `2 + 2 ≠ 5`; тепер давайте зробимо кращій.
zh: 我们前面给出的 `2 + 2 ≠ 5` 证明并不令人满意，现在给出一个更好的证明。

source: Congratulations! You've finished Algorithm World. These algorithms will be helpful for you in Even-Odd World (when someone gets around to implementing it).
fr: Félicitations ! Vous avez terminé le monde Algorithmique. Ces algorithmes vous seront utiles dans le monde Pair-Impair (quand quelqu'un trouvera le temps de l'implémenter).
uk: Щиро вітаю! Ви закінчили Світ Алгорітмів. Ці алгоритми буде корисним для вас у Парно-непарному світі (коли хтось знайде час на його реалізацію).

source: Algorithm World
fr: Monde Algorithmique
it: Mondo Algoritmi
uk: Світ алгоритмів
zh: 算法世界

source: Proofs like $2+2=4$ and $a+b+c+d+e=e+d+c+b+a$ are very tedious to do by hand. In Algorithm World we learn how to get the computer to do them for us. Click on "Start" to proceed.
fr: Les preuves comme $2+2=4$ et $a+b+c+d+e=e+d+c+b+a$ sont très fastidieuses à faire à la main. Dans le monde Algorithmique, nous apprenons à faire cela à l'aide de l'ordinateur. Cliquez sur "Commencer" pour continuer.
it: Dimostrazioni come quelle di $2+2=4$ e $a+b+c+d+e=e+d+c+b+a$ sono una tortura da fare a mano. Nel Mondo Algoritmi vedremo come farle risolvere al computer al posto nostro. Premi su "Via" per cominciare.
uk: Такі докази, як $2+2=4$ і $a+b+c+d+e=e+d+c+b+a$, дуже нудно робити вручну. У Світі Алгорітмів ми дізнаємося, як змусити комп’ютер робити це за нас. Натисніть «Почати», щоб продовжити.
zh: 像 $2+2=4$ 和 $a+b+c+d+e=e+d+c+b+a$ 这样的证明如果手工完成会非常繁琐。在算法世界中，我们将学习如何让计算机帮我们完成它们。 点击“开始”继续。

source: `add_right_cancel a b n` is the theorem that $a+n=b+n \implies a=b.$
fr: `add_right_cancel a b n` est le théorème que $a+n=b+n \implies a=b.$
it: `add_right_cancel a b n` è il teorema $a+n=b+n \implies a=b.$
uk: `add_right_cancel a b n` це теорема про те, що $a+n=b+n \implies a=b.$
zh: `add_right_cancel a b n` 是 $a+n=b+n \implies a=b$ 的定理。

source: In this world I will mostly leave you on your own. `add_right_cancel a b n` is the theorem that $a+n=b+n\implies a=b$.
fr: Dans ce monde, je vais principalement vous laisser seul. `add_right_cancel a b n` est le théorème que $a+n=b+n\implies a=b$.
it: In questo mondo non parlerò troppo. `add_right_cancel a b n` è il teorema che afferma $a+n=b+n\implies a=b$.
uk: У цьому світі я здебільшого залишу вас самих. `add_right_cancel a b n` це теорема про те, що $a+n=b+n\implies a=b$.
zh: 在这个世界中，探险将主要由您独自完成。 `add_right_cancel a b n` 是定理 $a+n=b+n\implies a=b$。

source: Start with induction on `n`.
fr: Commencez par une induction sur `n`.
it: Inizia facendo induzione su `n`.
uk: Почніть з індукції по `n`.
zh: 从对 `n` 的归纳开始。

source: `add_left_cancel a b n` is the theorem that $n+a=n+b \implies a=b.$
fr: `add_left_cancel a b n` est le théorème que $n+a=n+b \implies a=b.$
it: `add_left_cancel a b n` è il teorema $n+a=n+b \implies a=b.$
uk: `add_left_cancel a b n` це теорема про те, що $n+a=n+b \implies a=b.$
zh: `add_left_cancel a b n` 是 $n+a=n+b \implies a=b$ 的定理名字。

source: `add_left_cancel a b n` is the theorem that $n+a=n+b\implies a=b$. You can prove it by induction on `n` or you can deduce it from `add_right_cancel`.
fr: `add_left_cancel a b n` est le théorème que $n+a=n+b\implies a=b$. Vous pouvez le prouver par induction sur `n` ou le déduire de `add_right_cancel`.
it: `add_left_cancel a b n` è il teorema che dice $n+a=n+b\implies a=b$. Puoi dimostrarlo facendo induzione su `n` oppure puoi dedurlo tramite `add_right_cancel`.
uk: `add_left_cancel a b n` це теорема про те, що $n+a=n+b\implies a=b$. Ви можете довести її за допомогою індукції по `n` або ви можете вивести це з `add_right_cancel`.
zh: `add_left_cancel a b n` 是定理 $n+a=n+b\implies a=b$。你可以通过对 `n` 进行归纳来证明它，或者你可以从 `add_right_cancel` 推导出它。

source: How about this for a proof: ``` repeat rw [add_comm n] exact add_right_cancel a b n ```
fr: Que pensez-vous de cette preuve : ``` repeat rw [add_comm n] exact add_right_cancel a b n ```
it: Cosa ne pensi di questa dimostrazione: ``` repeat rw [add_comm n] exact add_right_cancel a b n ```
uk: Як щодо цього як доказ: ``` repeat rw [add_comm n] exact add_right_cancel a b n ```
zh: 下面这个证明怎么样： ``` repeat rw [add_comm n] exact add_right_cancel a b n ```

source: `add_left_eq_self x y` is the theorem that $x + y = y \implies x=0.$
fr: `add_left_eq_self x y` est le théorème que $x + y = y \implies x=0.$
it: `add_left_eq_self x y` è il teorema $x + y = y \implies x=0.$
uk: `add_left_eq_self x y` це теорема про те, що $x + y = y \implies x=0.$
zh: `add_left_eq_self x y` 是 $x + y = y\implies x=0$ 的定理名字。

source: `add_left_eq_self x y` is the theorem that $x + y = y\implies x=0.$
fr: `add_left_eq_self x y` est le théorème que $x + y = y\implies x=0.$
it: `add_left_eq_self x y` è il teorema $x + y = y\implies x=0.$
uk: `add_left_eq_self x y` це теорема про те, що $x + y = y\implies x=0.$
zh: `add_left_eq_self x y` 是 $x + y = y\implies x=0$ 的定理名字。
