Repository: leanprover-community/NNG4
Catalog: .i18n/*/Game.po
Languages: fr, it, uk, zh

source: Remember that when Lean writes `a + b + c`, it means `(a + b) + c`. If you are not sure where the brackets are in an expression, just hover your cursor over it and look at what gets highlighted. For example, hover over both `+` symbols on the left hand side of the goal and you'll see where the invisible brackets are.
fr: Rappelez-vous que lorsque Lean écrit `a + b + c`, cela signifie `(a + b) + c`. Si vous n'êtes pas sûr des parenthèses dans une expression, passez simplement votre curseur dessus et regardez ce qui est mis en évidence. Par exemple, passez sur les deux symboles `+` du côté gauche du but et vous verrez où sont les parenthèses invisibles.
it: Ricorda che, per pura brevità, Lean mostra `a + b + c` al posto di `(a + b) + c`. Se non sei sicuro di dove si trovino le parentesi in un'espressione, puoi spostare il mouse al di sopra e guardare cosa viene evidenziato. Ad esempio, se sposti il puntatore sopra entrambi i simboli `+` nel membro sinistro del goal avrai un'idea di dove Lean ha messo le parentesi invisibili.
uk: Пам’ятайте, що коли в Lean пишете `a + b + c`, це означає `(a + b) + c`. Якщо ви не впевнені, де знаходяться дужки у виразі, просто наведіть на нього курсор і подивіться, що буде виділено. Наприклад, наведіть курсор миші на обидва символи `+` ліворуч від мети і ви побачите, де знаходяться невидимі дужки.
zh: 记住，当 Lean 写作 `a + b + c` 时，它的意思是 `(a + b) + c`。 如果你不确定表达式中的括号在哪里，只需将光标悬停在它上面， 看看什么被高亮显示。例如，将光标悬停在目标左侧的两个 `+` 符号上， 你就会看到看不见的括号在哪里。

source: A passing mathematician congratulates you on proving that naturals are an additive commutative monoid. Let's practice using `add_assoc` and `add_comm` in one more level, before we leave addition world.
fr: Un mathématicien de passage vous félicite d'avoir prouvé que les entiers naturels forment un monoïde commutatif additif. Si vous voulez vous entraîner à utiliser `add_assoc` et `add_comm` dans un niveau supplémentaire, avant de quitter le monde de l'addition.
it: Un matematico di passaggio si congratula con te per aver dimostrato che i naturali sono un monoide additivo commutativo. Esercitiamoci a usare `add_assoc` e `add_comm` in un ultimo livello, prima di lasciare il Mondo Addizione.
uk: Математик, який проходив повз, вітає вас із доведенням що натуральні числа є адитивним комутативним моноїдом. Давайте потренуємося використовувати `add_assoc` і `add_comm` на ще одному рівні, перш ніж залишити світ додавання.
zh: 一个路过的数学家祝贺你证明了自然数是一个加法交换幺半群。 在我们离开加法世界之前，让我们在另一关里练习使用 `add_assoc` 和 `add_comm`。

source: `add_comm b c` is a proof that `b + c = c + b`. But if your goal is `a + b + c = a + c + b` then `rw [add_comm b c]` will not work! Because the goal means `(a + b) + c = (a + c) + b` so there is no `b + c` term *directly* in the goal. Use associativity and commutativity to prove `add_right_comm`. You don't need induction. `add_assoc` moves brackets around, and `add_comm` moves variables around. Remember that you can do more targetted rewrites by adding explicit variables as inputs to theorems. For example `rw [add_comm b]` will only do rewrites of the form `b + ? = ? + b`, and `rw [add_comm b c]` will only do rewrites of the form `b + c = c + b`.
fr: `add_comm b c` est une preuve que `b + c = c + b`. Mais si votre but est `a + b + c = a + c + b` alors `rw [add_comm b c]` ne fonctionnera pas ! Parce que le but signifie `(a + b) + c = (a + c) + b` donc il n'y a pas de terme `b + c` *directement* dans le but. Utilisez l'associativité et la commutativité pour prouver `add_right_comm`. Vous n'avez pas besoin d'induction. `add_assoc` déplace les parenthèses, et `add_comm` échange les variables. Rappelez-vous que vous pouvez faire des réécritures plus ciblées en ajoutant des variables explicites comme entrées aux théorèmes. Par exemple `rw [add_comm b]` ne fera que des réécritures de la forme `b + ? = ? + b`, et `rw [add_comm b c]` ne fera que des réécritures de la forme `b + c = c + b`.
it: `add_comm b c` è una dimostrazione di `b + c = c + b`. Ma se il goal è `a + b + c = a + c + b`, `rw [add_comm b c]` non funzionerà! Questo perché il goal sta in realtà per `(a + b) + c = (a + c) + b`, e se guardi bene questo goal non include il termine `b + c` *direttamente*. Usa l'associatività e la commutatività per dimostrare `add_right_comm`. Non è necessario procedere per induzione. `add_assoc` sposta le parentesi, e `add_comm` sposta le variabili. Ricorda che puoi fare sostituzioni mirate fornendo esplicitamente le variabili in input ai teoremi. Ad esempio `rw [add_comm b]` farà solo sostituzioni della forma `b + ? = ? + b`, e `rw [add_comm b c]` farà solo sostituzioni della forma `b + c = c + b`.
uk: `add_comm b c` є доказом того, що `b + c = c + b`. Але якщо ваша мета це `a + b + c = a + c + b`, тоді `rw [add_comm b c]` неспрацює! Тому що мета означає `(a + b) + c = (a + c) + b` так що в меті *безпосередньо* немає члена `b + c`. Використовуйте асоціативність і комутативність, щоб підтвердити `add_right_comm`. Вам не потрібна індукція. `add_assoc` пересуває дужки, а `add_comm` переміщує змінні. Пам’ятайте, що ви можете робити більш цілеспрямовані перезаписи за допомогою додавання явних змінних як вхідних даних до теорем. Наприклад `rw [add_comm b]` виконуватиме лише перезапис у формі `b + ? = ? + b` і `rw [add_comm b c]` виконуватиме лише перезапис у формі `b + c = c + b`.
zh: `add_comm b c` 是一个 `b + c = c + b` 的证明。但如果您的目标是 `a + b + c = a + c + b`，那么 `rw [add_comm b c]` 将不起作用！因为目标是 `(a + b) + c = (a + c) + b`，所以目标中*直接*没有 `b + c` 项。 使用结合律和交换律来证明 `add_right_comm`。您不需要使用归纳法。`add_assoc` 移动括号，`add_comm` 移动变量。 请记住，您可以通过将显式变量添加为定理的输入来进行更有针对性的重写。 例如，`rw [add_comm b]` 只会重写形如 `b + ? = ? + b` 的形式，而 `rw [add_comm b c]` 只会重写形如 `b + c = c + b` 的形式。

source: `add_right_comm a b c` is a proof that `(a + b) + c = (a + c) + b` In Lean, `a + b + c` means `(a + b) + c`, so this result gets displayed as `a + b + c = a + c + b`.
fr: `add_right_comm a b c` est une preuve que `(a + b) + c = (a + c) + b` Dans Lean, `a + b + c` signifie `(a + b) + c`, donc ce résultat s'affiche comme `a + b + c = a + c + b`.
it: `add_right_comm a b c` è la dimostrazione di `(a + b) + c = (a + c) + b` Su Lean, `a + b + c` è zucchero sintattico per `(a + b) + c`, quindi il nostro risultato verrà visualizzato come `a + b + c = a + c + b`.
uk: `add_right_comm a b c` є доказом того, що `(a + b) + c = (a + c) + b` У Lean `a + b + c` означає `(a + b) + c`, тому цей результат відображається як `a + b + c = a + c + b`.
zh: `add_right_comm a b c` 是 `(a + b) + c = (a + c) + b` 的证明。 在 Lean 中，`a + b + c` 意味着 `(a + b) + c`，所以这个结果被显示为 `a + b + c = a + c + b`。

source: If $a, b$ and $c$ are arbitrary natural numbers, we have $(a + b) + c = (a + c) + b$.
fr: Si $a, b$ et $c$ sont des nombres naturels arbitraires, nous avons $(a + b) + c = (a + c) + b$.
it: Se $a, b$ e $c$ sono numeri naturali qualsiasi, si ha che $(a + b) + c = (a + c) + b$.
uk: Якщо $a, b$ і $c$ довільні натуральні числа, тоді маємо $(a + b) + c = (a + c) + b$.
zh: 如果 $a, b$ 和 $c$ 是任意自然数，我们有 $(a + b) + c = (a + c) + b$。

source: You've now seen all the tactics you need to beat the final boss of the game. You can begin the journey towards this boss by entering Multiplication World. Or you can go off the beaten track and learn some new tactics in Implication World. These tactics let you prove more facts about addition, such as how to deduce `a = 0` from `x + a = x`. Click "Leave World" and make your choice.
fr: Vous avez maintenant vu toutes les tactiques nécessaires pour vaincre le boss final du jeu. Vous pouvez commencer le voyage vers ce boss en entrant dans le monde de la Multiplication. Ou vous pouvez sortir des sentiers battus et apprendre de nouvelles tactiques dans le monde de l'Implication. Ces tactiques vous permettent de prouver plus de résultats sur l'addition, comme comment déduire `a = 0` de `x + a = x`. Cliquez sur "Quitter le monde" et faites votre choix.
it: Ora hai incontrato tutte le tattiche che ti servono per sconfiggere il boss finale del gioco. Puoi proseguire spedito la tua marcia verso il boss finale passando dal Mondo Moltiplicazione. Oppure puoi fare una deviazione e imparare qualche nuova tattica esotica nel Mondo Implicazione. Queste tattiche ti permetteranno di dimostrare altre proprietà dell'addizione, ad esempio come dedurre `a = 0` da `x + a = x`. Premi "Abbandona mondo" e scegli la tua strada.
uk: Тепер ви побачили всі тактики, необхідні для перемоги над фінальним босом у грі. Ви можете розпочати подорож до цього боса, увійшовши у Світ множення. Або ви можете зійти з проторених шляхів і вивчити нову тактику в Світі імплікацій. Ці тактики дозволяють доводити більше фактів про додавання, наприклад як вивести `a = 0` з `x + a = x`. Натисніть «Покинути світ» і зробіть свій вибір.
zh: 你现在已经掌握了击败游戏最终 BOSS 所需的所有策略。 你可以进入乘法世界，开始征服 BOSS 的冒险之旅。 或者，你可以离开常规路线，在蕴涵世界中学习一些新的策略。 这些策略可以让你证明更多关于加法的事实，例如从 `x + a = x` 推导 `a = 0`。 点击“离开世界”，做出你的选择吧。

source: Addition World
fr: Monde de l'Addition
it: Mondo Addizione
uk: Світ додавання
zh: 加法世界

source: Welcome to Addition World! In this world we'll learn the `induction` tactic. This will enable us to defeat the boss level of this world, namely `x + y = y + x`. The tactics `rw`, `rfl` and `induction` are the only tactics you'll need to beat all the levels in Addition World, Multiplication World, and Power World. Power World contains the final boss of the game. There are plenty more tactics in this game, but you'll only need to know them if you want to explore the game further (for example if you decide to 100% the game).
fr: Bienvenue dans le monde de l'Addition ! Dans ce monde, nous apprendrons la tactique `induction`. Cela nous permettra de vaincre le niveau boss de ce monde, à savoir `x + y = y + x`. Les tactiques `rw`, `rfl` et `induction` sont les seules dont vous aurez besoin pour vaincre tous les niveaux du monde de l'Addition, du monde de la Multiplication et du monde des Puissances. Le monde des Puissances contient le boss final du jeu. Il y a beaucoup d'autres tactiques dans ce jeu, mais vous n'aurez besoin de les connaître que si vous voulez explorer le jeu plus avant (par exemple si vous décidez de finir le jeu à 100%).
it: Benvenuto nel Mondo Addizione! In questo mondo impareremo la tattica `induction`, che ci permetterà di sconfiggere il boss di questo mondo, il teorema `x + y = y + x`. Le tattiche `rw`, `rfl` e `induction` sono le uniche tattiche di cui avrai bisogno per per battere tutti i livelli del Mondo Addizione, del Mondo Moltiplicazione e del Mondo Potenza. Il Mondo Potenza contiene il boss finale del gioco. Ci sono tante altre tattiche in questo gioco, ma ne avrai bisogno solo se desideri immergerti ulteriormente nel gioco (o hai intenzione di completarlo al 100%).
uk: Ласкаво просимо до Світу додавання! У цьому світі ми навчимося тактиці `induction`. Це дозволить нам перемогти босовий рівень цього світу, а саме `x + y = y + x`. Тактики `rw`, `rfl` та `induction` — єдині тактики, які вам знадобляться, щоб подолати всі рівні у Світі додавання, Світі множення та Світі ступенів. Світ ступенів містить фінального боса гри. У цій грі є ще багато тактик, але вам потрібно знати лише їх, якщо ви хочете вивчити гру далі (наприклад, якщо ви вирішите на 100% гру).
zh: 欢迎来到加法世界！在这个世界中，我们将学习 `induction`（归纳）策略。这将使我们能够击败这个世界的Boss级别，即 `x + y = y + x`。 策略 `rw`（重写）、`rfl`（反射）和 `induction`（归纳）是你在加法世界、乘法世界和幂世界中击败所有关卡所需要策略。幂世界包含了游戏的最终Boss。 这个游戏中还有更多的策略，但只有当你想进一步探索游戏时（例如如果你决定完成游戏的100%）才需要了解它们。

source: See the new "*" tab in your lemmas, containing `mul_zero` and `mul_succ`. Right now these are the only facts we know about multiplication. Let's prove nine more. Let's start with a warm-up: no induction needed for this one, because we know `1` is a successor.
fr: Voyez le nouvel onglet "*" dans vos lemmes, contenant `mul_zero` et `mul_succ`. Actuellement, ce sont les seuls faits que nous connaissons sur la multiplication. Prouvons-en neuf de plus. Commençons par un échauffement : aucune induction n'est nécessaire pour celui-ci, car nous savons que `1` est un successeur.
it: Nell'inventario è comparso il nuovo tab "*", dove vedrai `mul_zero` e `mul_succ`. Per ora queste sono le uniche due proprietà della moltiplicazione che conosciamo. Insieme ne dimostreremo altre nove. Cominciamo con un esercizio di riscaldamento: non hai bisogno dell'induzione qua, perché sappiamo che `1` è un successore.
uk: Перегляньте нову вкладку «*» у своїх лемах, яка містить `mul_zero` і `mul_succ`. Зараз це єдині факти, які ми знаємо про множення. Доведемо ще дев'ять. Почнемо з розминки: індукція для неї не потрібна, оскільки ми знаємо, що `1` є наступним значенням.
zh: 查看引理区中的新“*”标签，包含 `mul_zero` 和 `mul_succ`。 目前这些是我们唯一知道的关于乘法的事实。 让我们再证明九个。 让我们从一个热身开始：这个不需要归纳， 因为我们知道 `1` 是一个后继数。

source: `Mul a b`, with notation `a * b`, is the usual product of natural numbers. Internally it is via two axioms: * `mul_zero a : a * 0 = 0` * `mul_succ a b : a * succ b = a * b + a` Other theorems about naturals, such as `zero_mul`, are proved by induction from these two basic theorems.
fr: `Mul a b`, avec la notation `a * b`, est le produit habituel des nombres naturels. En interne, il est défini par deux axiomes : * `mul_zero a : a * 0 = 0` * `mul_succ a b : a * succ b = a * b + a` D'autres théorèmes sur les naturels, comme `zero_mul`, sont prouvés par induction à partir de ces deux théorèmes de base.
it: `Mul a b`, con notazione `a * b`, è il solito prodotto tra numeri naturali. Dentro Lean è definito tramite due assiomi: * `mul_zero a : a * 0 = 0` * `mul_succ a b : a * succ b = a * b + a` Tutti gli altri teoremi sulla moltiplicazione e i naturali, come `zero_mul`, si dimostrano per induzione usando questi due assiomi fondamentali.
uk: `Mul a b` із нотацією `a * b` є звичайним добуток натуральних чисел. Всередині це зроблено через дві аксіоми: * `mul_zero a : a * 0 = 0` * `mul_succ a b : a * succ b = a * b + a` Інші теореми про натуральні числа, такі як `zero_mul`, доводяться індукцією з цих двох основних теорем.
zh: `Mul a b`，其符号表示为 `a * b`，是自然数的常规乘积。它是通过两条规则定义的： * `mul_zero a : a * 0 = 0` * `mul_succ a b : a * succ b = a * b + a` 关于自然数的其他定理，比如 `zero_mul`，都是通过从这两个基本定理进行归纳证明得到的。

source: `mul_zero m` is the proof that `m * 0 = 0`.
fr: `mul_zero m` est la preuve que `m * 0 = 0`.
it: `mul_zero m` è la dimostrazione di `m * 0 = 0`.
uk: `mul_zero m` є доказом того, що `m * 0 = 0`.
zh: `mul_zero m` 是 `m * 0 = 0` 的证明。

source: `mul_succ a b` is the proof that `a * succ b = a * b + a`.
fr: `mul_succ a b` est la preuve que `a * succ b = a * b + a`.
it: `mul_succ a b` è la dimostrazione di `a * succ b = a * b + a`.
uk: `mul_succ a b` є доказом того, що `a * succ b = a * b + a`.
zh: `mul_succ a b` 是 `a * succ b = a * b + a` 的证明。

source: `mul_one m` is the proof that `m * 1 = m`.
fr: `mul_one m` est la preuve que `m * 1 = m`.
it: `mul_one m` è la dimostrazione di `m * 1 = m`.
uk: `mul_one m` є доказом того, що `m * 1 = m`.
zh: `mul_one m` 是 `m * 1 = m` 的证明。

source: For any natural number $m$, we have $ m \times 1 = m$.
fr: Pour tout nombre naturel $m$, nous avons $ m \times 1 = m$.
it: Per ogni numero naturale $m$, si ha che $ m \times 1 = m$.
uk: Для будь-якого натурального числа $m$ ми маємо $ m \times 1 = m$.
zh: 对于任何自然数 $m$，我们有 $ m \times 1 = m$。

source: Our first challenge is `mul_comm x y : x * y = y * x`, and we want to prove it by induction. The zero case will need `mul_zero` (which we have) and `zero_mul` (which we don't), so let's start with this.
fr: Notre premier défi est `mul_comm x y : x * y = y * x`, et nous voulons le prouver par induction. Le cas zéro aura besoin de `mul_zero` (que nous avons) et de `zero_mul` (que nous n'avons pas), donc commençons par cela.
it: La prima sfida è dimostrare `mul_comm x y : x * y = y * x`, e vogliamo farlo per induzione. Per dimostrare il caso base utilizzeremo `mul_zero` (che abbiamo come assioma) e `zero_mul`, che non abbiamo ancora, dunque partiamo da quest'ultimo.
uk: Нашою першою місією є `mul_comm x y : x * y = y * x`, і ми хочемо довести це індукцією. Нульовий випадок буде потребувати `mul_zero` (який у нас є) і `zero_mul` (якого ми не маємо), тож давайте понемо з нього.
zh: 我们的第一个挑战是`mul_comm x y : x * y = y * x`， 我们想通过归纳法来证明这一点。在证明0的目标下我们需要 `mul_zero` （我们有）和 `zero_mul` （我们没有），所以让我们从这里开始。

source: `zero_mul x` is the proof that `0 * x = 0`. Note: `zero_mul` is a `simp` lemma.
fr: `zero_mul x` est la preuve que `0 * x = 0`. Note : `zero_mul` est un lemme `simp`.
it: `zero_mul x` è la dimostrazione di `0 * x = 0`. NB: `zero_mul` è un lemma di semplificazione (`simp`).
uk: `zero_mul x` є доказом того, що `0 * x = 0`. Примітка: `zero_mul` - це `simp` лема.
zh: `zero_mul x` 是 `0 * x = 0` 的证明。 注意：`zero_mul` 是一个 `simp` 引理。

source: For all natural numbers $m$, we have $ 0 \times m = 0$.
fr: Pour tous les nombres naturels $m$, nous avons $ 0 \times m = 0$.
it: Per tutti i numeri naturali $m$, si ha $ 0 \times m = 0$.
uk: Для всіх натуральних чисел $m$ ми маємо $ 0 \times m = 0$.
zh: 对于所有自然数 $m$，我们有 $ 0 \times m = 0$。

source: Similarly we have `mul_succ` but we're going to need `succ_mul` (guess what it says -- maybe you are getting the hang of Lean's naming conventions). The last level from addition world might help you in this level. If you can't remember what it is, you can go back to the home screen by clicking the house icon and then taking a look. You won't lose any progress.
fr: De même, nous avons `mul_succ` mais nous allons avoir besoin de `succ_mul` (devinez ce que cela dit -- peut-être commencez-vous à comprendre les conventions de nommage de Lean). Le dernier niveau du monde de l'addition pourrait vous aider dans ce niveau. Si vous ne vous souvenez pas ce que c'est, vous pouvez revenir à l'écran d'accueil en cliquant sur l'icône maison et jeter un coup d'œil. Vous ne perdrez aucun progrès.
it: In modo simile, abbiamo `mul_succ` come assioma e vogliamo dimostrare `succ_mul` (puoi immaginarti cosa dice se hai già familiarizzato con le convenzioni di nomenclatura di Lean). L'ultimo livello del Mondo Addizione potrebbe aiutarti qui. Per ridargli un'occhiata, puoi tornare al menu principale cliccando sull'icona della casetta. Non perderai il progresso fatto in questo livello.
uk: Так само ми маємо `mul_succ` але нам знадобиться `succ_mul` (вгадайте, що вона стверджує - можливо, ви вже опановуєте правила іменування Lean). Останній рівень зі світу додавання може допомогти вам на цьому рівні. Якщо ви не можете згадати, що там було, ви можете повернутися до головного екрану, клацнувши піктограму будинку, а потім вибрати рівень. Ви не втратите свій прогрес тут.
zh: 同样，我们有 `mul_succ`， 但我们需要 `succ_mul`（猜猜它是什么意思 —— 也许你已经掌握了 Lean 的命名范式）。 加法世界中的最后一关会在这个关卡中帮助你。 如果你忘记了它是什么，你可以通过点击房屋图标回到主界面，然后看一看。 你不会因此失去任何进度。

source: `succ_mul a b` is the proof that `succ a * b = a * b + b`. It could be deduced from `mul_succ` and `mul_comm`, however this argument would be circular because the proof of `mul_comm` uses `mul_succ`.
fr: `succ_mul a b` est la preuve que `succ a * b = a * b + b`. Cela pourrait être déduit de `mul_succ` et `mul_comm`, cependant cet argument serait circulaire car la preuve de `mul_comm` utilise `mul_succ`.
it: `succ_mul a b` è la dimostrazione di `succ a * b = a * b + b`. Questo lemma potrebbe essere dedotto da `mul_succ` e `mul_comm`, ma risulterebbe in un ragionamento circolare in quanto la dimostrazione di `mul_comm` dipende da `mul_succ`.
uk: `succ_mul a b` є доказом того, що `succ a * b = a * b + b`. Його можна вивести із `mul_succ` та `mul_comm`, однак цей аргумент буде циклічним, тому що доказ `mul_comm` використовує `mul_succ`.
zh: `succ_mul a b` 是 `succ a * b = a * b + b` 的证明。 可以从 `mul_succ` 和 `mul_comm` 推导出来，但是这个是循环论证， 因为 `mul_comm` 的证明使用了 `mul_succ`。

source: For all natural numbers $a$ and $b$, we have $(\operatorname{succ}\ a) \times b = a\times b + b$.
fr: Pour tous les nombres naturels $a$ et $b$, nous avons $(\operatorname{succ}\ a) \times b = a\times b + b$.
it: Per tutti i numeri naturali $a$ e $b$, si ha che $(\operatorname{succ}\ a) \times b = a\times b + b$.
uk: Для всіх натуральних чисел $a$ і $b$ маємо $(\operatorname{succ}\ a) \times b = a\times b + b$.
zh: 对于所有自然数 $a$ 和 $b$，我们有 $(\operatorname{succ}\ a) \times b = a\times b + b$。

source: The first sub-boss of Multiplication World is `mul_comm x y : x * y = y * x`. When you've proved this theorem we will have "spare" proofs such as `zero_mul`, which is now easily deducible from `mul_zero`. But we'll keep hold of these proofs anyway, because it's convenient to have exactly the right tool for a job.
fr: Le premier sous-boss du monde de la Multiplication est `mul_comm x y : x * y = y * x`. Lorsque vous aurez prouvé ce théorème, nous aurons des preuves "supplémentaires" comme `zero_mul`, qui est maintenant facilement déductible de `mul_zero`. Mais nous garderons ces preuves quand même, car c'est pratique d'avoir exactement le bon outil pour certaines tâches.
it: Il primo mini-boss del Mondo Moltiplicazione è `mul_comm x y : x * y = y * x`. Una volta dimostrata la commutatività della moltiplicazione certe dimostrazioni che abbiamo fatto diventano "superflue", come `zero_mul`, il quale ora può essere dedotto facilmente da `mul_zero`. Ma ce le teniamo care comunque, perché sono strumenti specializzati che possono rivelarsi sempre utili.
uk: Перший підбос у Світі множення — `mul_comm x y : x * y = y * x`. Коли ви доведете цю теорему, ми матимемо «запасні» докази наприклад `zero_mul`, який тепер легко вивести з `mul_zero`. Але ми все одно збережемо ці докази, тому що це зручно мати правильний інструмент для роботи.
zh: 乘法世界的第一个小 Boss 是 `mul_comm x y : x * y = y * x`。 当你证明了这个定理后，我们将有一些“多余”的证明 例如 `zero_mul`，它现在可以轻松地从 `mul_zero` 中推导出来。 但无论如何我们都会保留这些证明，因为 拥有适合工作的工具会很方便。

source: `mul_comm` is the proof that multiplication is commutative. More precisely, `mul_comm a b` is the proof that `a * b = b * a`.
fr: `mul_comm` est la preuve que la multiplication est commutative. Plus précisément, `mul_comm a b` est la preuve que `a * b = b * a`.
it: `mul_comm` è la dimostrazione che la moltiplicazione è commutativa. Più precisamente, `mul_comm a b` è la dimostrazione che `a * b = b * a`.
uk: `mul_comm` є доказом того, що множення комутативне. Точніше, `mul_comm a b` є доказом того, що `a * b = b * a`.
zh: `mul_comm` 是乘法可交换的证明。更确切地说， `mul_comm a b` 是 `a * b = b * a` 的证明。

source: Multiplication is commutative.
fr: La multiplication est commutative.
it: La moltiplicazione è commutativa.
uk: Множення комутативне.
zh: 乘法是可交换的。

source: You can prove $1\times m=m$ in at least three ways. Either by induction, or by using `succ_mul`, or by using commutativity. Which do you think is quickest?
fr: Vous pouvez prouver $1\times m=m$ d'au moins trois façons. Soit par induction, soit en utilisant `succ_mul`, soit en utilisant la commutativité. Selon vous, laquelle est la plus rapide ?
it: Puoi dimostrare $1\times m=m$ in almeno tre modi. O per induzione, o tramite `succ_mul`, oppure usando la commutatività. Qual è il modo più veloce secondo te?
uk: Ви можете довести $1\times m=m$ принаймні трьома способами. Або шляхом індукції, або за допомогою `succ_mul`, або за допомогою комутативності. Як ви думаєте, який буде найшвидший?
zh: 您可以至少通过三种方式证明 $1\times m=m$。 通过归纳法，或使用 `succ_mul`，或 通过使用交换律。你认为哪个最快？

source: `one_mul m` is the proof `1 * m = m`.
fr: `one_mul m` est la preuve que `1 * m = m`.
it: `one_mul m` è la dimostrazione che `1 * m = m`.
uk: `one_mul m` є доказом `1 * m = m`.
zh: `one_mul m` 是证明 `1 * m = m`。

source: For any natural number $m$, we have $ 1 \times m = m$.
fr: Pour tout nombre naturel $m$, nous avons $ 1 \times m = m$.
it: Per ogni numero naturale $m$, si ha che $ 1 \times m = m$.
uk: Для будь-якого натурального числа $m$ ми маємо $1 \times m = m$.
zh: 对于任何自然数 $m$，我们有 $ 1 \times m = m$。
