Repository: leanprover-community/NNG4
Catalog: .i18n/*/Game.po
Languages: fr, it, uk, zh

source: Here's my solution: ``` rw [mul_comm, mul_one] rfl ```
fr: Voici ma solution : ``` rw [mul_comm, mul_one] rfl ```
it: Ecco come l'ho fatta io: ``` rw [mul_comm, mul_one] rfl ```
uk: Ось моє рішення: ``` rw [mul_comm, mul_one] rfl ```
zh: 这是我的解法： ``` rw [mul_comm, mul_one] rfl ```

source: This level is more important than you think; it plays a useful role when battling a big boss later on.
fr: Ce niveau est plus important que vous ne le pensez ; il joue un rôle utile lors du combat contre un gros boss plus tard.
it: Questo livello è più importante di quanto non sembri; giocherà un ruolo importante in uno dei boss successivi.
uk: Цей рівень важливіший, ніж ви думаєте; він грає важливу роль у подальшій боротьбі з великим босом.
zh: 这个关卡比你想象的更重要；在之后与一个大boss战斗时，它将帮助你。

source: `two_mul m` is the proof that `2 * m = m + m`.
fr: `two_mul m` est la preuve que `2 * m = m + m`.
it: `two_mul m` è la dimostrazione che `2 * m = m + m`.
uk: `two_mul m` є доказом того, що `2 * m = m + m`.
zh: `two_mul m` 是 `2 * m = m + m` 的证明。

source: For any natural number $m$, we have $ 2 \times m = m+m$.
fr: Pour tout nombre naturel $m$, nous avons $ 2 \times m = m+m$.
it: Per ogni numero naturale $m$, si ha che $ 2 \times m = m+m$.
uk: Для будь-якого натурального числа $m$ ми маємо $2 \times m = m+m$.
zh: 对于任何自然数 $m$，我们有 $ 2 \times m = m+m$。

source: Here's my solution: ``` rw [two_eq_succ_one, succ_mul, one_mul] rfl ```
fr: Voici ma solution : ``` rw [two_eq_succ_one, succ_mul, one_mul] rfl ```
it: Ecco come l'ho fatta io: ``` rw [two_eq_succ_one, succ_mul, one_mul] rfl ```
uk: Ось моє рішення: ``` rw [two_eq_succ_one, succ_mul, one_mul] rfl ```
zh: 这是我的解法： ``` rw [two_eq_succ_one, succ_mul, one_mul] rfl ```

source: Our next goal is "left and right distributivity", meaning $a(b+c)=ab+ac$ and $(b+c)a=ba+ca$. Rather than these slightly pompous names, the name of the proofs in Lean are descriptive. Let's start with `mul_add a b c`, the proof of `a * (b + c) = a * b + a * c`. Note that the left hand side contains a multiplication and then an addition.
fr: Notre prochain objectif est la "distributivité à gauche et à droite", c'est-à-dire $a(b+c)=ab+ac$ et $(b+c)a=ba+ca$. Plutôt que ces noms un peu pompeux, les noms des preuves dans Lean sont descriptifs. Commençons par `mul_add a b c`, la preuve de `a * (b + c) = a * b + a * c`. Notez que le côté gauche contient une multiplication puis une addition.
it: Il nostro nuovo obiettivo è dimostrare la "distributività sinistra e destra", ossia $a(b+c)=ab+ac$ e $(b+c)a=ba+ca$. Al posto di questo nome un po' tecnico e altisonante, le dimostrazioni di Lean hanno nomi descrittivi. Partiamo da `mul_add a b c`, la dimostrazione di `a * (b + c) = a * b + a * c`. Nota che a sinistra dell'uguale abbiamo la moltiplicazione di un'addizione.
uk: Наша наступна мета — «ліва та права дистрибутивність», що означає $a(b+c)=ab+ac$ і $(b+c)a=ba+ca$. Замість цих дещо пихатих назв, назви доказів в Lean є описовими. Почнемо із `mul_add a b c`, доказ того що `a * (b + c) = a * b + a * c`. Зверніть увагу, що ліва частина містить множення а потім додавання.
zh: 我们的下一个目标是“左右分配律”，意思是 $a(b+c)=ab+ac$ 和 $(b+c)a=ba+ca$。与其用这样稍显浮夸的名字，不如使用 Lean 中的证明名称，它们是描述性的。 让我们从 `mul_add a b c` 开始，这是 `a * (b + c) = a * b + a * c` 的证明。注意左边包含一个乘法然后是一个加法。

source: Multiplication distributes over addition on the left. `mul_add a b c` is the proof that `a * (b + c) = a * b + a * c`.
fr: La multiplication est distributive sur l'addition à gauche. `mul_add a b c` est la preuve que `a * (b + c) = a * b + a * c`.
it: La moltiplicazione si distribuisce sull'addizione a sinistra. `mul_add a b c` è la dimostrazione di `a * (b + c) = a * b + a * c`.
uk: Множення дістрібутивно над додаванням зліва. `mul_add a b c` є доказом того, що `a * (b + c) = a * b + a * c`.
zh: 乘法在左侧对加法具有分配性。 `mul_add a b c` 是 `a * (b + c) = a * b + a * c` 的证明。

source: Multiplication is distributive over addition on the left. In other words, for all natural numbers $a$, $b$ and $c$, we have $a(b + c) = ab + ac$.
fr: La multiplication est distributive sur l'addition à gauche. Autrement dit, pour tous les nombres naturels $a$, $b$ et $c$, nous avons $a(b + c) = ab + ac$.
it: La moltiplicazione è distributiva a sinistra rispetto all'addizione. Equivalentemente, per tutti i numeri naturali $a$, $b$ e $c$, si ha che $a(b + c) = ab + ac$.
uk: Множення дістрібутивно над додаванням зліва. Іншими словами, для всіх натуральних чисел $a$, $b$ і $c$ маємо $a(b + c) = ab + ac$.
zh: 乘法对左边的加法具有分配性。 换句话说，对于所有自然数 $a$、$b$ 和 $c$，我们有 $a(b + c) = ab + ac$。

source: You can do induction on any of the three variables. Some choices are harder to push through than others. Can you do the inductive step in 5 rewrites only?
fr: Vous pouvez faire une induction sur l'une des trois variables. Certains choix sont plus difficiles à mener que d'autres. Pouvez-vous faire l'étape inductive en seulement 5 réécritures ?
it: Puoi procedere per induzione su una qualsiasi delle tre variabili. Scegli bene, perché con certe scelte la dimostrazione si aggroviglia più che con altre. Riesci a dimostrare il caso induttivo in sole cinque sostituzioni?
uk: Ви можете провести індукцію по будь-якій із трьох змінних. Через деякі варіанти важче продертися, ніж через інші. Чи можете ви виконати індуктивний крок лише за 5 перезаписів?
zh: 你可以对任何三个变量中的任何一个进行归纳。有些选择比其他选择更难以推进。你能仅用5次改写完成归纳步骤吗？

source: Induction on `a` is the most troublesome, then `b`, and `c` is the easiest.
fr: L'induction sur `a` est la plus problématique, puis `b`, et `c` est la plus facile.
it: L'induzione su `a` è la più faticosa, mentre su `b`, o su `c` è più facile.
uk: Індукція по `a` є найбільш клопітною, потім по `b`, і індукція по `c` є найпростішою.
zh: 对 `a` 的归纳最麻烦，然后是 `b`、 而 `c` 是最简单的。

source: Here's my solution: ``` induction c with d hd rw [add_zero, mul_zero, add_zero] rfl rw [add_succ, mul_succ, hd, mul_succ, add_assoc] rfl ``` Inducting on `a` or `b` also works, but might take longer.
fr: Voici ma solution : ``` induction c with d hd rw [add_zero, mul_zero, add_zero] rfl rw [add_succ, mul_succ, hd, mul_succ, add_assoc] rfl ``` L'induction sur `a` ou `b` fonctionne aussi, mais pourrait prendre plus de temps à écrire.
it: Ecco come l'ho fatta io: ``` induction c with d hd rw [add_zero, mul_zero, add_zero] rfl rw [add_succ, mul_succ, hd, mul_succ, add_assoc] rfl ``` Si poteva risolvere anche per induzione su `a` or `b`, ma avrebbe richiesto più passi.
uk: Ось моє рішення: ``` induction c with d hd rw [add_zero, mul_zero, add_zero] rfl rw [add_succ, mul_succ, hd, mul_succ, add_assoc] rfl ``` Індукція по `a` або `b` також буде працювати, але це може зайняти більше часу.
zh: 这是一个解决方案，不唯一： ``` induction c with d hd rw [add_zero, mul_zero, add_zero] rfl rw [add_succ, mul_succ, hd, mul_succ, add_assoc] rfl ``` 在 `a` 或 `b` 上进行数学归纳也可以，但需要多步骤。

source: `add_mul` is just as fiddly to prove by induction; but there's a trick which avoids it. Can you spot it?
fr: `add_mul` est tout aussi délicat à prouver par induction ; mais il y a une astuce pour l'éviter. Pouvez-vous la trouver ?
it: `add_mul` è altrettanto macchinoso da dimostrare per induzione; ma c'è un trucco che ci permette di evitarla. Sai individuarlo?
uk: `add_mul` так само муторно довести індукцією; але є хитрість яка уникає її. Чи ви помітите цю хитрість?
zh: 用归纳法证明 `add_mul` 也很麻烦，但有个小窍门可以避免这个问题。 可以避免这个问题。你能发现吗？

source: `add_mul a b c` is a proof that $(a+b)c=ac+bc$.
fr: `add_mul a b c` est une preuve que $(a+b)c=ac+bc$.
it: `add_mul a b c` è la dimostrazione che $(a+b)c=ac+bc$.
uk: `add_mul a b c` є доказом того, що $(a+b)c=ac+bc$.
zh: `add_mul a b c` 是 $(a+b)c=ac+bc$ 的证明。

source: Addition is distributive over multiplication. In other words, for all natural numbers $a$, $b$ and $c$, we have $(a + b) \times c = ac + bc$.
fr: L'addition est distributive sur la multiplication. Autrement dit, pour tous les nombres naturels $a$, $b$ et $c$, nous avons $(a + b) \times c = ac + bc$.
it: L'addizione gode della proprietà distributiva sulla moltiplicazione. Equivalentemente, per tutti i numeri naturali $a$, $b$ e $c$, si ha che $(a + b) \times c = ac + bc$.
uk: Додавання діє дістрібутивно над множенням. Іншими словами, для всіх натуральних чисел $a$, $b$ і $c$ маємо $(a + b) \times c = ac + bc$.
zh: 加法和乘法有分配律。换句话说，对于所有自然数 $a$、$b$ 和 $c$， 我们有 $(a + b) \times c = ac + bc$。

source: Here's my proof: ``` rw [mul_comm, mul_add] repeat rw [mul_comm c] rfl ```
fr: Voici ma preuve : ``` rw [mul_comm, mul_add] repeat rw [mul_comm c] rfl ```
it: Ecco la mia dimostrazione: ``` rw [mul_comm, mul_add] repeat rw [mul_comm c] rfl ```
uk: Ось мій доказ: ``` rw [mul_comm, mul_add] repeat rw [mul_comm c] rfl ```
zh: 这是我的证明： ``` rw [mul_comm, mul_add] repeat rw [mul_comm c] rfl ```

source: We now have enough to prove that multiplication is associative, the boss level of multiplication world. Good luck!
fr: Nous avons maintenant assez de matière pour prouver que la multiplication est associative, le niveau boss du monde de la multiplication. Bonne chance !
it: Adesso abbiamo abbastanza informazioni per dimostrare che la moltiplicazione è associativa, il boss del Mondo Moltiplicazione. Avanti guerriero!
uk: Тепер у нас достатньо всього, щоб довести, що множення асоціативне, босовий рівень світу множення. Удачі!
zh: 我们现在有足够的工具去证明乘法服从结合律， 乘法世界的boss关。祝你好运！

source: `mul_assoc a b c` is a proof that `(a * b) * c = a * (b * c)`. Note that when Lean says `a * b * c` it means `(a * b) * c`. Note that `(a * b) * c = a * (b * c)` cannot be proved by \"pure thought\": for example subtraction is not associative, as `(6 - 2) - 1` is not equal to `6 - (2 - 1)`.
fr: `mul_assoc a b c` est une preuve que `(a * b) * c = a * (b * c)`. Notez que dans Lean `a * b * c` signifie `(a * b) * c`. Notez aussi que `(a * b) * c = a * (b * c)` ne peut pas être prouvé par "pensée pure" : par exemple, la soustraction n'est pas associative, car `(6 - 2) - 1` n'est pas égal à `6 - (2 - 1)`.
it: `mul_assoc a b c` è la dimostrazione che `(a * b) * c = a * (b * c)`. Ricorda che Lean per `a * b * c` intende `(a * b) * c`. Ricorda che `(a * b) * c = a * (b * c)` non è una legge universale della matematica": un esempio famoso di operazione non associativa è la sottrazione, dato che `(6 - 2) - 1` non è uguale a `6 - (2 - 1)`.
uk: `mul_assoc a b c` є доказом того, що `(a * b) * c = a * (b * c)`. Зауважте, що коли Lean каже `a * b * c`, це означає `(a * b) * c`. Зауважте, що `(a * b) * c = a * (b * c)` не можна довести \"лише подумки\": наприклад, віднімання не є асоціативним, як то `(6 - 2) - 1` не дорівнює `6 - (2 - 1)`.
zh: `mul_assoc a b c` 是 `(a * b) * c = a * (b * c)` 的证明。 请注意，当 Lean 表示 `a * b * c` 时，它的意思是 `(a * b) * c`。 请注意，`(a * b) * c = a * (b * c)` 不能仅凭“空想”来证明：例如，减法不是结合的，因为 `(6 - 2) - 1` 不等于 `6 - (2 - 1)`。

source: Multiplication is associative. In other words, for all natural numbers $a$, $b$ and $c$, we have $(ab)c = a(bc)$.
fr: La multiplication est associative. Autrement dit, pour tous les nombres naturels $a$, $b$ et $c$, nous avons $(ab)c = a(bc)$.
it: La moltiplicazione è un'operazione associativa. Equivalentemente, per tutti i numeri naturali $a$, $b$ e $c$, si ha che $(ab)c = a(bc)$.
uk: Множення асоціативне. Іншими словами, для всіх натуральних чисел $a$, $b$ і $c$ маємо $(ab)c = a(bc)$.
zh: 乘法服从结合律。 换句话说，对于所有自然数 $a$、$b$ 和 $c$，我们有 $(ab)c = a(bc)$。

source: A passing mathematician notes that you've proved that the natural numbers are a commutative semiring. If you want to begin your journey to the final boss, head for Power World.
fr: Un mathématicien de passage vous félicite d'avoir prouvé que les nombres naturels forment un semi-anneau commutatif. Si vous voulez commencer votre voyage vers le boss final, dirigez-vous vers le monde des Puissances.
it: Un matematico di passaggio nota che hai appena dimostrato che i numeri naturali sono un semianello commutativo. Se ti senti pronto per incamminarti verso il boss finale, dirigiti verso il Mondo Potenza.
uk: Математик, який проходив повз, зазначає, що ви довели що натуральні числа є комутативним півкільцем. Якщо ви хочете розпочати свою подорож до фінального боса, вирушайте до Світу ступеней.
zh: 一个路过的数学家指出，你已经证明了自然数是一个交换半环。 如果你想开始通往最终Boss的旅程，那就前往幂世界。

source: Multiplication World
fr: Monde de la Multiplication
it: Mondo Moltiplicazione
uk: Світ множення
zh: 乘法世界

source: How should we define `37 * x`? Just like addition, we need to give definitions when $x=0$ and when $x$ is a successor. The zero case is easy: we define `37 * 0` to be `0`. Now say we know `37 * d`. What should `37 * succ d` be? Well, that's $(d+1)$ $37$s, so it should be `37 * d + 37`. Here are the definitions in Lean. * `mul_zero a : a * 0 = 0` * `mul_succ a d : a * succ d = a * d + a` In this world, we must not only prove facts about multiplication like `a * b = b * a`, we must also prove facts about how multiplication interacts with addition, like `a * (b + c) = a * b + a * c`. Let's get started.
fr: Comment devrions-nous définir `37 * x` ? Tout comme pour l'addition, nous devons donner des définitions lorsque $x=0$ et lorsque $x$ est un successeur. Le cas zéro est facile : nous définissons `37 * 0` comme `0`. Maintenant, disons que nous connaissons `37 * d`. Que devrait être `37 * succ d` ? Eh bien, c'est $(d+1)$ fois $37$, donc cela devrait être `37 * d + 37`. Voici les définitions dans Lean. * `mul_zero a : a * 0 = 0` * `mul_succ a d : a * succ d = a * d + a` Dans ce monde, nous devons non seulement prouver des faits sur la multiplication comme `a * b = b * a`, mais aussi des faits sur la façon dont la multiplication interagit avec l'addition, comme `a * (b + c) = a * b + a * c`. Commençons.
it: Come si può definire `37 * x`? Come per l'addizione, dobbiamo dare la definizione per quando $x=0$ e quando $x$ è un successore. Il caso di zero è facile: definiamo `37 * 0` uguale a `0`. Ora, immaginiamo di sapere quanto fa `37 * d`. Quanto fa allora `37 * succ d`? Beh, non è altro che $37$ sommato a se stesso $(d+1)$ volte, quindi `37 * d + 37`. Ecco le due definizioni in Lean. * `mul_zero a : a * 0 = 0` * `mul_succ a d : a * succ d = a * d + a` In questo mondo non ci limiteremo a dimostrare fatti riguardanti solo la moltiplicazione come `a * b = b * a`, ma anche fatti su come la moltiplicazione interagisce con l'addizione, come `a * (b + c) = a * b + a * c`. Iniziamo!
uk: Як нам визначити `37 * x`? Як і додавання, нам потрібно дати визначення коли $x=0$ і коли $x$ є наступником. Нульовий випадок простий: ми визначаємо `37 * 0` як `0`. Тепер скажіть, що ми знаємо `37 * d`. Чим має бути `37 * succ d`? Ну, це $(d+1)$ $37$s, тому має бути `37 * d + 37`. Ось визначення в Lean. * `mul_zero a : a * 0 = 0` * `mul_succ a d : a * succ d = a * d + a` У цьому світі ми повинні не лише доводити такі факти про множення, як `a * b = b * a`, ми також повинні довести факти про те, як множення взаємодіє з додаванням, наприклад `a * (b + c) = a * b + a * c`. Давайте почнемо.
zh: 我们应该如何定义 `37 * x`？就像加法一样，我们需要在 $x=0$ 和 $x$ 是后继数时给出定义。 0的情况很简单：我们定义 `37 * 0` 为 `0`。现在假设我们知道 `37 * d`。`37 * succ d` 应该是什么呢？嗯，那是 $d+1$ 个 $37$，它应该是 `37 * d + 37`。 以下是 Lean 中的定义。 * `mul_zero a : a * 0 = 0` * `mul_succ a d : a * succ d = a * d + a` 在这个世界中，我们不仅要证明关于乘法的事实，如 `a * b = b * a`，我们还必须证明乘法与加法相互作用的事实，如 `a * (b + c) = a * b + a * c`。 让我们开始吧。

source: Mathematicians sometimes debate what `0 ^ 0` is; the answer depends, of course, on your definitions. In this game, `0 ^ 0 = 1`. See if you can prove it. Check out the *Pow* tab in your list of theorems to see the new proofs which are available.
fr: Les mathématiciens débattent parfois de ce qu'est `0 ^ 0` ; la réponse dépend, bien sûr, de vos définitions. Dans ce jeu, `0 ^ 0 = 1`. Voyez si vous pouvez le prouver. Consultez l'onglet *Pow* dans votre liste de théorèmes pour voir les nouvelles preuves disponibles.
it: Cosa rappresenta `0 ^ 0` è oggetto di dibattito tra i matematici; la risposta dipende, ovviamente, dalle tue definizioni. In questo gioco, `0 ^ 0 = 1`. Prova a dimostrarlo. Guarda nel tab *^* nell'elenco di teoremi per vedere le nuove dimostrazioni disponibili.
uk: Математики іноді сперечаються, що таке `0 ^ 0`; відповідь залежить, звичайно, від ваших визначень. У цієй грі, `0 ^ 0 = 1`. Подивіться, чи зможете ви це довести. Перегляньте вкладку *Ступінь* у списку теорем щоб побачити нові доступні докази.
zh: 数学家们有时会争论 `0 ^ 0` 是什么； 答案当然取决于你的定义。在这个 游戏中，`0 ^ 0 = 1`。看看你能否证明这一点。 查看定理列表中的 *Pow* 选项卡 标签，查看可用的新证明。

source: `Pow a b`, with notation `a ^ b`, is the usual exponentiation of natural numbers. Internally it is defined via two axioms: * `pow_zero a : a ^ 0 = 1` * `pow_succ a b : a ^ succ b = a ^ b * a` Note in particular that `0 ^ 0 = 1`.
fr: `Pow a b`, avec la notation `a ^ b`, est l'exponentiation habituelle des nombres naturels, c'est à dire `a` puissance `b. En interne, elle est définie par deux axiomes : * `pow_zero a : a ^ 0 = 1` * `pow_succ a b : a ^ succ b = a ^ b * a` Notez en particulier que `0 ^ 0 = 1`.
it: `Pow a b`, con notazione `a ^ b`, è l'elevamento a potenza sui numeri naturali. Dentro Lean è definita tramite due assiomi: * `pow_zero a : a ^ 0 = 1` * `pow_succ a b : a ^ succ b = a ^ b * a` In particolare, dal primo segue che `0 ^ 0 = 1`.
uk: `Pow a b` із нотацією `a ^ b` є звичайним піднесення натуральних чисел до ступеня. Всередині це так визначається за допомогою двох аксіом: * `pow_zero a : a ^ 0 = 1` * `pow_succ a b : a ^ succ b = a ^ b * a` Зокрема, зауважте, що `0 ^ 0 = 1`.
zh: `Pow a b`，其符号表示为 `a ^ b`，是自然数的常规指数运算。在内部，它是通过两个公理定义的： * `pow_zero a : a ^ 0 = 1` * `pow_succ a b : a ^ succ b = a ^ b * a` 特别要注意的是 `0 ^ 0 = 1`。

source: `pow_zero a : a ^ 0 = 1` is one of the two axioms defining exponentiation in this game.
fr: `pow_zero a : a ^ 0 = 1` est l'un des deux axiomes définissant l'exponentiation dans ce jeu.
it: `pow_zero a : a ^ 0 = 1` è uno dei due assiomi che definiscono l'elevamento a potenza in questo gioco.
uk: `pow_zero a : a ^ 0 = 1` є однією з двох аксіом визначення ступеня в цій грі.
zh: `pow_zero a : a ^ 0 = 1` 是两个公理之一 在这个游戏中定义指数。

source: Mathematicians sometimes argue that `0 ^ 0 = 0` is also a good convention. But it is not a good convention in this game; all the later levels come out beautifully with the convention that `0 ^ 0 = 1`.
fr: Les mathématiciens soutiennent parfois que `0 ^ 0 = 0` est aussi une bonne convention. Mais ce n'est pas une bonne convention dans ce jeu ; tous les niveaux suivants fonctionnent parfaitement avec la convention que `0 ^ 0 = 1`.
it: Certi matematici sostengono che `0 ^ 0 = 0` sia pure una convenzione ragionevole. Tuttavia non va d'accordo con il modo in cui abbiamo strutturato i livelli successivi del gioco, e nell'intento di difendere la loro eleganza matematica rimaniamo fermi sulla convenzione `0 ^ 0 = 1`.
uk: Математики іноді сперечаються, що `0 ^ 0 = 0` теж є хороша конвенція. Але це не є хорошою конвенцією в цій грі; всі подальші рівні виконуються чудово з конвенцією, що `0 ^ 0 = 1`.
zh: 数学家有时会争论说 0 ^ 0 = 0 也是一个很好的约定。 但在本游戏中，这不是一个好的约定；所有后面的关卡也全都遵循 0 ^ 0 = 1 的约定。

source: We've just seen that `0 ^ 0 = 1`, but if `n` is a successor, then `0 ^ n = 0`. We prove that here.
fr: Nous venons de voir que `0 ^ 0 = 1`, mais si `n` est un successeur, alors `0 ^ n = 0`. Nous le prouvons ici.
it: Abbiamo appena visto che `0 ^ 0 = 1`, ma se l'esponente `n` è un successore, allora `0 ^ n = 0`. Lo dimostriamo in questo livello.
uk: Ми щойно бачили, що `0 ^ 0 = 1`, але якщо `n` є наступником, тоді `0 ^ n = 0`. Ми доведемо це тут.
zh: 我们刚刚看到 `0 ^ 0 = 1`，但如果 `n` 是后继数， 则 `0 ^ n = 0`。我们将在这里证明这一点。

source: `pow_succ a b : a ^ (succ b) = a ^ b * a` is one of the two axioms defining exponentiation in this game.
fr: `pow_succ a b : a ^ (succ b) = a ^ b * a` est l'un des deux axiomes définissant l'exponentiation dans ce jeu.
it: `pow_succ a b : a ^ (succ b) = a ^ b * a` è uno dei due assiomi che definiscono l'elevamento a potenza in questo gioco.
uk: `pow_succ a b : a ^ (succ b) = a ^ b * a` є однією із двох аксіом, що визначають піднесення до ступеня в цій грі.
zh: `pow_succ a b : a ^ (succ b) = a ^ b * a` 是定义这个游戏中幂的两个公理中的一个。

source: Although $0^0=1$ in this game, $0^n=0$ if $n>0$, i.e., if $n$ is a successor.
fr: Bien que $0^0=1$ dans ce jeu, $0^n=0$ si $n>0$, c'est-à-dire si $n$ est un successeur.
it: Sebbene definiamo $0^0=1$ in questo gioco, $0^n=0$ se $n>0$, ossia se $n$ è un successore.
uk: Хоча $0^0=1$ у цій грі, $0^n=0$, якщо $n>0$, тобто якщо $n$ є наступником.
zh: 虽然在这个游戏中 $0^0=1$，但如果 $n>0$，即如果 $n$ 是后继数，那么 $0^n=0$。

source: For all numbers $m$, $0 ^{\operatorname{succ} (m)} = 0$.
fr: Pour tous les nombres $m$, $0 ^{\operatorname{succ} (m)} = 0$.
it: Per tutti i numeri naturali $m$, $0 ^{\operatorname{succ} (m)} = 0$.
uk: Для всіх чисел $m$ $0 ^{\operatorname{succ} (m)} = 0$.
zh: 对于所有自然数 $m$、$0 ^{\operatorname{succ} (m)} = 0$。

source: `pow_one a` says that `a ^ 1 = a`. Note that this is not quite true by definition: `a ^ 1` is defined to be `a ^ 0 * a` so it's `1 * a`, and to prove that this is equal to `a` you need to use induction somewhere.
fr: `pow_one a` dit que `a ^ 1 = a`. Notez que ce n'est pas tout à fait vrai par définition : `a ^ 1` est défini comme `a ^ 0 * a`, donc c'est `1 * a`, et pour prouver que cela est égal à `a`, vous devez utiliser l'induction quelque part.
it: `pow_one a` afferma `a ^ 1 = a`. Questo fatto non deriva direttamente dalla definizione: `a ^ 1` si espande in `a ^ 0 * a` ovvero `1 * a`, e abbiamo visto che per dimostrare che tale prodotto è uguale ad `a` bisogna usare l'induzione.
uk: `pow_one a` говорить, що `a ^ 1 = a`. Зверніть увагу, що це не зовсім так за визначенням: `a ^ 1` є визначеним як `a ^ 0 * a`, тому це `1 * a`, і щоб довести що це дорівнює `a`, вам потрібно десь використати індукцію.
zh: `pow_one a` 表示 `a ^ 1 = a`。 请注意，这并不是完全根据定义来的：`a ^ 1` 被定义为 `a ^ 0 * a`，所以它是 `1 * a`，要证明这等于 `a`，你需要在某处使用数学归纳。

source: For all naturals $a$, $a ^ 1 = a$.
fr: Pour tous les naturels $a$, $a ^ 1 = a$.
it: Per tutti i numeri naturali $a$, $a ^ 1 = a$.
uk: Для всіх натуральних чисел $a$ $a ^ 1 = a$.
zh: 对于所有自然数 $a$、$a ^ 1 = a$。

source: `one_pow n` is a proof that $1^n=1$.
fr: `one_pow n` est une preuve que $1^n=1$.
it: `one_pow n` è la dimostrazione che $1^n=1$.
uk: `one_pow n` є доказом того, що $1^n=1$.
zh: `one_pow n` 是 $1^n=1$ 的证明。

source: For all naturals $m$, $1 ^ m = 1$.
fr: Pour tous les naturels $m$, $1 ^ m = 1$.
it: Per tutti i numeri naturali $m$, $1 ^ m = 1$.
uk: Для всіх натуральних чисел $m$ $1 ^ m = 1$.
zh: 对于所有自然数 $m$、$1 ^ m = 1$。

source: Note: this lemma will be useful for the final boss!
fr: Note : ce lemme sera utile pour le boss final !
it: Nota: questo lemma sarà d'aiuto per il boss finale!
uk: Примітка: ця лема буде корисною для фінального боса!
zh: 注意：这个引理对于解决最终的 Boss 很有用！

source: `pow_two a` says that `a ^ 2 = a * a`.
fr: `pow_two a` dit que `a ^ 2 = a * a`.
it: `pow_two a` afferma `a ^ 2 = a * a`.
uk: `pow_two a` говорить, що `a ^ 2 = a * a`.
zh: `pow_two a` 代表了 `a ^ 2 = a * a`。

source: For all naturals $a$, $a ^ 2 = a \times a$.
fr: Pour tous les naturels $a$, $a ^ 2 = a \times a$.
it: Per tutti i numeri naturali $a$, $a ^ 2 = a \times a$.
uk: Для всіх натуральних чисел $a$ $a ^ 2 = a \times a$.
zh: 对于所有自然数 $a$、$a ^ 2 = a \times a$。

source: Let's now begin our approach to the final boss, by proving some more subtle facts about powers.
fr: Commençons maintenant notre approche vers le boss final, en prouvant des faits plus subtils sur les puissances.
it: Vediamo meglio come affrontare il boss finale, dimostrando altre proprietà insidiose delle potenze.
uk: Давайте почнемо наш підхід до фінального боса, доводячи деякі більш тонкі факти про ступені.
zh: 现在让我们开始通过证明一些关于幂的更微妙的事实来接近最终的boss。
